{
    "version": "https://jsonfeed.org/version/1",
    "title": "JavaScript(en) on Google Book",
    "home_page_url": "https://azu.github.io/book-rss/JavaScript-en.json",
    "description": "JavaScript(en) on Google Book",
    "items": [
        {
            "content_html": "Little known to many, R works just as well with JavaScript—this book delves into the various ways both languages can work together. The ultimate aim of this work is to put the reader at ease with inviting JavaScript in their data science workflow. In that respect the book is not teaching one JavaScript but rather we show how little JavaScript can greatly support and enhance R code. Therefore, the focus is on integrating external JavaScript libraries and no prior knowledge of JavaScript is required. Key Features: ● Easy to pick up. ● An entry way to learning JavaScript for R. ● Covers topics not covered anywhere else. ● Easy to follow along.<br><blockquote>The ultimate aim of this work is to put the reader at ease with inviting JavaScript in their data science workflow.</blockquote>",
            "url": "http://books.google.com/books?id=ntUxEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=1&source=gbs_api",
            "title": "Javascript for R",
            "summary": "Little known to many, R works just as well with JavaScript—this book delves into the various ways both languages can work together. The ultimate aim of this work is to put the reader at ease with inviting JavaScript in their data science workflow. In that respect the book is not teaching one JavaScript but rather we show how little JavaScript can greatly support and enhance R code. Therefore, the focus is on integrating external JavaScript libraries and no prior knowledge of JavaScript is required. Key Features: ● Easy to pick up. ● An entry way to learning JavaScript for R. ● Covers topics not covered anywhere else. ● Easy to follow along.",
            "image": "http://books.google.com/books/content?id=ntUxEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-07-16T00:00:00.000Z"
        },
        {
            "content_html": "This book if for absolute beginners, and it is an introduction to the major components of javascript. By learning the bigger things in Javascript, you will be able to know how to put the remaining pieces together and will be able to get into advanced books more prepared. WHAT IS JAVASCRIPT? JavaScript is one of the most popular programming languages in the world, and growing faster than any other programming language. As a developer, you can use JavaScript to build web and mobile apps, real-time networking apps, command-line tools, and games. 4 REASONS TO LEARN JAVASCRIPT JavaScript is a key tool for front-end, back-end, and full-stack developers. The average annual salary for a JavaScript developer is $72,000. Companies like Walmart, Netflix, and PayPal run big internal applications around JavaScript. Having strong JavaScript knowledge will help you land your dream job. Who this book is for: This book is meant for absolute beginners of Javascript This book is meant for students that struggled to learn the language before This book is meant for students with a little HTML knowledge<br><blockquote>This book if for absolute beginners, and it is an introduction to the major components of javascript.</blockquote>",
            "url": "http://books.google.com/books?id=z7D2DwAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=2&source=gbs_api",
            "title": "2021 JavaScript Programming for Beginners",
            "summary": "This book if for absolute beginners, and it is an introduction to the major components of javascript. By learning the bigger things in Javascript, you will be able to know how to put the remaining pieces together and will be able to get into advanced books more prepared. WHAT IS JAVASCRIPT? JavaScript is one of the most popular programming languages in the world, and growing faster than any other programming language. As a developer, you can use JavaScript to build web and mobile apps, real-time networking apps, command-line tools, and games. 4 REASONS TO LEARN JAVASCRIPT JavaScript is a key tool for front-end, back-end, and full-stack developers. The average annual salary for a JavaScript developer is $72,000. Companies like Walmart, Netflix, and PayPal run big internal applications around JavaScript. Having strong JavaScript knowledge will help you land your dream job. Who this book is for: This book is meant for absolute beginners of Javascript This book is meant for students that struggled to learn the language before This book is meant for students with a little HTML knowledge",
            "image": "http://books.google.com/books/content?id=z7D2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-07-01T00:00:00.000Z"
        },
        {
            "content_html": "Got basic programming skills but are new to JavaScript? Ready to pitch in and save humanity from the zombie hordes? Now you can do both at the same time. You’ll learn how to work with JavaScript objects, creating and setting properties, defining and using methods and the way objects are used in the Document Object Model (DOM). All while kicking serious zombie tuchus. Speaking of the DOM you’ll become comfortable working with it, selecting elements out of it, creating elements and adding them to it and removing any apocalyptic elements that might slip through. Once you have all that under your post-apocalyptic utility belt you’ll then be introduced to events, event handlers and how to utilize them. By the end of this book you should be ready to manipulate a web page into post-apocalyptic submission (which is like normal submission except it’s, you know, like, after the apocalypse). How You'll Learn to Smack Zombies Around You won't just passively take in the view, like a zombie shuffling across the mainland. You’ll have plenty of combat practice with analogies, examples, and code tutorials you can build, break and fix again. Working with your hands and your head you’ll craft code that pleases the eye and knocks a zombie into last Tuesday. All the code and directions are provided as both codepen tutorials and downloadable html files, so you can fight the apocalypse how and where you like. You can work with them on the codepen site or on your own device. And later you'll bring those skills together in a final project that cements those skills into zombie smashing muscle memory. Why Zombies? Are zombies just a gimmick? Why would this be any better than a straight laced book that sticks to the facts? Straight laced books are often straight boring. And if you have insomnia problems go buy that book. The author, John, has read the boring books and knows that staying awake and engaged are also important for learning. But this book uses zombie references and analogies not just to make you smile, but to help the material stick. If a tough technical concept is related in silly terms you understand, like a zombie trying to buy gum at a super market, it’s much more likely to stay in that brain those zombies are intent on eating.<br><blockquote>The author, John, has read the boring books and knows that staying awake and engaged are also important for learning. But this book uses zombie references and analogies not just to make you smile, but to help the material stick.</blockquote>",
            "url": "http://books.google.com/books?id=QhErEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=3&source=gbs_api",
            "title": "JavaScript Basics",
            "summary": "Got basic programming skills but are new to JavaScript? Ready to pitch in and save humanity from the zombie hordes? Now you can do both at the same time. You’ll learn how to work with JavaScript objects, creating and setting properties, defining and using methods and the way objects are used in the Document Object Model (DOM). All while kicking serious zombie tuchus. Speaking of the DOM you’ll become comfortable working with it, selecting elements out of it, creating elements and adding them to it and removing any apocalyptic elements that might slip through. Once you have all that under your post-apocalyptic utility belt you’ll then be introduced to events, event handlers and how to utilize them. By the end of this book you should be ready to manipulate a web page into post-apocalyptic submission (which is like normal submission except it’s, you know, like, after the apocalypse). How You'll Learn to Smack Zombies Around You won't just passively take in the view, like a zombie shuffling across the mainland. You’ll have plenty of combat practice with analogies, examples, and code tutorials you can build, break and fix again. Working with your hands and your head you’ll craft code that pleases the eye and knocks a zombie into last Tuesday. All the code and directions are provided as both codepen tutorials and downloadable html files, so you can fight the apocalypse how and where you like. You can work with them on the codepen site or on your own device. And later you'll bring those skills together in a final project that cements those skills into zombie smashing muscle memory. Why Zombies? Are zombies just a gimmick? Why would this be any better than a straight laced book that sticks to the facts? Straight laced books are often straight boring. And if you have insomnia problems go buy that book. The author, John, has read the boring books and knows that staying awake and engaged are also important for learning. But this book uses zombie references and analogies not just to make you smile, but to help the material stick. If a tough technical concept is related in silly terms you understand, like a zombie trying to buy gum at a super market, it’s much more likely to stay in that brain those zombies are intent on eating.",
            "image": "http://books.google.com/books/content?id=QhErEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-05-01T00:00:00.000Z"
        },
        {
            "content_html": "A hands-on, practical Introduction to coding! Do you want to learn to code? Perhaps you want to learn how to build the next social media sensation or blockbuster game? Or perhaps you just want to get some valuable coding experience under your belt? This easy-to-follow, practical, and fun guide is the perfect place to start on your coding journey. You'll be learning to program with JavaScript - the most popular programming language on Earth. And it runs in web browsers, making it particularly suited to creating web-based apps and games. But the principles and techniques that you'll learn will provide you with a foundation to go on and learn many other languages, too. You'll learn: Programming basics, including data types, variables and more How to use logic to control the flow of a program How to use loops to repeat code over and over again How to write functions that can be used to store code in reusable blocks How to store data in collections such as arrays, sets and maps How to create objects that store properties and actions And much more! Along the way, you'll build a collection of fun applications, including games and interactive web pages. Start learning to code today!<br><blockquote>A hands-on, practical Introduction to coding!</blockquote>",
            "url": "http://books.google.com/books?id=SrIlEAAAQBAJ&pg=PA1&dq=JavaScript&hl=&cd=4&source=gbs_api",
            "title": "Learn to Code With JavaScript",
            "summary": "A hands-on, practical Introduction to coding! Do you want to learn to code? Perhaps you want to learn how to build the next social media sensation or blockbuster game? Or perhaps you just want to get some valuable coding experience under your belt? This easy-to-follow, practical, and fun guide is the perfect place to start on your coding journey. You'll be learning to program with JavaScript - the most popular programming language on Earth. And it runs in web browsers, making it particularly suited to creating web-based apps and games. But the principles and techniques that you'll learn will provide you with a foundation to go on and learn many other languages, too. You'll learn: Programming basics, including data types, variables and more How to use logic to control the flow of a program How to use loops to repeat code over and over again How to write functions that can be used to store code in reusable blocks How to store data in collections such as arrays, sets and maps How to create objects that store properties and actions And much more! Along the way, you'll build a collection of fun applications, including games and interactive web pages. Start learning to code today!",
            "image": "http://books.google.com/books/content?id=SrIlEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-03-16T00:00:00.000Z"
        },
        {
            "content_html": "Learn to use JavaScript, the popular scripting language that allows web page authors to develop interactive web pages and sites. Carey/Vodnik's JAVASCRIPT FOR WEB WARRIORS, Seventh Edition introduces a variety of techniques that focus on what you need to know to begin using JavaScript right away. Step-by-step tasks within each chapter highlight particular techniques essential for building actual JavaScript programs. Guided activities reinforce skills and build in complexity as you progress. You also study debugging techniques. Using accompanying MindTap digital resources, you read and immediately practice with embedded JavaScript coding exercises in an authentic integrated development environment (IDE). Learning objectives, summaries, review and key terms highlight major concepts while reinforcement exercises let you further practice new techniques. After completing your course, you will able to use JavaScript to build professional quality web applications.<br><blockquote>Carey/Vodnik&#39;s JAVASCRIPT FOR WEB WARRIORS, Seventh Edition introduces a variety of techniques that focus on what you need to know to begin using JavaScript right away.</blockquote>",
            "url": "http://books.google.com/books?id=SVlIzgEACAAJ&dq=JavaScript&hl=&cd=5&source=gbs_api",
            "title": "JavaScript for Web Warriors",
            "summary": "Learn to use JavaScript, the popular scripting language that allows web page authors to develop interactive web pages and sites. Carey/Vodnik's JAVASCRIPT FOR WEB WARRIORS, Seventh Edition introduces a variety of techniques that focus on what you need to know to begin using JavaScript right away. Step-by-step tasks within each chapter highlight particular techniques essential for building actual JavaScript programs. Guided activities reinforce skills and build in complexity as you progress. You also study debugging techniques. Using accompanying MindTap digital resources, you read and immediately practice with embedded JavaScript coding exercises in an authentic integrated development environment (IDE). Learning objectives, summaries, review and key terms highlight major concepts while reinforcement exercises let you further practice new techniques. After completing your course, you will able to use JavaScript to build professional quality web applications.",
            "image": "http://books.google.com/books/content?id=SVlIzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2021-08-18T00:00:00.000Z"
        },
        {
            "content_html": "Testing JavaScript Applications teaches you how to implement an automated testing plan for JavaScript-based web applications. Summary Automated testing will help you write high-quality software in less time, with more confidence, fewer bugs, and without constant manual oversight. Testing JavaScript Applications is a guide to building a comprehensive and reliable JS application testing suite, covering both how to write tests and how JS testing tools work under the hood. You’ll learn from Lucas de Costa, a core contributor to popular JS testing libraries, as he shares a quality mindset for making testing decisions that deliver a real contribution to your business. You’ll benefit from informative explanations and diagrams, easily-transferable code samples, and useful tips on using the latest and most consolidated libraries and frameworks of the JavaScript ecosystem. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the technology Automated testing is essential to delivering good JavaScript applications every time. A complete testing strategy needs to cover functions in isolation, integration between different parts of your code, and correctness from the end user’s perspective. This book will teach you how to deliver reliable software quickly and confidently. About the book Testing JavaScript Applications teaches you how to implement an automated testing plan for JavaScript-based web applications. It describes practical testing strategies, covers useful tools and libraries, and explains how to foster a culture of quality. In this clearly-written, example-rich book, you’ll explore approaches for both backend and frontend applications and learn how to validate your software much more quickly and reliably. What's inside Unit, end-to-end, and integration testing Managing test cost and complexity Practicing test-driven development Dealing with external dependencies Tools like like Jest and Cypress About the reader For junior JavaScript developers. About the author Lucas da Costa is a core maintainer of Chai and Sinon.JS, two of the most popular testing tools in the JavaScript ecosystem, and contributed to numerous other open-source projects, including Jest. Table of Contents PART 1 - TESTING JAVASCRIPT APPLICATIONS 1 An introduction to automated testing 2 What to test and when? Part 2 - WRITING TESTS 3 Testing techniques 4 Testing backend applications 5 Advanced backend testing techniques 6 Testing frontend applications 7 The React testing ecosystem 8 Testing React applications 9 Test-driven development 10 UI-based end-to-end testing 11 Writing UI-based end-to-end tests PART 3 - BUSINESS IMPACT 12 Continuous integration and continuous delivery 13 A culture of quality<br><blockquote>This book will teach you how to deliver reliable software quickly and confidently. About the book Testing JavaScript Applications teaches you how to implement an automated testing plan for JavaScript-based web applications.</blockquote>",
            "url": "http://books.google.com/books?id=JTgzEAAAQBAJ&pg=PR1&dq=JavaScript&hl=&cd=6&source=gbs_api",
            "title": "Testing JavaScript Applications",
            "summary": "Testing JavaScript Applications teaches you how to implement an automated testing plan for JavaScript-based web applications. Summary Automated testing will help you write high-quality software in less time, with more confidence, fewer bugs, and without constant manual oversight. Testing JavaScript Applications is a guide to building a comprehensive and reliable JS application testing suite, covering both how to write tests and how JS testing tools work under the hood. You’ll learn from Lucas de Costa, a core contributor to popular JS testing libraries, as he shares a quality mindset for making testing decisions that deliver a real contribution to your business. You’ll benefit from informative explanations and diagrams, easily-transferable code samples, and useful tips on using the latest and most consolidated libraries and frameworks of the JavaScript ecosystem. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the technology Automated testing is essential to delivering good JavaScript applications every time. A complete testing strategy needs to cover functions in isolation, integration between different parts of your code, and correctness from the end user’s perspective. This book will teach you how to deliver reliable software quickly and confidently. About the book Testing JavaScript Applications teaches you how to implement an automated testing plan for JavaScript-based web applications. It describes practical testing strategies, covers useful tools and libraries, and explains how to foster a culture of quality. In this clearly-written, example-rich book, you’ll explore approaches for both backend and frontend applications and learn how to validate your software much more quickly and reliably. What's inside Unit, end-to-end, and integration testing Managing test cost and complexity Practicing test-driven development Dealing with external dependencies Tools like like Jest and Cypress About the reader For junior JavaScript developers. About the author Lucas da Costa is a core maintainer of Chai and Sinon.JS, two of the most popular testing tools in the JavaScript ecosystem, and contributed to numerous other open-source projects, including Jest. Table of Contents PART 1 - TESTING JAVASCRIPT APPLICATIONS 1 An introduction to automated testing 2 What to test and when? Part 2 - WRITING TESTS 3 Testing techniques 4 Testing backend applications 5 Advanced backend testing techniques 6 Testing frontend applications 7 The React testing ecosystem 8 Testing React applications 9 Test-driven development 10 UI-based end-to-end testing 11 Writing UI-based end-to-end tests PART 3 - BUSINESS IMPACT 12 Continuous integration and continuous delivery 13 A culture of quality",
            "image": "http://books.google.com/books/content?id=JTgzEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-03-16T00:00:00.000Z"
        },
        {
            "content_html": "Use R 4, RStudio, Tidyverse, and Shiny to interrogate and analyze your data, and then use the D3 JavaScript library to format and display that data in an elegant, informative, and interactive way. You will learn how to gather data effectively, and also how to understand the philosophy and implementation of each type of chart, so as to be able to represent the results visually. With the popularity of the R language, the art and practice of creating data visualizations is no longer the preserve of mathematicians, statisticians, or cartographers. As technology leaders, we can gather metrics around what we do and use data visualizations to communicate that information. Pro Data Visualization Using R and JavaScript combines the power of the R language with the simplicity and familiarity of JavaScript to display clear and informative data visualizations. Gathering and analyzing empirical data is the key to truly understanding anything. We can track operational metrics to quantify the health of our products in production. We can track quality metrics of our projects, and even use our data to identify bad code. Visualizing this data allows anyone to read our analysis and easily get a deep understanding of the story the data tells. This book makes the R language approachable, and promotes the idea of data gathering and analysis mostly using web interfaces. What You Will Learn Carry out data visualization using R and JavaScript Use RStudio for data visualization Harness Tidyverse data pipelines Apply D3 and R Notebooks towards your data Work with the R Plumber API generator, Shiny, and more Who This Book Is For Programmers and data scientists/analysts who have some prior experience with R and JavaScript.<br><blockquote>This book makes the R language approachable, and promotes the idea of data gathering and analysis mostly using web interfaces.</blockquote>",
            "url": "http://books.google.com/books?id=DzF9zgEACAAJ&dq=JavaScript&hl=&cd=7&source=gbs_api",
            "title": "Pro Data Visualization Using R and JavaScript",
            "summary": "Use R 4, RStudio, Tidyverse, and Shiny to interrogate and analyze your data, and then use the D3 JavaScript library to format and display that data in an elegant, informative, and interactive way. You will learn how to gather data effectively, and also how to understand the philosophy and implementation of each type of chart, so as to be able to represent the results visually. With the popularity of the R language, the art and practice of creating data visualizations is no longer the preserve of mathematicians, statisticians, or cartographers. As technology leaders, we can gather metrics around what we do and use data visualizations to communicate that information. Pro Data Visualization Using R and JavaScript combines the power of the R language with the simplicity and familiarity of JavaScript to display clear and informative data visualizations. Gathering and analyzing empirical data is the key to truly understanding anything. We can track operational metrics to quantify the health of our products in production. We can track quality metrics of our projects, and even use our data to identify bad code. Visualizing this data allows anyone to read our analysis and easily get a deep understanding of the story the data tells. This book makes the R language approachable, and promotes the idea of data gathering and analysis mostly using web interfaces. What You Will Learn Carry out data visualization using R and JavaScript Use RStudio for data visualization Harness Tidyverse data pipelines Apply D3 and R Notebooks towards your data Work with the R Plumber API generator, Shiny, and more Who This Book Is For Programmers and data scientists/analysts who have some prior experience with R and JavaScript.",
            "date_modified": "2022-05-28T00:00:00.000Z"
        },
        {
            "content_html": "Whether for building interactive browser-based applications or creating server-side applications in Node, JavaScript is the most widely used language for web programming. With new features, language improvements, paradigms, and potential use cases appearing regularly, there's never been a more exciting time to be a JavaScript developer. In The Joy of JavaScript, author and JavaScript expert Luis Atencio teaches you key design concepts that lead to clean, lean, modular, and easy-to-maintain code. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.<br><blockquote>Because one of the largest segments of <b>JavaScript</b> developers comes from class-oriented languages, to ensure their seamless transition, it was decided to&nbsp;...</blockquote>",
            "url": "http://books.google.com/books?id=os8cEAAAQBAJ&pg=PA24&dq=JavaScript&hl=&cd=8&source=gbs_api",
            "title": "The Joy of JavaScript",
            "summary": "Whether for building interactive browser-based applications or creating server-side applications in Node, JavaScript is the most widely used language for web programming. With new features, language improvements, paradigms, and potential use cases appearing regularly, there's never been a more exciting time to be a JavaScript developer. In The Joy of JavaScript, author and JavaScript expert Luis Atencio teaches you key design concepts that lead to clean, lean, modular, and easy-to-maintain code. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.",
            "image": "http://books.google.com/books/content?id=os8cEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-03-02T00:00:00.000Z"
        },
        {
            "content_html": "Whether for building interactive browser-based applications or creating server-side applications in Node, JavaScript is the most widely used language for web programming. With new features, language improvements, paradigms, and potential use cases appearing regularly, there's never been a more exciting time to be a JavaScript developer. In The Joy of JavaScript, author and JavaScript expert Luis Atencio teaches you key design concepts that lead to clean, lean, modular, and easy-to-maintain code. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.<br><blockquote>Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.</blockquote>",
            "url": "http://books.google.com/books?id=os8cEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=9&source=gbs_api",
            "title": "The Joy of JavaScript",
            "summary": "Whether for building interactive browser-based applications or creating server-side applications in Node, JavaScript is the most widely used language for web programming. With new features, language improvements, paradigms, and potential use cases appearing regularly, there's never been a more exciting time to be a JavaScript developer. In The Joy of JavaScript, author and JavaScript expert Luis Atencio teaches you key design concepts that lead to clean, lean, modular, and easy-to-maintain code. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.",
            "image": "http://books.google.com/books/content?id=os8cEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-03-02T00:00:00.000Z"
        },
        {
            "content_html": "This book will show you how you can leverage your Python skills to learn JavaScript by comparing them at the syntactical and semantical level. You’ll discover why and when to use JavaScript, connect to a Node.js backend to create meaningful experiences, and finally create a full-stack application utilizing all layers of a web application.<br><blockquote>This book will show you how you can leverage your Python skills to learn JavaScript by comparing them at the syntactical and semantical level.</blockquote>",
            "url": "http://books.google.com/books?id=-cL_DwAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=10&source=gbs_api",
            "title": "Hands-on JavaScript for Python Developers",
            "summary": "This book will show you how you can leverage your Python skills to learn JavaScript by comparing them at the syntactical and semantical level. You’ll discover why and when to use JavaScript, connect to a Node.js backend to create meaningful experiences, and finally create a full-stack application utilizing all layers of a web application.",
            "image": "http://books.google.com/books/content?id=-cL_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2020-09-25T00:00:00.000Z"
        }
    ]
}