{
    "version": "https://jsonfeed.org/version/1",
    "title": "JavaScript(en) on Google Book",
    "home_page_url": "https://azu.github.io/book-rss/JavaScript-en.json",
    "description": "JavaScript(en) on Google Book",
    "items": [
        {
            "content_html": "Learn the skills you need to build React applications quickly! This fully revised second edition introduces functional components, React hooks, static site generators, and more. Build your skills with React and its ecosystem fast. There’s no slow theory and tedious history. You’ll dive into React code right from the very first chapter. The book teaches you how React thinks, introducing ways of structuring your architecture that even work with large teams. React Quickly, Second Edition is a practical guide to React for busy web developers. Following over 100 carefully chosen and clearly explained examples, you'll learn React development using your existing JavaScript and web development skills. This totally rewritten second edition is full of brand new topics, including chapters on functional components, static site generations, and CSS in JS. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.<br><blockquote>The book teaches you how React thinks, introducing ways of structuring your architecture that even work with large teams. React Quickly, Second Edition is a practical guide to React for busy web developers.</blockquote>",
            "url": "http://books.google.com/books?id=eTfwzgEACAAJ&dq=JavaScript&hl=&cd=1&source=gbs_api",
            "title": "React Quickly, Second Edition",
            "summary": "Learn the skills you need to build React applications quickly! This fully revised second edition introduces functional components, React hooks, static site generators, and more. Build your skills with React and its ecosystem fast. There’s no slow theory and tedious history. You’ll dive into React code right from the very first chapter. The book teaches you how React thinks, introducing ways of structuring your architecture that even work with large teams. React Quickly, Second Edition is a practical guide to React for busy web developers. Following over 100 carefully chosen and clearly explained examples, you'll learn React development using your existing JavaScript and web development skills. This totally rewritten second edition is full of brand new topics, including chapters on functional components, static site generations, and CSS in JS. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.",
            "image": "http://books.google.com/books/content?id=eTfwzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2022-10-25T00:00:00.000Z"
        },
        {
            "content_html": "Become a creative JavaScript professional by creating and animating stunning 3D, browser-based graphics with Three.js from beginning to end Purchase of the print or Kindle book includes a free eBook in PDF format Key Features: Enhance your 3D graphics with light sources, shadows, advanced materials, and textures Load models from external sources, visualize and, animate them directly using JavaScript Create your own custom WebGL shader, explore Three.js' postprocessing feature, and learn how to integrate with Blender, React, and Typescript Book Description: Three.js has become the industry standard for creating stunning 3D WebGL content. In this edition, you'll learn about all the features of Three.js and understand how to integrate it with the newest physics engines. You'll also develop a strong grip on creating and animating immersive 3D scenes directly in your browser, reaping the full potential of WebGL and modern browsers. The book starts with the basic concepts and building blocks used in Three.js and helps you explore these essential topics in detail through extensive examples and code samples. You'll learn how to create realistic-looking 3D objects using textures and materials and how to load existing models from an external source. Next, you'll understand how to control the camera using the Three.js built-in camera controls, which will enable you to fly or walk around the 3D scene you've created. Later chapters will cover the use of HTML5 video and canvas elements as materials for your 3D objects to animate your models. You'll learn how to use morph targets and skeleton-based animation, before understanding how to add physics, such as gravity and collision detection, to your scene. Finally, you'll master combining Blender with Three.js and creating VR and AR scenes. By the end of this book, you'll be well-equipped to create 3D-animated graphics using Three.js. What You Will Learn: Implement the different camera controls provided by Three.js to navigate your 3D scene Discover working with vertices directly to create snow, rain, and galaxy-like effects Import and animate models from external formats, such as glTF, OBJ, STL, and COLLADA Design and run animations using morph targets and bone-based animation Create realistic-looking 3D objects using advanced textures on materials Interact directly with WebGL by creating custom vertex and fragment shaders Make scenes using the Rapier physics engine, and integrate Three.js with VR and AR Who this book is for: This book is for JavaScript developers looking to learn the use of Three.js library.<br><blockquote>Finally, you&#39;ll master combining Blender with Three.js and creating VR and AR scenes. By the end of this book, you&#39;ll be well-equipped to create 3D-animated graphics using Three.js.</blockquote>",
            "url": "http://books.google.com/books?id=J00_zwEACAAJ&dq=JavaScript&hl=&cd=2&source=gbs_api",
            "title": "Learn Three. Js",
            "summary": "Become a creative JavaScript professional by creating and animating stunning 3D, browser-based graphics with Three.js from beginning to end Purchase of the print or Kindle book includes a free eBook in PDF format Key Features: Enhance your 3D graphics with light sources, shadows, advanced materials, and textures Load models from external sources, visualize and, animate them directly using JavaScript Create your own custom WebGL shader, explore Three.js' postprocessing feature, and learn how to integrate with Blender, React, and Typescript Book Description: Three.js has become the industry standard for creating stunning 3D WebGL content. In this edition, you'll learn about all the features of Three.js and understand how to integrate it with the newest physics engines. You'll also develop a strong grip on creating and animating immersive 3D scenes directly in your browser, reaping the full potential of WebGL and modern browsers. The book starts with the basic concepts and building blocks used in Three.js and helps you explore these essential topics in detail through extensive examples and code samples. You'll learn how to create realistic-looking 3D objects using textures and materials and how to load existing models from an external source. Next, you'll understand how to control the camera using the Three.js built-in camera controls, which will enable you to fly or walk around the 3D scene you've created. Later chapters will cover the use of HTML5 video and canvas elements as materials for your 3D objects to animate your models. You'll learn how to use morph targets and skeleton-based animation, before understanding how to add physics, such as gravity and collision detection, to your scene. Finally, you'll master combining Blender with Three.js and creating VR and AR scenes. By the end of this book, you'll be well-equipped to create 3D-animated graphics using Three.js. What You Will Learn: Implement the different camera controls provided by Three.js to navigate your 3D scene Discover working with vertices directly to create snow, rain, and galaxy-like effects Import and animate models from external formats, such as glTF, OBJ, STL, and COLLADA Design and run animations using morph targets and bone-based animation Create realistic-looking 3D objects using advanced textures on materials Interact directly with WebGL by creating custom vertex and fragment shaders Make scenes using the Rapier physics engine, and integrate Three.js with VR and AR Who this book is for: This book is for JavaScript developers looking to learn the use of Three.js library.",
            "image": "http://books.google.com/books/content?id=J00_zwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2023-02-17T00:00:00.000Z"
        },
        {
            "content_html": "Mastering React helps the reader master the React JavaScript framework for faster and more robust front-end development. React is a JavaScript framework for creating interface design that is coherent, cheap, and customizable. It makes it possible to create complicated user interfaces out of “modules,” which are small, independent pieces of code. The primary goal of using React is the easier creation of visual interfaces. React was developed by Facebook and released to the public in 2013. It powers some of the most popular apps, including Facebook and Instagram. It uses virtual DOM (JavaScript Document Object Model), which increases the application’s performance. The virtualized DOM in JavaScript is faster than the conventional DOM. React can be used as both a standalone framework and in conjunction with other platforms. It employs component and data patterns to improve clarity while also assisting in maintaining larger applications. React saves you time and money during development because it is component-based. The design can be segmented into reusable modules that could be used to adjust interfaces dynamically. The front-end development industry has a reputation for moving at a breakneck speed. Organizations cannot be expected to modify their apps annually to catch pace with technological innovations. This is why businesses prefer React. React simplifies many things, and its ecosystem is full of valuable subframeworks and tools. React is among the most powerful front-end frameworks out there. As such, learning React development can future-proof anyone’s career in the long run, and even yield immediate benefits. This book explains the concepts of React in an easy-to-grasp language. With Mastering React, learning React becomes a charm, and readers will undoubtedly advance their careers with the help of this book. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with more than a decade of experience in the computing field.<br><blockquote>This book explains the concepts of React in an easy-to-grasp language. With Mastering React, learning React becomes a charm, and readers will undoubtedly advance their careers with the help of this book.</blockquote>",
            "url": "http://books.google.com/books?id=j_-VEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=3&source=gbs_api",
            "title": "Mastering React",
            "summary": "Mastering React helps the reader master the React JavaScript framework for faster and more robust front-end development. React is a JavaScript framework for creating interface design that is coherent, cheap, and customizable. It makes it possible to create complicated user interfaces out of “modules,” which are small, independent pieces of code. The primary goal of using React is the easier creation of visual interfaces. React was developed by Facebook and released to the public in 2013. It powers some of the most popular apps, including Facebook and Instagram. It uses virtual DOM (JavaScript Document Object Model), which increases the application’s performance. The virtualized DOM in JavaScript is faster than the conventional DOM. React can be used as both a standalone framework and in conjunction with other platforms. It employs component and data patterns to improve clarity while also assisting in maintaining larger applications. React saves you time and money during development because it is component-based. The design can be segmented into reusable modules that could be used to adjust interfaces dynamically. The front-end development industry has a reputation for moving at a breakneck speed. Organizations cannot be expected to modify their apps annually to catch pace with technological innovations. This is why businesses prefer React. React simplifies many things, and its ecosystem is full of valuable subframeworks and tools. React is among the most powerful front-end frameworks out there. As such, learning React development can future-proof anyone’s career in the long run, and even yield immediate benefits. This book explains the concepts of React in an easy-to-grasp language. With Mastering React, learning React becomes a charm, and readers will undoubtedly advance their careers with the help of this book. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with more than a decade of experience in the computing field.",
            "image": "http://books.google.com/books/content?id=j_-VEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-11-29T00:00:00.000Z"
        },
        {
            "content_html": "This book serves as a succinct guide on ReScript, a functional language for building web applications. Using examples of ReScript language features along with explanations of fundamental concepts in functional programming, this book will show web developers with a background in JavaScript how to effectively use ReScript to its full potential. In Introducing ReScript, you'll learn how to use features in ReScript that JavaScript lacks, such as type inference, null-safety, algebraic data types, pattern matching, and more. Along the way, you'll pick up functional programming concepts like immutability and higher-order functions. You'll also gain a sense of how ReScript works under the hood and how to leverage interoperability between ReScript and JavaScript. Whether you're a web developer interested in dabbling with functional programming or you just want to learn how to write safer and cleaner code for web applications, this book is a great way for you to get started with ReScript. What You Will Learn Use ReScript to write clean, safe, and elegant software Understand the features of ReScript that set it apart from JavaScript, such as type inference, null-safety, and algebraic data types Explore functional programming concepts like immutabhigher-orderr order functions, and pattern matching Use popular JavaScript libraries and frameworks in your ReScript code and integrate ReScript code into JavaScript codebases Who This Book Is For Web developers that want a strictly typed, safer alternative to JavaScript, as well as web developers interested in learning functional programming and leveraging the elegant and powerful functional features in ReScript.<br><blockquote>This book serves as a succinct guide on ReScript, a functional language for building web applications.</blockquote>",
            "url": "http://books.google.com/books?id=1ZRYzwEACAAJ&dq=JavaScript&hl=&cd=4&source=gbs_api",
            "title": "Introducing ReScript",
            "summary": "This book serves as a succinct guide on ReScript, a functional language for building web applications. Using examples of ReScript language features along with explanations of fundamental concepts in functional programming, this book will show web developers with a background in JavaScript how to effectively use ReScript to its full potential. In Introducing ReScript, you'll learn how to use features in ReScript that JavaScript lacks, such as type inference, null-safety, algebraic data types, pattern matching, and more. Along the way, you'll pick up functional programming concepts like immutability and higher-order functions. You'll also gain a sense of how ReScript works under the hood and how to leverage interoperability between ReScript and JavaScript. Whether you're a web developer interested in dabbling with functional programming or you just want to learn how to write safer and cleaner code for web applications, this book is a great way for you to get started with ReScript. What You Will Learn Use ReScript to write clean, safe, and elegant software Understand the features of ReScript that set it apart from JavaScript, such as type inference, null-safety, and algebraic data types Explore functional programming concepts like immutabhigher-orderr order functions, and pattern matching Use popular JavaScript libraries and frameworks in your ReScript code and integrate ReScript code into JavaScript codebases Who This Book Is For Web developers that want a strictly typed, safer alternative to JavaScript, as well as web developers interested in learning functional programming and leveraging the elegant and powerful functional features in ReScript.",
            "image": "http://books.google.com/books/content?id=1ZRYzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2022-12-28T00:00:00.000Z"
        },
        {
            "content_html": "Mastering Vue.js helps the reader master the Vue.js JavaScript framework for faster and more robust front-end development. Vue is a popular JavaScript front-end framework that is rapidly expanding. It is easy to use, small (less than 24 KB), and really fast. It is simple to include in other applications and libraries. Vue.js is easy to install, and beginners may quickly learn how to use it and begin creating their interface design. What makes Vue special is that it is different from most other JavaScript frameworks and libraries. Unlike other monolithic frameworks, Vue is built from the ground up to be incrementally adaptable. The core library focuses primarily on the View layer, and is easy to use and combine with other libraries or projects. On the other hand, when merged with contemporary stacks and libraries, Vue is perfectly capable of running powerful Single-Page Web Applications. Working with Vue.js can be fun. Leveraging Vue and its plugins can help one easily create excellent Internet and smartphone-compatible applications. Vue is both compact and customizable, and comes with multiple capabilities for intelligent state management and navigation choices. All said and done, learning Vue is an excellent career initiative, especially since it is rapidly gaining favor among startups and established enterprises alike. Vue is an excellent choice if you want to make a highly engaging, flexible, and data-driven app. It has an easy-to-understand layout which you can learn in minutes. Unlike Angular or React, Vue.js does not have a lot of challenges or concepts to master. It is an excellent choice for programmers looking to learn and implement new technology for their next project. With Mastering Vue.js, learning Vue becomes very straightforward, which will help readers undoubtedly advance their careers. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with over a decade of experience in the computing field.<br><blockquote>Mastering Vue.js helps the reader master the Vue.js JavaScript framework for faster and more robust front-end development. Vue is a popular JavaScript front-end framework that is rapidly expanding.</blockquote>",
            "url": "http://books.google.com/books?id=4NKLEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=5&source=gbs_api",
            "title": "Mastering Vue.js",
            "summary": "Mastering Vue.js helps the reader master the Vue.js JavaScript framework for faster and more robust front-end development. Vue is a popular JavaScript front-end framework that is rapidly expanding. It is easy to use, small (less than 24 KB), and really fast. It is simple to include in other applications and libraries. Vue.js is easy to install, and beginners may quickly learn how to use it and begin creating their interface design. What makes Vue special is that it is different from most other JavaScript frameworks and libraries. Unlike other monolithic frameworks, Vue is built from the ground up to be incrementally adaptable. The core library focuses primarily on the View layer, and is easy to use and combine with other libraries or projects. On the other hand, when merged with contemporary stacks and libraries, Vue is perfectly capable of running powerful Single-Page Web Applications. Working with Vue.js can be fun. Leveraging Vue and its plugins can help one easily create excellent Internet and smartphone-compatible applications. Vue is both compact and customizable, and comes with multiple capabilities for intelligent state management and navigation choices. All said and done, learning Vue is an excellent career initiative, especially since it is rapidly gaining favor among startups and established enterprises alike. Vue is an excellent choice if you want to make a highly engaging, flexible, and data-driven app. It has an easy-to-understand layout which you can learn in minutes. Unlike Angular or React, Vue.js does not have a lot of challenges or concepts to master. It is an excellent choice for programmers looking to learn and implement new technology for their next project. With Mastering Vue.js, learning Vue becomes very straightforward, which will help readers undoubtedly advance their careers. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with over a decade of experience in the computing field.",
            "image": "http://books.google.com/books/content?id=4NKLEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-11-11T00:00:00.000Z"
        },
        {
            "content_html": "D3 Start to Finish teaches you how to build a custom, interactive and beautiful data visualisation using the JavaScript library D3.js (versions 6 and 7). The book covers D3 concepts such as selections, joins, requests, scale functions, event handling and transitions. It also covers general web development techniques such as state management and modularisation. In other words, everything you need to know to build a real world, custom data visualisation. You'll also learn how to put these concepts into practice by building an interactive data visualisation called Energy Explorer. This is a custom data visualisation that visualises the energy mix of 141 countries. There are 15 separate build steps and you're taken through each step in detail. There's also a code download link for all 15 steps so you can follow along. Some of the topics covered are: - requesting CSV data using D3 - D3 data joins (including joining nested data) - architecting a data visualisation using a layout function - detailed styling using CSS - adding a popup using Flourish's popup library - state management - animations using D3 transitions - data manipulation using Lodash - adding a menu, legend and footer About the author Peter Cook has built data visualisations for Carbon Tracker, London Datastore and McGraw Hill Education. He currently works as a senior visualisation developer at Flourish and also writes about the how-to of data visualisation for Create With Data. He's run training courses for clients such as the BBC and The Economist and written data visualisation tutorials for Flowing Data and Creative Bloq. He created D3 in Depth and Create With Data. Reviews \"One of the best D3 books I've read. The contents are very clear, it is easy to follow and the concepts are very solid.\" - Javier García Fernández (Journalist & developer) \"Teaching D3 is hard and it's been very useful to have a resource like Peter's D3 in Depth website to send students to. With this book Peter delivers something rather more substantial - a non-trivial D3 visualisation built from the ground up. You get the hard earned pro-tips and perspectives delivered in a realistic context - pretty much the gold standard for learning.\" - Kyran Dale (author of Data Visualization with Python and JavaScript (O'Reilly)) \"I’d very much recommend this book to anyone who needs to rapidly get up to speed with D3, whether they are an experienced developer or a relative novice. It will give you all the tools and knowledge to create professional grade visualisations.\" - Mike Hadlow (Developer & blogger)<br><blockquote>With this book Peter delivers something rather more substantial - a non-trivial D3 visualisation built from the ground up.</blockquote>",
            "url": "http://books.google.com/books?id=jZSGEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=6&source=gbs_api",
            "title": "D3 Start to Finish",
            "summary": "D3 Start to Finish teaches you how to build a custom, interactive and beautiful data visualisation using the JavaScript library D3.js (versions 6 and 7). The book covers D3 concepts such as selections, joins, requests, scale functions, event handling and transitions. It also covers general web development techniques such as state management and modularisation. In other words, everything you need to know to build a real world, custom data visualisation. You'll also learn how to put these concepts into practice by building an interactive data visualisation called Energy Explorer. This is a custom data visualisation that visualises the energy mix of 141 countries. There are 15 separate build steps and you're taken through each step in detail. There's also a code download link for all 15 steps so you can follow along. Some of the topics covered are: - requesting CSV data using D3 - D3 data joins (including joining nested data) - architecting a data visualisation using a layout function - detailed styling using CSS - adding a popup using Flourish's popup library - state management - animations using D3 transitions - data manipulation using Lodash - adding a menu, legend and footer About the author Peter Cook has built data visualisations for Carbon Tracker, London Datastore and McGraw Hill Education. He currently works as a senior visualisation developer at Flourish and also writes about the how-to of data visualisation for Create With Data. He's run training courses for clients such as the BBC and The Economist and written data visualisation tutorials for Flowing Data and Creative Bloq. He created D3 in Depth and Create With Data. Reviews \"One of the best D3 books I've read. The contents are very clear, it is easy to follow and the concepts are very solid.\" - Javier García Fernández (Journalist & developer) \"Teaching D3 is hard and it's been very useful to have a resource like Peter's D3 in Depth website to send students to. With this book Peter delivers something rather more substantial - a non-trivial D3 visualisation built from the ground up. You get the hard earned pro-tips and perspectives delivered in a realistic context - pretty much the gold standard for learning.\" - Kyran Dale (author of Data Visualization with Python and JavaScript (O'Reilly)) \"I’d very much recommend this book to anyone who needs to rapidly get up to speed with D3, whether they are an experienced developer or a relative novice. It will give you all the tools and knowledge to create professional grade visualisations.\" - Mike Hadlow (Developer & blogger)",
            "image": "http://books.google.com/books/content?id=jZSGEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-06-23T00:00:00.000Z"
        },
        {
            "content_html": "Node.js: Novice to Ninja is your hands-on guide to learning everything needed to build a professional web application using Node.js, the hugely popular open-source, cross-platform, back-end JavaScript runtime environment. You'll start off by getting familiar with the basics - installation and building your first apps - before moving onto more advanced concepts, including debugging, asynchronous programming, using Express.js, working with databases, deployment, and more. You'll finish by building a complete multi-player real-time quiz application. Install Node and build your first application Get started with Express.js and use it to process forms Master asynchronous programming in Node.js Work with MongoDB and MySQL databases Use WebSockets for real-time applications Understand the Node ecosystem: npm and modules Build a complete multiplayer quiz app And much more! The book includes access to 25 high quality tutorial videos, containing 1.5 hours of content.<br><blockquote>The book includes access to 25 high quality tutorial videos, containing 1.5 hours of content.</blockquote>",
            "url": "http://books.google.com/books?id=o991EAAAQBAJ&pg=PA1&dq=JavaScript&hl=&cd=7&source=gbs_api",
            "title": "Node.js: Novice to Ninja",
            "summary": "Node.js: Novice to Ninja is your hands-on guide to learning everything needed to build a professional web application using Node.js, the hugely popular open-source, cross-platform, back-end JavaScript runtime environment. You'll start off by getting familiar with the basics - installation and building your first apps - before moving onto more advanced concepts, including debugging, asynchronous programming, using Express.js, working with databases, deployment, and more. You'll finish by building a complete multi-player real-time quiz application. Install Node and build your first application Get started with Express.js and use it to process forms Master asynchronous programming in Node.js Work with MongoDB and MySQL databases Use WebSockets for real-time applications Understand the Node ecosystem: npm and modules Build a complete multiplayer quiz app And much more! The book includes access to 25 high quality tutorial videos, containing 1.5 hours of content.",
            "image": "http://books.google.com/books/content?id=o991EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-06-07T00:00:00.000Z"
        },
        {
            "content_html": "Hit the ground running with React, the open source technology from Facebook for building rich web applications fast. Updated for the latest React release, the second edition of this hands-on guide shows you how to build React components and organize them into maintainable large-scale apps. If you're familiar with JavaScript syntax, you're ready to get started. Through the course of this book, author Stoyan Stefanov helps web developers and programmers build a complete single-page application. You'll quickly learn why some developers consider React the key to the web app development puzzle. Set up React and write your first \"Hello, World\" web app Create and use custom React components alongside generic DOM components Build a data table component that lets you edit, sort, search, and export its contents Master the JSX syntax Use built-in Hooks and create your own custom ones Manage the app's data flow with reducers and contexts Use Create React App to take care of the build process and focus on React itself Build a complete custom app that lets you store data on the client<br><blockquote>If you&#39;re familiar with JavaScript syntax, you&#39;re ready to get started. Through the course of this book, author Stoyan Stefanov helps web developers and programmers build a complete single-page application.</blockquote>",
            "url": "http://books.google.com/books?id=Z_xNEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=8&source=gbs_api",
            "title": "React: Up & Running",
            "summary": "Hit the ground running with React, the open source technology from Facebook for building rich web applications fast. Updated for the latest React release, the second edition of this hands-on guide shows you how to build React components and organize them into maintainable large-scale apps. If you're familiar with JavaScript syntax, you're ready to get started. Through the course of this book, author Stoyan Stefanov helps web developers and programmers build a complete single-page application. You'll quickly learn why some developers consider React the key to the web app development puzzle. Set up React and write your first \"Hello, World\" web app Create and use custom React components alongside generic DOM components Build a data table component that lets you edit, sort, search, and export its contents Master the JSX syntax Use built-in Hooks and create your own custom ones Manage the app's data flow with reducers and contexts Use Create React App to take care of the build process and focus on React itself Build a complete custom app that lets you store data on the client",
            "image": "http://books.google.com/books/content?id=Z_xNEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-11-11T00:00:00.000Z"
        },
        {
            "content_html": "Get the definitive guide on Gatsby, the JavaScript framework for building blazing fast websites and applications. Used by Nike, Costa Coffee, and other companies worldwide, Gatsby is emerging as one of the key technologies in the Jamstack (JavaScript, APIs, and markup) ecosystem. With this comprehensive guide, you'll learn how to architect, build, and deploy Gatsby sites independently or with CMSs, commerce systems, and other data sources. Author Preston So begins by showing you how to set up a Gatsby site from scratch. From there, youâ??ll learn ways to use Gatsbyâ??s declarative rendering and GraphQL API, build complex offline-enabled sites, and continuously deploy Gatsby sites on a variety of platforms, including Gatsby Cloud. Discover how Gatsby integrates with many data sources and plug-ins Set up, configure, and architect Gatsby sites using Gatsby's CLI, React, JSX, and GraphQL with high performance out of the box Build an independent Gatsby site based on Markdown and data- and content-driven Gatsby sites that integrate with CMSs and commerce platforms Deploy Gatsby sites with full CI/CD and test coverage on a variety of platforms, including Netlify, Vercel, and Gatsby Cloud<br><blockquote>Get the definitive guide on Gatsby, the JavaScript framework for building blazing fast websites and applications.</blockquote>",
            "url": "http://books.google.com/books?id=mDhCEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=9&source=gbs_api",
            "title": "Gatsby: The Definitive Guide",
            "summary": "Get the definitive guide on Gatsby, the JavaScript framework for building blazing fast websites and applications. Used by Nike, Costa Coffee, and other companies worldwide, Gatsby is emerging as one of the key technologies in the Jamstack (JavaScript, APIs, and markup) ecosystem. With this comprehensive guide, you'll learn how to architect, build, and deploy Gatsby sites independently or with CMSs, commerce systems, and other data sources. Author Preston So begins by showing you how to set up a Gatsby site from scratch. From there, youâ??ll learn ways to use Gatsbyâ??s declarative rendering and GraphQL API, build complex offline-enabled sites, and continuously deploy Gatsby sites on a variety of platforms, including Gatsby Cloud. Discover how Gatsby integrates with many data sources and plug-ins Set up, configure, and architect Gatsby sites using Gatsby's CLI, React, JSX, and GraphQL with high performance out of the box Build an independent Gatsby site based on Markdown and data- and content-driven Gatsby sites that integrate with CMSs and commerce platforms Deploy Gatsby sites with full CI/CD and test coverage on a variety of platforms, including Netlify, Vercel, and Gatsby Cloud",
            "image": "http://books.google.com/books/content?id=mDhCEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-09-09T00:00:00.000Z"
        },
        {
            "content_html": "Learn to create fully functional web applications with authentication, content management systems, payment processing, RESTful APIs, and more Purchase of the print or Kindle book includes a free eBook in PDF format. Key FeaturesImplement advanced functionalities, such as full-text search engines, user activity streams, payment gateways, and recommendation enginesIntegrate JavaScript, PostgreSQL, Redis, Celery, and Memcached into your applicationsAdd real-time features with Django Channels and WebSocketsBook Description Django 4 By Example is the 4th edition of the best-selling franchise that helps you build web apps. This book will walk you through the creation of real-world applications, solving common problems, and implementing best practices using a step-by-step approach. You'll cover a wide range of web app development topics as you build four different apps: A blog application: Create data models, views, and URLs and implement an admin site for your blog. Create sitemaps and RSS feeds and implement a full-text search engine with PostgreSQL. A social website: Implement authentication with Facebook, Twitter, and Google. Create user profiles, image thumbnails, a bookmarklet, and an activity stream. Implement a user follower system and add infinite scroll pagination to your website. An e-commerce application: Build a product catalog, a shopping cart, and asynchronous tasks with Celery and RabbitMQ. Process payments with Stripe and manage payment notifications via webhooks. Build a product recommendation engine with Redis. Create PDF invoices and export orders to CSV. An e-learning platform: Create a content management system to manage polymorphic content. Cache content with Memcached and Redis. Build and consume a RESTful API. Implement a real-time chat using WebSockets with ASGI. Create a production environment using NGINX, uWSGI and Daphne with Docker Compose. This is a practical book that will have you creating web apps quickly. What you will learnLearn Django essentials, including models, ORM, views, templates, URLs, forms, authentication, signals and middlewareImplement different modules of the Django framework to solve specific problemsIntegrate third-party Django applications into your projectBuild asynchronous (ASGI) applications with DjangoSet up a production environment for your projectsEasily create complex web applications to solve real use casesWho this book is for This book is for readers with basic Python knowledge and programmers transitioning from other web frameworks who wish to learn Django by doing. If you already use Django or have in the past, and want to learn best practices and integrate other technologies to scale your applications, then this book is for you too. This book will help you master the most relevant areas of the framework by building practical projects from scratch. Some previous knowledge of HTML and JavaScript is assumed.<br><blockquote>addEventListener(&#39;DOMContentLoaded&#39;, (event) =&gt; { // DOM loaded {% block domready %} {% endblock %} }) &lt;/script&gt; &lt;/body&gt; &lt;/html&gt; We have added a &lt;script&gt; tag to include <b>JavaScript</b> code. The document.addEventListener() method is used to&nbsp;...</blockquote>",
            "url": "http://books.google.com/books?id=GLaEEAAAQBAJ&pg=PA270&dq=JavaScript&hl=&cd=10&source=gbs_api",
            "title": "Django 4 By Example",
            "summary": "Learn to create fully functional web applications with authentication, content management systems, payment processing, RESTful APIs, and more Purchase of the print or Kindle book includes a free eBook in PDF format. Key FeaturesImplement advanced functionalities, such as full-text search engines, user activity streams, payment gateways, and recommendation enginesIntegrate JavaScript, PostgreSQL, Redis, Celery, and Memcached into your applicationsAdd real-time features with Django Channels and WebSocketsBook Description Django 4 By Example is the 4th edition of the best-selling franchise that helps you build web apps. This book will walk you through the creation of real-world applications, solving common problems, and implementing best practices using a step-by-step approach. You'll cover a wide range of web app development topics as you build four different apps: A blog application: Create data models, views, and URLs and implement an admin site for your blog. Create sitemaps and RSS feeds and implement a full-text search engine with PostgreSQL. A social website: Implement authentication with Facebook, Twitter, and Google. Create user profiles, image thumbnails, a bookmarklet, and an activity stream. Implement a user follower system and add infinite scroll pagination to your website. An e-commerce application: Build a product catalog, a shopping cart, and asynchronous tasks with Celery and RabbitMQ. Process payments with Stripe and manage payment notifications via webhooks. Build a product recommendation engine with Redis. Create PDF invoices and export orders to CSV. An e-learning platform: Create a content management system to manage polymorphic content. Cache content with Memcached and Redis. Build and consume a RESTful API. Implement a real-time chat using WebSockets with ASGI. Create a production environment using NGINX, uWSGI and Daphne with Docker Compose. This is a practical book that will have you creating web apps quickly. What you will learnLearn Django essentials, including models, ORM, views, templates, URLs, forms, authentication, signals and middlewareImplement different modules of the Django framework to solve specific problemsIntegrate third-party Django applications into your projectBuild asynchronous (ASGI) applications with DjangoSet up a production environment for your projectsEasily create complex web applications to solve real use casesWho this book is for This book is for readers with basic Python knowledge and programmers transitioning from other web frameworks who wish to learn Django by doing. If you already use Django or have in the past, and want to learn best practices and integrate other technologies to scale your applications, then this book is for you too. This book will help you master the most relevant areas of the framework by building practical projects from scratch. Some previous knowledge of HTML and JavaScript is assumed.",
            "image": "http://books.google.com/books/content?id=GLaEEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-08-29T00:00:00.000Z"
        }
    ]
}