{
    "version": "https://jsonfeed.org/version/1",
    "title": "JavaScript(en) on Google Book",
    "home_page_url": "https://azu.github.io/book-rss/JavaScript-en.json",
    "description": "JavaScript(en) on Google Book",
    "items": [
        {
            "content_html": "Learn to use JavaScript, the popular scripting language that allows web page authors to develop interactive web pages and sites. Carey/Vodnik's JAVASCRIPT FOR WEB WARRIORS, Seventh Edition introduces a variety of techniques that focus on what you need to know to begin using JavaScript right away. Step-by-step tasks within each chapter highlight particular techniques essential for building actual JavaScript programs. Guided activities reinforce skills and build in complexity as you progress. You also study debugging techniques. Using accompanying MindTap digital resources, you read and immediately practice with embedded JavaScript coding exercises in an authentic integrated development environment (IDE). Learning objectives, summaries, review and key terms highlight major concepts while reinforcement exercises let you further practice new techniques. After completing your course, you will able to use JavaScript to build professional quality web applications.<br><blockquote>Carey/Vodnik&#39;s JAVASCRIPT FOR WEB WARRIORS, Seventh Edition introduces a variety of techniques that focus on what you need to know to begin using JavaScript right away.</blockquote>",
            "url": "http://books.google.com/books?id=SVlIzgEACAAJ&dq=JavaScript&hl=&cd=1&source=gbs_api",
            "title": "JavaScript for Web Warriors",
            "summary": "Learn to use JavaScript, the popular scripting language that allows web page authors to develop interactive web pages and sites. Carey/Vodnik's JAVASCRIPT FOR WEB WARRIORS, Seventh Edition introduces a variety of techniques that focus on what you need to know to begin using JavaScript right away. Step-by-step tasks within each chapter highlight particular techniques essential for building actual JavaScript programs. Guided activities reinforce skills and build in complexity as you progress. You also study debugging techniques. Using accompanying MindTap digital resources, you read and immediately practice with embedded JavaScript coding exercises in an authentic integrated development environment (IDE). Learning objectives, summaries, review and key terms highlight major concepts while reinforcement exercises let you further practice new techniques. After completing your course, you will able to use JavaScript to build professional quality web applications.",
            "image": "http://books.google.com/books/content?id=SVlIzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2021-08-18T00:00:00.000Z"
        },
        {
            "content_html": "Little known to many, R works just as well with JavaScript—this book delves into the various ways both languages can work together. The ultimate aim of this work is to put the reader at ease with inviting JavaScript in their data science workflow. In that respect the book is not teaching one JavaScript but rather we show how little JavaScript can greatly support and enhance R code. Therefore, the focus is on integrating external JavaScript libraries and no prior knowledge of JavaScript is required. Key Features: ● Easy to pick up. ● An entry way to learning JavaScript for R. ● Covers topics not covered anywhere else. ● Easy to follow along.<br><blockquote>The ultimate aim of this work is to put the reader at ease with inviting JavaScript in their data science workflow.</blockquote>",
            "url": "http://books.google.com/books?id=ntUxEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=2&source=gbs_api",
            "title": "Javascript for R",
            "summary": "Little known to many, R works just as well with JavaScript—this book delves into the various ways both languages can work together. The ultimate aim of this work is to put the reader at ease with inviting JavaScript in their data science workflow. In that respect the book is not teaching one JavaScript but rather we show how little JavaScript can greatly support and enhance R code. Therefore, the focus is on integrating external JavaScript libraries and no prior knowledge of JavaScript is required. Key Features: ● Easy to pick up. ● An entry way to learning JavaScript for R. ● Covers topics not covered anywhere else. ● Easy to follow along.",
            "image": "http://books.google.com/books/content?id=ntUxEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-07-16T00:00:00.000Z"
        },
        {
            "content_html": "Mastering advanced JavaScript to build modern next-generation web applications. KEY FEATURES ● A simplified explanation of complex concepts to create powerful and flexible web applications. ● Learn testing JavaScript code, regular expressions, fetching data, and many more with ES6. ● A full-fledged section dedicated to developing an application using JavaScript. DESCRIPTION Decoding JavaScript will take the users on an eventful journey of simplifying and understanding advanced concepts of JavaScript. Since JavaScript is the core programming language for almost every interaction on the web, this book will make it easier for readers to develop modern cutting-edge web applications. The book begins with a quick recap of the fundamental JavaScript (JS) concepts like the syntax of JS, data types, operators, conditionals, looping, functions, arrays, objects, and so on. The readers will also explore the handy Chrome Developers’ Tools. This book will also help readers learn and implement important concepts like how to connect to the servers, fetching data like images, user information, videos, etc. from the server, and displaying it on the web page. Besides that, users will learn about impactful concepts like testing JavaScript code, regular expressions, and exploring the popular ES6 and the versions beyond. Most importantly, this book will help you with the best JavaScript practices followed by companies like Google, Facebook, Twitter, etc. to develop a live application right from scratch. WHAT YOU WILL LEARN ● Build dynamic web applications interacting with servers using Vanilla. ● Improve code efficiency by learning advanced concepts of JavaScript. ● Get acquainted with best practices adopted by industry leaders, including Google and Facebook. ● Get access to work with popular libraries like ReactJS, jQuery, Angular, Ember, and Vue. WHO THIS BOOK IS FOR This book is for aspiring web developers and fairly experienced JavaScript developers who want to create modern web and server applications. Prior knowledge of HTML and CSS is essential to begin with this book. TABLE OF CONTENTS 1. Introduction to JavaScript 2. The Developer’s Tools 3. Functions 4. Arrays 5. Objects 6. ES6 7. Classes 8. Callbacks and Promises 9. AJAX and Interacting with Servers 10. Developing a Live Application! 11. Storing Data in Browsers 12. Debugging and Error Handling 13. Testing and Test Frameworks 14. Regular Expressions 15. Life after ES6 16. Tips and Tricks<br><blockquote>WHO THIS BOOK IS FORÊÊ This book is for aspiring web developers and fairly experienced JavaScript developers who want to create modern web and server applications. Prior knowledge of HTML and CSS is essential to begin with this book.</blockquote>",
            "url": "http://books.google.com/books?id=8novEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=3&source=gbs_api",
            "title": "Decoding JavaScript",
            "summary": "Mastering advanced JavaScript to build modern next-generation web applications. KEY FEATURES ● A simplified explanation of complex concepts to create powerful and flexible web applications. ● Learn testing JavaScript code, regular expressions, fetching data, and many more with ES6. ● A full-fledged section dedicated to developing an application using JavaScript. DESCRIPTION Decoding JavaScript will take the users on an eventful journey of simplifying and understanding advanced concepts of JavaScript. Since JavaScript is the core programming language for almost every interaction on the web, this book will make it easier for readers to develop modern cutting-edge web applications. The book begins with a quick recap of the fundamental JavaScript (JS) concepts like the syntax of JS, data types, operators, conditionals, looping, functions, arrays, objects, and so on. The readers will also explore the handy Chrome Developers’ Tools. This book will also help readers learn and implement important concepts like how to connect to the servers, fetching data like images, user information, videos, etc. from the server, and displaying it on the web page. Besides that, users will learn about impactful concepts like testing JavaScript code, regular expressions, and exploring the popular ES6 and the versions beyond. Most importantly, this book will help you with the best JavaScript practices followed by companies like Google, Facebook, Twitter, etc. to develop a live application right from scratch. WHAT YOU WILL LEARN ● Build dynamic web applications interacting with servers using Vanilla. ● Improve code efficiency by learning advanced concepts of JavaScript. ● Get acquainted with best practices adopted by industry leaders, including Google and Facebook. ● Get access to work with popular libraries like ReactJS, jQuery, Angular, Ember, and Vue. WHO THIS BOOK IS FOR This book is for aspiring web developers and fairly experienced JavaScript developers who want to create modern web and server applications. Prior knowledge of HTML and CSS is essential to begin with this book. TABLE OF CONTENTS 1. Introduction to JavaScript 2. The Developer’s Tools 3. Functions 4. Arrays 5. Objects 6. ES6 7. Classes 8. Callbacks and Promises 9. AJAX and Interacting with Servers 10. Developing a Live Application! 11. Storing Data in Browsers 12. Debugging and Error Handling 13. Testing and Test Frameworks 14. Regular Expressions 15. Life after ES6 16. Tips and Tricks",
            "image": "http://books.google.com/books/content?id=8novEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-05-21T00:00:00.000Z"
        },
        {
            "content_html": "Got basic programming skills but are new to JavaScript? Ready to pitch in and save humanity from the zombie hordes? Now you can do both at the same time. You’ll learn how to work with JavaScript objects, creating and setting properties, defining and using methods and the way objects are used in the Document Object Model (DOM). All while kicking serious zombie tuchus. Speaking of the DOM you’ll become comfortable working with it, selecting elements out of it, creating elements and adding them to it and removing any apocalyptic elements that might slip through. Once you have all that under your post-apocalyptic utility belt you’ll then be introduced to events, event handlers and how to utilize them. By the end of this book you should be ready to manipulate a web page into post-apocalyptic submission (which is like normal submission except it’s, you know, like, after the apocalypse). How You'll Learn to Smack Zombies Around You won't just passively take in the view, like a zombie shuffling across the mainland. You’ll have plenty of combat practice with analogies, examples, and code tutorials you can build, break and fix again. Working with your hands and your head you’ll craft code that pleases the eye and knocks a zombie into last Tuesday. All the code and directions are provided as both codepen tutorials and downloadable html files, so you can fight the apocalypse how and where you like. You can work with them on the codepen site or on your own device. And later you'll bring those skills together in a final project that cements those skills into zombie smashing muscle memory. Why Zombies? Are zombies just a gimmick? Why would this be any better than a straight laced book that sticks to the facts? Straight laced books are often straight boring. And if you have insomnia problems go buy that book. The author, John, has read the boring books and knows that staying awake and engaged are also important for learning. But this book uses zombie references and analogies not just to make you smile, but to help the material stick. If a tough technical concept is related in silly terms you understand, like a zombie trying to buy gum at a super market, it’s much more likely to stay in that brain those zombies are intent on eating.<br><blockquote>The author, John, has read the boring books and knows that staying awake and engaged are also important for learning. But this book uses zombie references and analogies not just to make you smile, but to help the material stick.</blockquote>",
            "url": "http://books.google.com/books?id=QhErEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=4&source=gbs_api",
            "title": "JavaScript Basics",
            "summary": "Got basic programming skills but are new to JavaScript? Ready to pitch in and save humanity from the zombie hordes? Now you can do both at the same time. You’ll learn how to work with JavaScript objects, creating and setting properties, defining and using methods and the way objects are used in the Document Object Model (DOM). All while kicking serious zombie tuchus. Speaking of the DOM you’ll become comfortable working with it, selecting elements out of it, creating elements and adding them to it and removing any apocalyptic elements that might slip through. Once you have all that under your post-apocalyptic utility belt you’ll then be introduced to events, event handlers and how to utilize them. By the end of this book you should be ready to manipulate a web page into post-apocalyptic submission (which is like normal submission except it’s, you know, like, after the apocalypse). How You'll Learn to Smack Zombies Around You won't just passively take in the view, like a zombie shuffling across the mainland. You’ll have plenty of combat practice with analogies, examples, and code tutorials you can build, break and fix again. Working with your hands and your head you’ll craft code that pleases the eye and knocks a zombie into last Tuesday. All the code and directions are provided as both codepen tutorials and downloadable html files, so you can fight the apocalypse how and where you like. You can work with them on the codepen site or on your own device. And later you'll bring those skills together in a final project that cements those skills into zombie smashing muscle memory. Why Zombies? Are zombies just a gimmick? Why would this be any better than a straight laced book that sticks to the facts? Straight laced books are often straight boring. And if you have insomnia problems go buy that book. The author, John, has read the boring books and knows that staying awake and engaged are also important for learning. But this book uses zombie references and analogies not just to make you smile, but to help the material stick. If a tough technical concept is related in silly terms you understand, like a zombie trying to buy gum at a super market, it’s much more likely to stay in that brain those zombies are intent on eating.",
            "image": "http://books.google.com/books/content?id=QhErEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-05-01T00:00:00.000Z"
        },
        {
            "content_html": "Whether for building interactive browser-based applications or creating server-side applications in Node, JavaScript is the most widely used language for web programming. With new features, language improvements, paradigms, and potential use cases appearing regularly, there's never been a more exciting time to be a JavaScript developer. In The Joy of JavaScript, author and JavaScript expert Luis Atencio teaches you key design concepts that lead to clean, lean, modular, and easy-to-maintain code. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.<br><blockquote>Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.</blockquote>",
            "url": "http://books.google.com/books?id=os8cEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=5&source=gbs_api",
            "title": "The Joy of JavaScript",
            "summary": "Whether for building interactive browser-based applications or creating server-side applications in Node, JavaScript is the most widely used language for web programming. With new features, language improvements, paradigms, and potential use cases appearing regularly, there's never been a more exciting time to be a JavaScript developer. In The Joy of JavaScript, author and JavaScript expert Luis Atencio teaches you key design concepts that lead to clean, lean, modular, and easy-to-maintain code. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.",
            "image": "http://books.google.com/books/content?id=os8cEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-03-02T00:00:00.000Z"
        },
        {
            "content_html": "55 % discount for bookstores ! Now At $25.99 instead of $ 40.28 $ Your customers will never stop reading this guide !!! In this book, we learned in this discussion that ES6 support isn't universal yet, but that shouldn't stop you from taking advantage of the benefits of ES6 right now, because you can trans-compile your ES6 to portable ES5. Be sure to include the following things when setting up a new development machine. We also learn how to set up a good editor, git (for installation instructions), Gulp (npm install -g gulp), ESLint (npm install -g eslint). We also learn how to begin a new project (whether it's a scratch project to run the examples in this book or a real project), like a dedicated directory for your project; we call this the project root, a Git repository (git init), a package.json file (npm init), a Gulpfile (gulpfile.js; use the one from this topic), gulp and Babel local packages (npm install --save-dev gulp gulp-babel babel-preset-es2015), a .babelrc file (contents: { \"presets\" [\"es2015\"] }), an .eslintrc file (use eslint --init to create it, and edit to your preferences), a subdirectory for Node source (es6), a subdirectory for browser source (public/es6). Your also simple workflow will look like this once you've set it up by making improvements that are logically consistent and connected also to test and lint your code, use Gulp with rep until the improvements are successful and lint-free. Alao makes sure you're not going to do something you don't want to do (git status). Connect any files to yours.gitignore file that you don't want in Git. In the last Add all of your changes to Git (git add -A; if you don't want to add all of your changes, just use git add for each file). Buy it Now and let your customers get addicted to this amazing book !!!<br><blockquote>In this book, we learned in this discussion that ES6 support isn&#39;t universal yet, but that shouldn&#39;t stop you from taking advantage of the benefits of ES6 right now, because you can trans-compile your ES6 to portable ES5.</blockquote>",
            "url": "http://books.google.com/books?id=BdZkzgEACAAJ&dq=JavaScript&hl=&cd=6&source=gbs_api",
            "title": "Learn JavaScript Programming",
            "summary": "55 % discount for bookstores ! Now At $25.99 instead of $ 40.28 $ Your customers will never stop reading this guide !!! In this book, we learned in this discussion that ES6 support isn't universal yet, but that shouldn't stop you from taking advantage of the benefits of ES6 right now, because you can trans-compile your ES6 to portable ES5. Be sure to include the following things when setting up a new development machine. We also learn how to set up a good editor, git (for installation instructions), Gulp (npm install -g gulp), ESLint (npm install -g eslint). We also learn how to begin a new project (whether it's a scratch project to run the examples in this book or a real project), like a dedicated directory for your project; we call this the project root, a Git repository (git init), a package.json file (npm init), a Gulpfile (gulpfile.js; use the one from this topic), gulp and Babel local packages (npm install --save-dev gulp gulp-babel babel-preset-es2015), a .babelrc file (contents: { \"presets\" [\"es2015\"] }), an .eslintrc file (use eslint --init to create it, and edit to your preferences), a subdirectory for Node source (es6), a subdirectory for browser source (public/es6). Your also simple workflow will look like this once you've set it up by making improvements that are logically consistent and connected also to test and lint your code, use Gulp with rep until the improvements are successful and lint-free. Alao makes sure you're not going to do something you don't want to do (git status). Connect any files to yours.gitignore file that you don't want in Git. In the last Add all of your changes to Git (git add -A; if you don't want to add all of your changes, just use git add for each file). Buy it Now and let your customers get addicted to this amazing book !!!",
            "image": "http://books.google.com/books/content?id=BdZkzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2021-04-06T00:00:00.000Z"
        },
        {
            "content_html": "This book will show you how you can leverage your Python skills to learn JavaScript by comparing them at the syntactical and semantical level. You’ll discover why and when to use JavaScript, connect to a Node.js backend to create meaningful experiences, and finally create a full-stack application utilizing all layers of a web application.<br><blockquote>This book will show you how you can leverage your Python skills to learn JavaScript by comparing them at the syntactical and semantical level.</blockquote>",
            "url": "http://books.google.com/books?id=-cL_DwAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=7&source=gbs_api",
            "title": "Hands-on JavaScript for Python Developers",
            "summary": "This book will show you how you can leverage your Python skills to learn JavaScript by comparing them at the syntactical and semantical level. You’ll discover why and when to use JavaScript, connect to a Node.js backend to create meaningful experiences, and finally create a full-stack application utilizing all layers of a web application.",
            "image": "http://books.google.com/books/content?id=-cL_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2020-09-25T00:00:00.000Z"
        },
        {
            "content_html": "This Book includes: Javascript Basics For Beginners Javascript Front End Programming Javascript Back End Programming Gain a deep understanding of Basics, front-end programming and back-end programming using JavaScript with this handy book! This book is written in a practical and easy way and offers theory and plenty of practical material. There are explanations and practical examples that help beginners learn fast. Instead of diving deeper into lengthy and boring texts, I tried to get straight to the point for each topic. I have defined each topic and added an easy to understand explanation to help you understand the concepts and the main keywords that will do the magic in the code. Coupled with the explanation, you will find a code snippet for each topic that is custom written and has been tested for errors. You can copy them and load them up on a web browser to see the results, or you can simply edit them and customize them to understand them well. The choice is yours. First book is written in an orderly form with beginner-level topics and progressively tougher topics later on. Second book is focusing on React JS, this guide is aimed at those who already have a programming background and some experience in programming for the web but need to brush up on their skills and learn new ones. Third book will take you through the important concepts involved in using Node.js to build your server-side applications. Each chapter is self-contained with its own practical but simple examples to show you how it works. By the end of this book, you will have all the knowledge you need to put together your own web application!Here is a rundown of the contents of the book. JavaScript Use Cases Variables Constants Prompts Conditionals Arrays Strings JavaScript For and While Loops Functions Objects Classes Learn how to set up your React JS environment. Discover what ReactJS is all about. Read in depth about the React JS components. Find out about the React JS props, state, and lifecycle. Investigate React JS forms, events, and refs. Learn about React JS Keys. Understand the React JS Router. Explore React JS Flux and animations. Learn about React JS Higher Order Components. Discover the React JS best practice guide. Learn how to set up your Node.js environment. Explore everything about the REPL Terminal. Read about the Node.js package manager. Discover Node.js callbacks and asynchronous JS. Find out about Node.js events, buffers, streams, and the file system. Investigate Node.js global objects and the global object - they are different. Learn about Node.js modules, utility modules, the web module, and more. Find out about the Express framework. Learn RESTful API. Discover how to scale applications. Find out how to package applications. And so much more! Now is your chance to delve into Javascript basics with this easy to follow guide. With the many examples and code snippets, you'll have everything you need at your fingertips. Click the Buy Now button to get started today!<br><blockquote>This Book includes: Javascript Basics For Beginners Javascript Front End Programming Javascript Back End Programming Gain a deep understanding of Basics, front-end programming and back-end programming using JavaScript with this handy book!</blockquote>",
            "url": "http://books.google.com/books?id=cSNYzgEACAAJ&dq=JavaScript&hl=&cd=8&source=gbs_api",
            "title": "Javascript",
            "summary": "This Book includes: Javascript Basics For Beginners Javascript Front End Programming Javascript Back End Programming Gain a deep understanding of Basics, front-end programming and back-end programming using JavaScript with this handy book! This book is written in a practical and easy way and offers theory and plenty of practical material. There are explanations and practical examples that help beginners learn fast. Instead of diving deeper into lengthy and boring texts, I tried to get straight to the point for each topic. I have defined each topic and added an easy to understand explanation to help you understand the concepts and the main keywords that will do the magic in the code. Coupled with the explanation, you will find a code snippet for each topic that is custom written and has been tested for errors. You can copy them and load them up on a web browser to see the results, or you can simply edit them and customize them to understand them well. The choice is yours. First book is written in an orderly form with beginner-level topics and progressively tougher topics later on. Second book is focusing on React JS, this guide is aimed at those who already have a programming background and some experience in programming for the web but need to brush up on their skills and learn new ones. Third book will take you through the important concepts involved in using Node.js to build your server-side applications. Each chapter is self-contained with its own practical but simple examples to show you how it works. By the end of this book, you will have all the knowledge you need to put together your own web application!Here is a rundown of the contents of the book. JavaScript Use Cases Variables Constants Prompts Conditionals Arrays Strings JavaScript For and While Loops Functions Objects Classes Learn how to set up your React JS environment. Discover what ReactJS is all about. Read in depth about the React JS components. Find out about the React JS props, state, and lifecycle. Investigate React JS forms, events, and refs. Learn about React JS Keys. Understand the React JS Router. Explore React JS Flux and animations. Learn about React JS Higher Order Components. Discover the React JS best practice guide. Learn how to set up your Node.js environment. Explore everything about the REPL Terminal. Read about the Node.js package manager. Discover Node.js callbacks and asynchronous JS. Find out about Node.js events, buffers, streams, and the file system. Investigate Node.js global objects and the global object - they are different. Learn about Node.js modules, utility modules, the web module, and more. Find out about the Express framework. Learn RESTful API. Discover how to scale applications. Find out how to package applications. And so much more! Now is your chance to delve into Javascript basics with this easy to follow guide. With the many examples and code snippets, you'll have everything you need at your fingertips. Click the Buy Now button to get started today!",
            "image": "http://books.google.com/books/content?id=cSNYzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2021-03-08T00:00:00.000Z"
        },
        {
            "content_html": "Everything you need to get to grips with HTML, CSS and JavaScript – the three coding languages that are used to create modern web pages – all in easy steps! HTML, CSS & JavaScript in easy steps instructs the reader on each of the three coding languages that are used to create modern web pages; HyperText Markup Language (HTML) tags are used to control the structure of web page content, Cascading Style Sheets (CSS) rules are used to determine how web page content appears, and JavaScript functions are used to provide web page interactivity. HTML, CSS & JavaScript in easy steps contains examples and screenshots that illustrate each feature of all three coding languages. You'll learn how to create web pages to display text, images, lists, tables, hyperlinks, forms, audio, and video. Each chapter builds your knowledge so by the end of the book you'll have gained a sound understanding of HTML markup, CSS rules and JavaScript functions. HTML, CSS & JavaScript in easy steps has an easy-to-follow style that will appeal to anyone who wants to create great functional web pages. It will appeal to programmers who want to quickly add web page coding to their skills set, and to the student who is studying website design at school or college, and to those seeking a career in web development. Table of Contents: 1. Get Started in HTML 2. Manage Page Content 3. Insert Hyperlinks 4. Arrange Page Sections 5. Write Lists and Tables 6. Embed Media Content 7. Create Input Forms 8. Get Started in CSS 9. Manage the Box Model 10. Manipulate Text Styles 11. Organize Tables and Lists 12. Generate Effects 13. Control the Web Page 14. Design with Grids 15. Get Started in JavaScript 16. Perform Useful Operations 17. Manage the Script Flow 18. Use Script Objects 19. Control Numbers and Strings 20. Address the Window Object 21. Interact with the Document<br><blockquote>Each chapter builds your knowledge so by the end of the book you&#39;ll have gained a sound understanding of HTML markup, CSS rules and JavaScript functions.</blockquote>",
            "url": "http://books.google.com/books?id=C3L1DwAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=9&source=gbs_api",
            "title": "HTML, CSS & JavaScript in easy steps",
            "summary": "Everything you need to get to grips with HTML, CSS and JavaScript – the three coding languages that are used to create modern web pages – all in easy steps! HTML, CSS & JavaScript in easy steps instructs the reader on each of the three coding languages that are used to create modern web pages; HyperText Markup Language (HTML) tags are used to control the structure of web page content, Cascading Style Sheets (CSS) rules are used to determine how web page content appears, and JavaScript functions are used to provide web page interactivity. HTML, CSS & JavaScript in easy steps contains examples and screenshots that illustrate each feature of all three coding languages. You'll learn how to create web pages to display text, images, lists, tables, hyperlinks, forms, audio, and video. Each chapter builds your knowledge so by the end of the book you'll have gained a sound understanding of HTML markup, CSS rules and JavaScript functions. HTML, CSS & JavaScript in easy steps has an easy-to-follow style that will appeal to anyone who wants to create great functional web pages. It will appeal to programmers who want to quickly add web page coding to their skills set, and to the student who is studying website design at school or college, and to those seeking a career in web development. Table of Contents: 1. Get Started in HTML 2. Manage Page Content 3. Insert Hyperlinks 4. Arrange Page Sections 5. Write Lists and Tables 6. Embed Media Content 7. Create Input Forms 8. Get Started in CSS 9. Manage the Box Model 10. Manipulate Text Styles 11. Organize Tables and Lists 12. Generate Effects 13. Control the Web Page 14. Design with Grids 15. Get Started in JavaScript 16. Perform Useful Operations 17. Manage the Script Flow 18. Use Script Objects 19. Control Numbers and Strings 20. Address the Window Object 21. Interact with the Document",
            "image": "http://books.google.com/books/content?id=C3L1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2020-08-05T00:00:00.000Z"
        },
        {
            "content_html": "Do you want to make applications for Android and iOS ? Are you a developer who is bored of writing code for both Android and iOS ? In this series of books we will overcome the problem of having to write code for Android and iOS by using React Native. React Native is a framework developed by Facebook for creating native-style apps for iOS & Android under one common language, JavaScript. Initially, Facebook only developed React Native to support iOS. However with its recent support of the Android operating system, the library can now render mobile UIs for both platforms. Why React Native ? Not only react native allows you to create cross platform applications but react native also makes updating apps simple through over-the-app updates. Over the air update in react native is achieved through technologies such as CodePush with a few lines of code. Armed with React Native you’ll finally be able to make apps of your choice in no time and I’m glad to show you what React Native can do through this series of books. In this book we will learn the core concepts of Javascript to help us with our React Native Journey.<br><blockquote>In this book we will learn the core concepts of Javascript to help us with our React Native Journey.</blockquote>",
            "url": "http://books.google.com/books?id=A1fjDwAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=10&source=gbs_api",
            "title": "Essentials of Javascript",
            "summary": "Do you want to make applications for Android and iOS ? Are you a developer who is bored of writing code for both Android and iOS ? In this series of books we will overcome the problem of having to write code for Android and iOS by using React Native. React Native is a framework developed by Facebook for creating native-style apps for iOS & Android under one common language, JavaScript. Initially, Facebook only developed React Native to support iOS. However with its recent support of the Android operating system, the library can now render mobile UIs for both platforms. Why React Native ? Not only react native allows you to create cross platform applications but react native also makes updating apps simple through over-the-app updates. Over the air update in react native is achieved through technologies such as CodePush with a few lines of code. Armed with React Native you’ll finally be able to make apps of your choice in no time and I’m glad to show you what React Native can do through this series of books. In this book we will learn the core concepts of Javascript to help us with our React Native Journey.",
            "image": "http://books.google.com/books/content?id=A1fjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2020-05-12T00:00:00.000Z"
        }
    ]
}