{
    "version": "https://jsonfeed.org/version/1",
    "title": "JavaScript(en) on Google Book",
    "home_page_url": "https://azu.github.io/book-rss/JavaScript-en.json",
    "description": "JavaScript(en) on Google Book",
    "items": [
        {
            "content_html": "Combining the demand for AI with the ubiquity of JavaScript was inevitable. With Google's TensorFlow.js framework, seasoned AI veterans and web developers alike can help propel the future of AI-driven websites. In this guide, author Gant Laborde--Google Developer Expert in machine learning and the web--provides a hands-on, end-to-end approach to TensorFlow.js fundamentals for a broad technical audience that includes data scientists, engineers, web developers, students, and researchers. You'll begin by working through some basic examples in TensorFlow.js before diving deeper into neural network architectures, DataFrames, TensorFlow Hub, model conversion, transfer learning, and more. Once you finish this book, you'll know how to build and deploy production-ready deep learning systems with TensorFlow.js. Explore tensors, the most fundamental structure of machine learning Convert data into tensors and back with a real-world example Combine AI with the web using TensorFlow.js and other tools Use resources to convert, train, and manage machine learning data Start building and training your own training models from scratch Learn how to create your own image classification models Examine transfer learning: retraining an advanced model to perform a new task<br><blockquote>In this guide, author Gant Laborde--Google Developer Expert in machine learning and the web--provides a hands-on, end-to-end approach to TensorFlow.js fundamentals for a broad technical audience that includes data scientists, engineers, web ...</blockquote>",
            "url": "http://books.google.com/books?id=R889zgEACAAJ&dq=JavaScript&hl=&cd=1&source=gbs_api",
            "title": "Learning Tensorflow. Js",
            "summary": "Combining the demand for AI with the ubiquity of JavaScript was inevitable. With Google's TensorFlow.js framework, seasoned AI veterans and web developers alike can help propel the future of AI-driven websites. In this guide, author Gant Laborde--Google Developer Expert in machine learning and the web--provides a hands-on, end-to-end approach to TensorFlow.js fundamentals for a broad technical audience that includes data scientists, engineers, web developers, students, and researchers. You'll begin by working through some basic examples in TensorFlow.js before diving deeper into neural network architectures, DataFrames, TensorFlow Hub, model conversion, transfer learning, and more. Once you finish this book, you'll know how to build and deploy production-ready deep learning systems with TensorFlow.js. Explore tensors, the most fundamental structure of machine learning Convert data into tensors and back with a real-world example Combine AI with the web using TensorFlow.js and other tools Use resources to convert, train, and manage machine learning data Start building and training your own training models from scratch Learn how to create your own image classification models Examine transfer learning: retraining an advanced model to perform a new task",
            "image": "http://books.google.com/books/content?id=R889zgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2021-08-17T00:00:00.000Z"
        },
        {
            "content_html": "This book if for absolute beginners, and it is an introduction to the major components of javascript. By learning the bigger things in Javascript, you will be able to know how to put the remaining pieces together and will be able to get into advanced books more prepared. WHAT IS JAVASCRIPT? JavaScript is one of the most popular programming languages in the world, and growing faster than any other programming language. As a developer, you can use JavaScript to build web and mobile apps, real-time networking apps, command-line tools, and games. 4 REASONS TO LEARN JAVASCRIPT JavaScript is a key tool for front-end, back-end, and full-stack developers. The average annual salary for a JavaScript developer is $72,000. Companies like Walmart, Netflix, and PayPal run big internal applications around JavaScript. Having strong JavaScript knowledge will help you land your dream job. Who this book is for: This book is meant for absolute beginners of Javascript This book is meant for students that struggled to learn the language before This book is meant for students with a little HTML knowledge<br><blockquote>This book if for absolute beginners, and it is an introduction to the major components of javascript.</blockquote>",
            "url": "http://books.google.com/books?id=z7D2DwAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=2&source=gbs_api",
            "title": "2021 JavaScript Programming for Beginners",
            "summary": "This book if for absolute beginners, and it is an introduction to the major components of javascript. By learning the bigger things in Javascript, you will be able to know how to put the remaining pieces together and will be able to get into advanced books more prepared. WHAT IS JAVASCRIPT? JavaScript is one of the most popular programming languages in the world, and growing faster than any other programming language. As a developer, you can use JavaScript to build web and mobile apps, real-time networking apps, command-line tools, and games. 4 REASONS TO LEARN JAVASCRIPT JavaScript is a key tool for front-end, back-end, and full-stack developers. The average annual salary for a JavaScript developer is $72,000. Companies like Walmart, Netflix, and PayPal run big internal applications around JavaScript. Having strong JavaScript knowledge will help you land your dream job. Who this book is for: This book is meant for absolute beginners of Javascript This book is meant for students that struggled to learn the language before This book is meant for students with a little HTML knowledge",
            "image": "http://books.google.com/books/content?id=z7D2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-01-09T00:00:00.000Z"
        },
        {
            "content_html": "Everything you need to get to grips with HTML, CSS and JavaScript – the three coding languages that are used to create modern web pages – all in easy steps! HTML, CSS & JavaScript in easy steps instructs the reader on each of the three coding languages that are used to create modern web pages; HyperText Markup Language (HTML) tags are used to control the structure of web page content, Cascading Style Sheets (CSS) rules are used to determine how web page content appears, and JavaScript functions are used to provide web page interactivity. HTML, CSS & JavaScript in easy steps contains examples and screenshots that illustrate each feature of all three coding languages. You'll learn how to create web pages to display text, images, lists, tables, hyperlinks, forms, audio, and video. Each chapter builds your knowledge so by the end of the book you'll have gained a sound understanding of HTML markup, CSS rules and JavaScript functions. HTML, CSS & JavaScript in easy steps has an easy-to-follow style that will appeal to anyone who wants to create great functional web pages. It will appeal to programmers who want to quickly add web page coding to their skills set, and to the student who is studying website design at school or college, and to those seeking a career in web development. Table of Contents: 1. Get Started in HTML 2. Manage Page Content 3. Insert Hyperlinks 4. Arrange Page Sections 5. Write Lists and Tables 6. Embed Media Content 7. Create Input Forms 8. Get Started in CSS 9. Manage the Box Model 10. Manipulate Text Styles 11. Organize Tables and Lists 12. Generate Effects 13. Control the Web Page 14. Design with Grids 15. Get Started in JavaScript 16. Perform Useful Operations 17. Manage the Script Flow 18. Use Script Objects 19. Control Numbers and Strings 20. Address the Window Object 21. Interact with the Document<br><blockquote>Each chapter builds your knowledge so by the end of the book you&#39;ll have gained a sound understanding of HTML markup, CSS rules and JavaScript functions.</blockquote>",
            "url": "http://books.google.com/books?id=C3L1DwAAQBAJ&pg=PA1&dq=JavaScript&hl=&cd=3&source=gbs_api",
            "title": "HTML, CSS & JavaScript in easy steps",
            "summary": "Everything you need to get to grips with HTML, CSS and JavaScript – the three coding languages that are used to create modern web pages – all in easy steps! HTML, CSS & JavaScript in easy steps instructs the reader on each of the three coding languages that are used to create modern web pages; HyperText Markup Language (HTML) tags are used to control the structure of web page content, Cascading Style Sheets (CSS) rules are used to determine how web page content appears, and JavaScript functions are used to provide web page interactivity. HTML, CSS & JavaScript in easy steps contains examples and screenshots that illustrate each feature of all three coding languages. You'll learn how to create web pages to display text, images, lists, tables, hyperlinks, forms, audio, and video. Each chapter builds your knowledge so by the end of the book you'll have gained a sound understanding of HTML markup, CSS rules and JavaScript functions. HTML, CSS & JavaScript in easy steps has an easy-to-follow style that will appeal to anyone who wants to create great functional web pages. It will appeal to programmers who want to quickly add web page coding to their skills set, and to the student who is studying website design at school or college, and to those seeking a career in web development. Table of Contents: 1. Get Started in HTML 2. Manage Page Content 3. Insert Hyperlinks 4. Arrange Page Sections 5. Write Lists and Tables 6. Embed Media Content 7. Create Input Forms 8. Get Started in CSS 9. Manage the Box Model 10. Manipulate Text Styles 11. Organize Tables and Lists 12. Generate Effects 13. Control the Web Page 14. Design with Grids 15. Get Started in JavaScript 16. Perform Useful Operations 17. Manage the Script Flow 18. Use Script Objects 19. Control Numbers and Strings 20. Address the Window Object 21. Interact with the Document",
            "image": "http://books.google.com/books/content?id=C3L1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2020-08-05T00:00:00.000Z"
        },
        {
            "content_html": "Build machine learning web applications without having to learn a new language. This book will help you develop basic knowledge of machine learning concepts and applications. You’ll learn not only theory, but also dive into code samples and example projects with TensorFlow.js. Using these skills and your knowledge as a web developer, you’ll add a whole new field of development to your tool set. This will give you a more concrete understanding of the possibilities offered by machine learning. Discover how ML will impact the future of not just programming in general, but web development specifically. Machine learning is currently one of the most exciting technology fields with the potential to impact industries from health to home automation to retail, and even art. Google has now introduced TensorFlow.js—an iteration of TensorFlow aimed directly at web developers. Practical Machine Learning in JavaScript will help you stay relevant in the tech industry with new tools, trends, and best practices. What You'll Learn Use the JavaScript framework for ML Build machine learning applications for the web Develop dynamic and intelligent web content Who This Book Is For Web developers and who want a hands-on introduction to machine learning in JavaScript. A working knowledge of the JavaScript language is recommended.<br><blockquote>Build machine learning web applications without having to learn a new language. This book will help you develop basic knowledge of machine learning concepts and applications.</blockquote>",
            "url": "http://books.google.com/books?id=Gg-_zQEACAAJ&dq=JavaScript&hl=&cd=4&source=gbs_api",
            "title": "Practical Machine Learning in JavaScript",
            "summary": "Build machine learning web applications without having to learn a new language. This book will help you develop basic knowledge of machine learning concepts and applications. You’ll learn not only theory, but also dive into code samples and example projects with TensorFlow.js. Using these skills and your knowledge as a web developer, you’ll add a whole new field of development to your tool set. This will give you a more concrete understanding of the possibilities offered by machine learning. Discover how ML will impact the future of not just programming in general, but web development specifically. Machine learning is currently one of the most exciting technology fields with the potential to impact industries from health to home automation to retail, and even art. Google has now introduced TensorFlow.js—an iteration of TensorFlow aimed directly at web developers. Practical Machine Learning in JavaScript will help you stay relevant in the tech industry with new tools, trends, and best practices. What You'll Learn Use the JavaScript framework for ML Build machine learning applications for the web Develop dynamic and intelligent web content Who This Book Is For Web developers and who want a hands-on introduction to machine learning in JavaScript. A working knowledge of the JavaScript language is recommended.",
            "image": "http://books.google.com/books/content?id=Gg-_zQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2020-11-17T00:00:00.000Z"
        },
        {
            "content_html": "JavaScriptThe Ultimate Beginner's Guide to Learn Javascript programming Step by Step .Why JavaScript?JavaScript, as you might know, is ubiquitous in today's software development world. It is the foundation of frontend web development and is the key ingredient in frameworks like ReactJS, Angular, and VueJS. It can also help create solid backends with platforms like Nodejs, runs desktop applications like Slack, Atom, and Spotify, and runs on mobile phones as Progressive Web Apps (PWAs).In short, it is everywhere-and for good reasons. For starters, compared to other languages like C and Java, JavaScript is generally easier to learn. When we say 'easier', we mean in terms of how quickly you can go from being a JavaScript novice to someone who can actually make a living writing professional, high quality JavaScript code. So, in that sense, it's more accessible than some other languages like C and Java.JavaScript is also a fun and rewarding language, which is especially important when you're just getting started in software development. The community support is very good, so if you get stuck, there's a good chance that the problem and its solution already exist on the web.Now that we've gotten a bird's-eye view of JavaScript, let's get into the more technical detail. JavaScript was created to add 'life to webpages'. Just like HTML and CSS, JavaScript is written in plain text files with a .js extension.As previously mentioned, JavaScript can be used to accomplish many useful operations on the frontend, like validating forms, alerting users, storing temporary data, and performing calculations-to name just a few.Pro tip: Apart from the name itself, JavaScript has no relation to Java. Beginners often get confused between the two languages. Remember that Java is an entirely different language made for a different purpose (although you'll still find it running on certain website backends).<br><blockquote>JavaScript was created to add &#39;life to webpages&#39;.</blockquote>",
            "url": "http://books.google.com/books?id=TXbYzQEACAAJ&dq=JavaScript&hl=&cd=5&source=gbs_api",
            "title": "JavaScript",
            "summary": "JavaScriptThe Ultimate Beginner's Guide to Learn Javascript programming Step by Step .Why JavaScript?JavaScript, as you might know, is ubiquitous in today's software development world. It is the foundation of frontend web development and is the key ingredient in frameworks like ReactJS, Angular, and VueJS. It can also help create solid backends with platforms like Nodejs, runs desktop applications like Slack, Atom, and Spotify, and runs on mobile phones as Progressive Web Apps (PWAs).In short, it is everywhere-and for good reasons. For starters, compared to other languages like C and Java, JavaScript is generally easier to learn. When we say 'easier', we mean in terms of how quickly you can go from being a JavaScript novice to someone who can actually make a living writing professional, high quality JavaScript code. So, in that sense, it's more accessible than some other languages like C and Java.JavaScript is also a fun and rewarding language, which is especially important when you're just getting started in software development. The community support is very good, so if you get stuck, there's a good chance that the problem and its solution already exist on the web.Now that we've gotten a bird's-eye view of JavaScript, let's get into the more technical detail. JavaScript was created to add 'life to webpages'. Just like HTML and CSS, JavaScript is written in plain text files with a .js extension.As previously mentioned, JavaScript can be used to accomplish many useful operations on the frontend, like validating forms, alerting users, storing temporary data, and performing calculations-to name just a few.Pro tip: Apart from the name itself, JavaScript has no relation to Java. Beginners often get confused between the two languages. Remember that Java is an entirely different language made for a different purpose (although you'll still find it running on certain website backends).",
            "image": "http://books.google.com/books/content?id=TXbYzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2020-07-26T00:00:00.000Z"
        },
        {
            "content_html": "All of JavaScript's newest features, in depth, made easy to understand. JavaScript is a rapidly changing language and it can be challenging to keep up with all the new toys being added. JavaScript: The New Toys explores the newest features of the world's most popular programming language while also showing readers how to track what's coming next. After setting the stage by covering who manages the process of improving JavaScript, how new features get introduced, terminology, and a high-level overview of new features, it details each new or updated item in depth, with example uses, possible pitfalls, and expert recommendations for updating old habits in light of new features. JavaScript: The New Toys: Covers all the additions to JavaScript in ES2015-ES2019 plus a preview of ES2020 (and beyond) Explores the latest syntax: nullish coalescing, optional chaining, let and const, class syntax, private methods, private fields, new.target, numeric separators, BigInt, destructuring, default parameters, arrow functions, async functions, await, generator functions, ... (rest and spread), template literals, binary and octal literals, ** (exponentiation), computed property/method names, for-of, for-await-of, shorthand properties, and others Details the new features and patterns including modules, promises, iteration, generators, Symbol, Proxy, reflection, typed arrays, Atomics, shared memory, WeakMap, WeakSet, and more Highlights common pitfalls and explains how to avoid them Shows how to follow the improvements process and even participate in the process yourself Explains how to use new features even before they're widely supported With its comprehensive coverage and friendly, accessible style, JavaScript: The New Toys provides an invaluable resource for programmers everywhere, whether they work in web development, Node.js, Electron, Windows Universal Apps, or another JavaScript environment.<br><blockquote>This book explores the newest features of the world&#39;s most popular programming language while also showing readers how to track what&#39;s coming next.</blockquote>",
            "url": "http://books.google.com/books?id=-i3rDwAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=6&source=gbs_api",
            "title": "JavaScript",
            "summary": "All of JavaScript's newest features, in depth, made easy to understand. JavaScript is a rapidly changing language and it can be challenging to keep up with all the new toys being added. JavaScript: The New Toys explores the newest features of the world's most popular programming language while also showing readers how to track what's coming next. After setting the stage by covering who manages the process of improving JavaScript, how new features get introduced, terminology, and a high-level overview of new features, it details each new or updated item in depth, with example uses, possible pitfalls, and expert recommendations for updating old habits in light of new features. JavaScript: The New Toys: Covers all the additions to JavaScript in ES2015-ES2019 plus a preview of ES2020 (and beyond) Explores the latest syntax: nullish coalescing, optional chaining, let and const, class syntax, private methods, private fields, new.target, numeric separators, BigInt, destructuring, default parameters, arrow functions, async functions, await, generator functions, ... (rest and spread), template literals, binary and octal literals, ** (exponentiation), computed property/method names, for-of, for-await-of, shorthand properties, and others Details the new features and patterns including modules, promises, iteration, generators, Symbol, Proxy, reflection, typed arrays, Atomics, shared memory, WeakMap, WeakSet, and more Highlights common pitfalls and explains how to avoid them Shows how to follow the improvements process and even participate in the process yourself Explains how to use new features even before they're widely supported With its comprehensive coverage and friendly, accessible style, JavaScript: The New Toys provides an invaluable resource for programmers everywhere, whether they work in web development, Node.js, Electron, Windows Universal Apps, or another JavaScript environment.",
            "image": "http://books.google.com/books/content?id=-i3rDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2020-07-28T00:00:00.000Z"
        },
        {
            "content_html": "All of JavaScript's newest features, in depth, made easy to understand. JavaScript is a rapidly changing language and it can be challenging to keep up with all the new toys being added. JavaScript: The New Toys explores the newest features of the world's most popular programming language while also showing readers how to track what's coming next. After setting the stage by covering who manages the process of improving JavaScript, how new features get introduced, terminology, and a high-level overview of new features, it details each new or updated item in depth, with example uses, possible pitfalls, and expert recommendations for updating old habits in light of new features. JavaScript: The New Toys: Covers all the additions to JavaScript in ES2015-ES2019 plus a preview of ES2020 (and beyond) Explores the latest syntax: nullish coalescing, optional chaining, let and const, class syntax, private methods, private fields, new.target, numeric separators, BigInt, destructuring, default parameters, arrow functions, async functions, await, generator functions, ... (rest and spread), template literals, binary and octal literals, ** (exponentiation), computed property/method names, for-of, for-await-of, shorthand properties, and others Details the new features and patterns including modules, promises, iteration, generators, Symbol, Proxy, reflection, typed arrays, Atomics, shared memory, WeakMap, WeakSet, and more Highlights common pitfalls and explains how to avoid them Shows how to follow the improvements process and even participate in the process yourself Explains how to use new features even before they're widely supported With its comprehensive coverage and friendly, accessible style, JavaScript: The New Toys provides an invaluable resource for programmers everywhere, whether they work in web development, Node.js, Electron, Windows Universal Apps, or another JavaScript environment.<br><blockquote>This book explores the newest features of the world&#39;s most popular programming language while also showing readers how to track what&#39;s coming next.</blockquote>",
            "url": "http://books.google.com/books?id=B-nuDwAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=7&source=gbs_api",
            "title": "JavaScript",
            "summary": "All of JavaScript's newest features, in depth, made easy to understand. JavaScript is a rapidly changing language and it can be challenging to keep up with all the new toys being added. JavaScript: The New Toys explores the newest features of the world's most popular programming language while also showing readers how to track what's coming next. After setting the stage by covering who manages the process of improving JavaScript, how new features get introduced, terminology, and a high-level overview of new features, it details each new or updated item in depth, with example uses, possible pitfalls, and expert recommendations for updating old habits in light of new features. JavaScript: The New Toys: Covers all the additions to JavaScript in ES2015-ES2019 plus a preview of ES2020 (and beyond) Explores the latest syntax: nullish coalescing, optional chaining, let and const, class syntax, private methods, private fields, new.target, numeric separators, BigInt, destructuring, default parameters, arrow functions, async functions, await, generator functions, ... (rest and spread), template literals, binary and octal literals, ** (exponentiation), computed property/method names, for-of, for-await-of, shorthand properties, and others Details the new features and patterns including modules, promises, iteration, generators, Symbol, Proxy, reflection, typed arrays, Atomics, shared memory, WeakMap, WeakSet, and more Highlights common pitfalls and explains how to avoid them Shows how to follow the improvements process and even participate in the process yourself Explains how to use new features even before they're widely supported With its comprehensive coverage and friendly, accessible style, JavaScript: The New Toys provides an invaluable resource for programmers everywhere, whether they work in web development, Node.js, Electron, Windows Universal Apps, or another JavaScript environment.",
            "image": "http://books.google.com/books/content?id=B-nuDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2020-06-30T00:00:00.000Z"
        },
        {
            "content_html": "All of JavaScript's newest features, in depth, made easy to understand. JavaScript is a rapidly changing language and it can be challenging to keep up with all the new toys being added. JavaScript: The New Toys explores the newest features of the world's most popular programming language while also showing readers how to track what's coming next. After setting the stage by covering who manages the process of improving JavaScript, how new features get introduced, terminology, and a high-level overview of new features, it details each new or updated item in depth, with example uses, possible pitfalls, and expert recommendations for updating old habits in light of new features. JavaScript: The New Toys: Covers all the additions to JavaScript in ES2015-ES2019 plus a preview of ES2020 (and beyond) Explores the latest syntax: nullish coalescing, optional chaining, let and const, class syntax, private methods, private fields, new.target, numeric separators, BigInt, destructuring, default parameters, arrow functions, async functions, await, generator functions, ... (rest and spread), template literals, binary and octal literals, ** (exponentiation), computed property/method names, for-of, for-await-of, shorthand properties, and others Details the new features and patterns including modules, promises, iteration, generators, Symbol, Proxy, reflection, typed arrays, Atomics, shared memory, WeakMap, WeakSet, and more Highlights common pitfalls and explains how to avoid them Shows how to follow the improvements process and even participate in the process yourself Explains how to use new features even before they're widely supported With its comprehensive coverage and friendly, accessible style, JavaScript: The New Toys provides an invaluable resource for programmers everywhere, whether they work in web development, Node.js, Electron, Windows Universal Apps, or another JavaScript environment.<br><blockquote>This book explores the newest features of the world&#39;s most popular programming language while also showing readers how to track what&#39;s coming next.</blockquote>",
            "url": "http://books.google.com/books?id=EJzuDwAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=8&source=gbs_api",
            "title": "JavaScript",
            "summary": "All of JavaScript's newest features, in depth, made easy to understand. JavaScript is a rapidly changing language and it can be challenging to keep up with all the new toys being added. JavaScript: The New Toys explores the newest features of the world's most popular programming language while also showing readers how to track what's coming next. After setting the stage by covering who manages the process of improving JavaScript, how new features get introduced, terminology, and a high-level overview of new features, it details each new or updated item in depth, with example uses, possible pitfalls, and expert recommendations for updating old habits in light of new features. JavaScript: The New Toys: Covers all the additions to JavaScript in ES2015-ES2019 plus a preview of ES2020 (and beyond) Explores the latest syntax: nullish coalescing, optional chaining, let and const, class syntax, private methods, private fields, new.target, numeric separators, BigInt, destructuring, default parameters, arrow functions, async functions, await, generator functions, ... (rest and spread), template literals, binary and octal literals, ** (exponentiation), computed property/method names, for-of, for-await-of, shorthand properties, and others Details the new features and patterns including modules, promises, iteration, generators, Symbol, Proxy, reflection, typed arrays, Atomics, shared memory, WeakMap, WeakSet, and more Highlights common pitfalls and explains how to avoid them Shows how to follow the improvements process and even participate in the process yourself Explains how to use new features even before they're widely supported With its comprehensive coverage and friendly, accessible style, JavaScript: The New Toys provides an invaluable resource for programmers everywhere, whether they work in web development, Node.js, Electron, Windows Universal Apps, or another JavaScript environment.",
            "image": "http://books.google.com/books/content?id=EJzuDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2020-06-25T00:00:00.000Z"
        },
        {
            "content_html": "Do you want to make applications for Android and iOS ? Are you a developer who is bored of writing code for both Android and iOS ? In this series of books we will overcome the problem of having to write code for Android and iOS by using React Native. React Native is a framework developed by Facebook for creating native-style apps for iOS & Android under one common language, JavaScript. Initially, Facebook only developed React Native to support iOS. However with its recent support of the Android operating system, the library can now render mobile UIs for both platforms. Why React Native ? Not only react native allows you to create cross platform applications but react native also makes updating apps simple through over-the-app updates. Over the air update in react native is achieved through technologies such as CodePush with a few lines of code. Armed with React Native you’ll finally be able to make apps of your choice in no time and I’m glad to show you what React Native can do through this series of books. In this book we will learn the core concepts of Javascript to help us with our React Native Journey.<br><blockquote>In this book we will learn the core concepts of Javascript to help us with our React Native Journey.</blockquote>",
            "url": "http://books.google.com/books?id=A1fjDwAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=9&source=gbs_api",
            "title": "Essentials of Javascript",
            "summary": "Do you want to make applications for Android and iOS ? Are you a developer who is bored of writing code for both Android and iOS ? In this series of books we will overcome the problem of having to write code for Android and iOS by using React Native. React Native is a framework developed by Facebook for creating native-style apps for iOS & Android under one common language, JavaScript. Initially, Facebook only developed React Native to support iOS. However with its recent support of the Android operating system, the library can now render mobile UIs for both platforms. Why React Native ? Not only react native allows you to create cross platform applications but react native also makes updating apps simple through over-the-app updates. Over the air update in react native is achieved through technologies such as CodePush with a few lines of code. Armed with React Native you’ll finally be able to make apps of your choice in no time and I’m glad to show you what React Native can do through this series of books. In this book we will learn the core concepts of Javascript to help us with our React Native Journey.",
            "image": "http://books.google.com/books/content?id=A1fjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2020-05-12T00:00:00.000Z"
        },
        {
            "content_html": "Beginner to Expert in Web development with JavaScript: From HTML to React-Redux KEY FEATURES - Acquire web development skills to build independent applications - Understand the basics of HTML, CSS, JavaScript, React and Redux - Create build beautiful applications using HTML, CSS, JavaScript, React and Redux - Learn how to debug and unit test your applications properly to build good end products - Follow best practices to write good quality code and build performant applications DESCRIPTION This book will take you on a complete journey of learning web development, starting right with the basics. The book begins with the history of web development and JavaScript, how it has evolved over these years, and how it still keeps growing with new features. Next, you will learn the basic pillars of web development - HTML, CSS, and JavaScript. You will learn about the functional, object-oriented programming and asynchronous behaviour, and how JavaScript provides for these. Empowered with the basics, you will proceed to learn the new features of JavaScript, ES2015, and the latest ES2019. Next, you will apply your learning to build a real application to see how the Web takes shape.At the end, you will also have an introductory section on ReactJS, one of the modern frameworks for UI development and also develop a simple weather application using React. You will be introduced to Redux as the state container for React applications. This book will conclude with an introductory look at additional topics which can be taken up to become a professional and in building enterprise level applications. WHAT WILL YOU LEARN By the end of the book, you will be building real web applications to put your knowledge to practice. This book introduces all the concepts to get started with web application development. To further excel in this field, you really need to practice by building a lot many applications, implementing your own ideas or imitating existing websites. Also remember to practice additional examples provided in the code bundle of the book to master this field. WHO THIS BOOK IS FOR This book can be used by people who are completely new to software development and want to get into front-end web development by starting from basics. This book can also be used by JavaScript users for a quick reference to the fundamentals of HTML, CSS, JS, and learn ReactJS with Redux, as well as the new features in JavaScript ES2019. Table of Contents 1. History of JS and how it has revolutionized web development 2. HTML: Creating Web Content 3. CSS: Making content beautiful 4. JavaScript Programming: Making application Interactive 5. Functional programming with JavaScript 6. Object-Oriented JavaScript 7. Asynchronous Programming 8. What’s new in ES2019 JavaScript 9. Building an application with JavaScript 10. Debugging JavaScript Applications 11. Unit test automation 12. Build and Deploy an Application 13. JavaScript Best Practices 14. Introduction to React 15. Building an application with React 16. State Management in React applications 17. Debugging, Testing, and Deploying React applications 18. What is next - for becoming a pro?<br><blockquote>WHAT WILL YOU LEARN By the end of the book, you will be building real web applications to put your knowledge to practice. This book introduces all the concepts to get started with web application development.</blockquote>",
            "url": "http://books.google.com/books?id=b2bdDwAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=10&source=gbs_api",
            "title": "JavaScript for Modern Web Development",
            "summary": "Beginner to Expert in Web development with JavaScript: From HTML to React-Redux KEY FEATURES - Acquire web development skills to build independent applications - Understand the basics of HTML, CSS, JavaScript, React and Redux - Create build beautiful applications using HTML, CSS, JavaScript, React and Redux - Learn how to debug and unit test your applications properly to build good end products - Follow best practices to write good quality code and build performant applications DESCRIPTION This book will take you on a complete journey of learning web development, starting right with the basics. The book begins with the history of web development and JavaScript, how it has evolved over these years, and how it still keeps growing with new features. Next, you will learn the basic pillars of web development - HTML, CSS, and JavaScript. You will learn about the functional, object-oriented programming and asynchronous behaviour, and how JavaScript provides for these. Empowered with the basics, you will proceed to learn the new features of JavaScript, ES2015, and the latest ES2019. Next, you will apply your learning to build a real application to see how the Web takes shape.At the end, you will also have an introductory section on ReactJS, one of the modern frameworks for UI development and also develop a simple weather application using React. You will be introduced to Redux as the state container for React applications. This book will conclude with an introductory look at additional topics which can be taken up to become a professional and in building enterprise level applications. WHAT WILL YOU LEARN By the end of the book, you will be building real web applications to put your knowledge to practice. This book introduces all the concepts to get started with web application development. To further excel in this field, you really need to practice by building a lot many applications, implementing your own ideas or imitating existing websites. Also remember to practice additional examples provided in the code bundle of the book to master this field. WHO THIS BOOK IS FOR This book can be used by people who are completely new to software development and want to get into front-end web development by starting from basics. This book can also be used by JavaScript users for a quick reference to the fundamentals of HTML, CSS, JS, and learn ReactJS with Redux, as well as the new features in JavaScript ES2019. Table of Contents 1. History of JS and how it has revolutionized web development 2. HTML: Creating Web Content 3. CSS: Making content beautiful 4. JavaScript Programming: Making application Interactive 5. Functional programming with JavaScript 6. Object-Oriented JavaScript 7. Asynchronous Programming 8. What’s new in ES2019 JavaScript 9. Building an application with JavaScript 10. Debugging JavaScript Applications 11. Unit test automation 12. Build and Deploy an Application 13. JavaScript Best Practices 14. Introduction to React 15. Building an application with React 16. State Management in React applications 17. Debugging, Testing, and Deploying React applications 18. What is next - for becoming a pro?",
            "image": "http://books.google.com/books/content?id=b2bdDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2020-04-18T00:00:00.000Z"
        }
    ]
}