{
    "version": "https://jsonfeed.org/version/1",
    "title": "JavaScript(en) on Google Book",
    "home_page_url": "https://azu.github.io/book-rss/JavaScript-en.json",
    "description": "JavaScript(en) on Google Book",
    "items": [
        {
            "content_html": "Everything teens need to get started with JavaScript Have you ever wanted to make your own game? How about an awesome website? Then JavaScript Coding for Teens is the book for you! It doesn't matter if you're not sure what a variable is, are stumped about syntax, or don't even know how to use JavaScript on your computer! This simple guide to coding for beginners walks you through every part of the process with easy-to-understand language and straightforward directions. You'll be coding like a pro in no time! JavaScript Coding for Teens includes: Beginner-friendly lessons--This guide to coding for teens starts out with the basics, providing the perfect foundation for coding novices. A variety of uses--Stretch your skills and discover how amazingly flexible and powerful JavaScript is as you learn to use it for programming websites and games. Practical practice--Gain confidence with exercises that test your ability to modify existing programs or create new ones. Build computer skills that will last a lifetime with JavaScript Coding for Teens.<br><blockquote>You&#39;ll be coding like a pro in no time! JavaScript Coding for Teens includes: Beginner-friendly lessons--This guide to coding for teens starts out with the basics, providing the perfect foundation for coding novices.</blockquote>",
            "url": "http://books.google.com/books?id=YJqVzQEACAAJ&dq=JavaScript&hl=&cd=1&source=gbs_api",
            "title": "JavaScript Coding for Teens",
            "summary": "Everything teens need to get started with JavaScript Have you ever wanted to make your own game? How about an awesome website? Then JavaScript Coding for Teens is the book for you! It doesn't matter if you're not sure what a variable is, are stumped about syntax, or don't even know how to use JavaScript on your computer! This simple guide to coding for beginners walks you through every part of the process with easy-to-understand language and straightforward directions. You'll be coding like a pro in no time! JavaScript Coding for Teens includes: Beginner-friendly lessons--This guide to coding for teens starts out with the basics, providing the perfect foundation for coding novices. A variety of uses--Stretch your skills and discover how amazingly flexible and powerful JavaScript is as you learn to use it for programming websites and games. Practical practice--Gain confidence with exercises that test your ability to modify existing programs or create new ones. Build computer skills that will last a lifetime with JavaScript Coding for Teens.",
            "image": "http://books.google.com/books/content?id=YJqVzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2021-08-10T00:00:00.000Z"
        },
        {
            "content_html": "Why reinvent the wheel every time you run into a problem with JavaScript? This cookbook is chock-full of code recipes for common programming tasks, along with techniques for building apps that work in any browser. You'll get adaptable code samples that you can add to almost any project--and you'll learn more about JavaScript in the process. The recipes in this book take advantage of the latest features in ECMAScript 2020 and beyond and use modern JavaScript coding standards. You'll learn how to: Set up a productive development environment with a code editor, linter, and test server Work with JavaScript data types, such as strings, arrays, and BigInts Improve your understanding of JavaScript functions, including arrow functions, closures, and generators Apply object-oriented programming concepts like classes and inheritance Work with rich media in JavaScript, including audio, video, and SVGs Manipulate HTML markup and CSS styles Use JavaScript anywhere with Node.js Access and manipulate remote data with REST, GraphQL, and Fetch Get started with the popular Express application-building framework Perform asynchronous operations with Promises, async/await, and web workers<br><blockquote>The recipes in this book take advantage of the latest features in ECMAScript 2020 and beyond and use modern JavaScript coding standards.</blockquote>",
            "url": "http://books.google.com/books?id=4NA4EAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=2&source=gbs_api",
            "title": "JavaScript Cookbook",
            "summary": "Why reinvent the wheel every time you run into a problem with JavaScript? This cookbook is chock-full of code recipes for common programming tasks, along with techniques for building apps that work in any browser. You'll get adaptable code samples that you can add to almost any project--and you'll learn more about JavaScript in the process. The recipes in this book take advantage of the latest features in ECMAScript 2020 and beyond and use modern JavaScript coding standards. You'll learn how to: Set up a productive development environment with a code editor, linter, and test server Work with JavaScript data types, such as strings, arrays, and BigInts Improve your understanding of JavaScript functions, including arrow functions, closures, and generators Apply object-oriented programming concepts like classes and inheritance Work with rich media in JavaScript, including audio, video, and SVGs Manipulate HTML markup and CSS styles Use JavaScript anywhere with Node.js Access and manipulate remote data with REST, GraphQL, and Fetch Get started with the popular Express application-building framework Perform asynchronous operations with Promises, async/await, and web workers",
            "image": "http://books.google.com/books/content?id=4NA4EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-07-16T00:00:00.000Z"
        },
        {
            "content_html": "Little known to many, R works just as well with JavaScript—this book delves into the various ways both languages can work together. The ultimate aim of this work is to put the reader at ease with inviting JavaScript in their data science workflow. In that respect the book is not teaching one JavaScript but rather we show how little JavaScript can greatly support and enhance R code. Therefore, the focus is on integrating external JavaScript libraries and no prior knowledge of JavaScript is required. Key Features: ● Easy to pick up. ● An entry way to learning JavaScript for R. ● Covers topics not covered anywhere else. ● Easy to follow along.<br><blockquote>The ultimate aim of this work is to put the reader at ease with inviting JavaScript in their data science workflow.</blockquote>",
            "url": "http://books.google.com/books?id=ntUxEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=3&source=gbs_api",
            "title": "Javascript for R",
            "summary": "Little known to many, R works just as well with JavaScript—this book delves into the various ways both languages can work together. The ultimate aim of this work is to put the reader at ease with inviting JavaScript in their data science workflow. In that respect the book is not teaching one JavaScript but rather we show how little JavaScript can greatly support and enhance R code. Therefore, the focus is on integrating external JavaScript libraries and no prior knowledge of JavaScript is required. Key Features: ● Easy to pick up. ● An entry way to learning JavaScript for R. ● Covers topics not covered anywhere else. ● Easy to follow along.",
            "image": "http://books.google.com/books/content?id=ntUxEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-07-16T00:00:00.000Z"
        },
        {
            "content_html": "Applied User Data Collection and Analysis Using JavaScript and PHP is designed to provide the technical skills and competency to gather a wide range of user data from web applications in both active and passive methods. This is done by providing the reader with real-world examples of how a variety of different JavaScript- and PHP-based libraries can be used to gather data using custom feedback forms and embedded data gathering tools. Once data has been gathered, this book explores the process of working with numerical data, text analysis, visualization approaches, statistics, and rolling out developed applications to both data analysts and users alike. Using the collected data, this book aims to provide a deeper understanding of user behavior and interests, allowing application developers to further enhance web-application development. Key Features: Complete real-world examples of gathering data from users and web environments Offers readers the fundamentals of text analysis using JavaScript and PHP Allows the user to understand and harness JavaScript data-visualization tools Integration of new and existing data sources into a single, bespoke web-based analysis environment<br><blockquote>This is done by providing the reader with real-world examples of how a variety of different JavaScript- and PHP-based libraries can be used to gather data using custom feedback forms and embedded data gathering tools.</blockquote>",
            "url": "http://books.google.com/books?id=1rMmEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=4&source=gbs_api",
            "title": "Applied User Data Collection and Analysis Using JavaScript and PHP",
            "summary": "Applied User Data Collection and Analysis Using JavaScript and PHP is designed to provide the technical skills and competency to gather a wide range of user data from web applications in both active and passive methods. This is done by providing the reader with real-world examples of how a variety of different JavaScript- and PHP-based libraries can be used to gather data using custom feedback forms and embedded data gathering tools. Once data has been gathered, this book explores the process of working with numerical data, text analysis, visualization approaches, statistics, and rolling out developed applications to both data analysts and users alike. Using the collected data, this book aims to provide a deeper understanding of user behavior and interests, allowing application developers to further enhance web-application development. Key Features: Complete real-world examples of gathering data from users and web environments Offers readers the fundamentals of text analysis using JavaScript and PHP Allows the user to understand and harness JavaScript data-visualization tools Integration of new and existing data sources into a single, bespoke web-based analysis environment",
            "image": "http://books.google.com/books/content?id=1rMmEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-04-28T00:00:00.000Z"
        },
        {
            "content_html": "Why reinvent the wheel every time you run into a problem with JavaScript? This cookbook is chock-full of code recipes that address common programming tasks as well as techniques for building components and apps that work in any browser. This cookbook provides adaptable code samples that you can easily add to almost any project. You'll get the job done faster and learn more about JavaScript in the process. You'll also learn how to take advantage of the latest features in ECMAScript 2015 and beyond, including the new JavaScript data structures, progressive web apps, generator functions, and more. Authors John Paxton, Adam Scott, and Shelley Powers provide recipes to help you use these features to build high-quality application interfaces. Create interactive web and desktop applications Work with JavaScript types, such as strings, numbers, and Booleans Improve your understanding of JavaScript functions, including arrow functions and generators Work with rich media in JavaScript, including audio, video, and SVGs Leverage the latest and greatest JavaScript libraries to rapidly prototype applications Use JavaScript anywhere with Node.js Access and manipulate remote data with REST, GraphQL, and Fetch Fully realize the capabilities of maps, sets, arrays, and iterables Perform asynchronous operations with Promises and async/await<br><blockquote>Authors John Paxton, Adam Scott, and Shelley Powers provide recipes to help you use these features to build high-quality application interfaces.</blockquote>",
            "url": "http://books.google.com/books?id=fruQzQEACAAJ&dq=JavaScript&hl=&cd=5&source=gbs_api",
            "title": "JavaScript Cookbook",
            "summary": "Why reinvent the wheel every time you run into a problem with JavaScript? This cookbook is chock-full of code recipes that address common programming tasks as well as techniques for building components and apps that work in any browser. This cookbook provides adaptable code samples that you can easily add to almost any project. You'll get the job done faster and learn more about JavaScript in the process. You'll also learn how to take advantage of the latest features in ECMAScript 2015 and beyond, including the new JavaScript data structures, progressive web apps, generator functions, and more. Authors John Paxton, Adam Scott, and Shelley Powers provide recipes to help you use these features to build high-quality application interfaces. Create interactive web and desktop applications Work with JavaScript types, such as strings, numbers, and Booleans Improve your understanding of JavaScript functions, including arrow functions and generators Work with rich media in JavaScript, including audio, video, and SVGs Leverage the latest and greatest JavaScript libraries to rapidly prototype applications Use JavaScript anywhere with Node.js Access and manipulate remote data with REST, GraphQL, and Fetch Fully realize the capabilities of maps, sets, arrays, and iterables Perform asynchronous operations with Promises and async/await",
            "image": "http://books.google.com/books/content?id=fruQzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2020-11-30T00:00:00.000Z"
        },
        {
            "content_html": "Whether for building interactive browser-based applications or creating server-side applications in Node, JavaScript is the most widely used language for web programming. With new features, language improvements, paradigms, and potential use cases appearing regularly, there's never been a more exciting time to be a JavaScript developer. In The Joy of JavaScript, author and JavaScript expert Luis Atencio teaches you key design concepts that lead to clean, lean, modular, and easy-to-maintain code. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.<br><blockquote>Fortunately, we&#39;re now in the modern days of <b>JavaScript</b> development, which means several things: ▫ First, we can closely monitor <b>JavaScript&#39;s</b> steady&nbsp;...</blockquote>",
            "url": "http://books.google.com/books?id=os8cEAAAQBAJ&pg=PA3&dq=JavaScript&hl=&cd=6&source=gbs_api",
            "title": "The Joy of JavaScript",
            "summary": "Whether for building interactive browser-based applications or creating server-side applications in Node, JavaScript is the most widely used language for web programming. With new features, language improvements, paradigms, and potential use cases appearing regularly, there's never been a more exciting time to be a JavaScript developer. In The Joy of JavaScript, author and JavaScript expert Luis Atencio teaches you key design concepts that lead to clean, lean, modular, and easy-to-maintain code. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.",
            "image": "http://books.google.com/books/content?id=os8cEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-03-02T00:00:00.000Z"
        },
        {
            "content_html": "The Joy of JavaScript introduces techniques that turn JavaScript programmers into JavaScript pros. Summary Whether building interactive browser-based applications or creating server-side applications in Node, JavaScript is the most widely used language for web programming. With new features, language improvements, paradigms, and potential use cases appearing regularly, there’s never been a more exciting time to be a JavaScript developer. In The Joy of JavaScript, author and JavaScript expert Luis Atencio teaches you key design concepts that lead to clean, lean, modular, and easy-to-maintain code. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the technology JavaScript is at the heart of web applications on the browser side and, via the popular Node.js runtime, it often powers the server side too. Simply put, the web runs on JavaScript. About the book The Joy of JavaScript introduces techniques that turn JavaScript programmers into JavaScript pros. You’ll work with cutting edge APIs, language features, and coding styles to tackle tricky problems in an elegant manner. Along the way, you’ll practice good object design, drive business logic with functional thinking, and untangle complex data flows. What's inside JavaScript’s objects and module system Working with higher order functions Identifying and creating composable software Preparing for upcoming JavaScript features About the reader Written for experienced and passionate JavaScript developers. About the author Luis Atencio is a software engineer for Citrix Systems, author of Manning’s Functional Programming in JavaScript, and co-author of Manning’s RxJS in Action. Table of Contents 1 JavaScript reloaded PART 1 - OBJECTS 2 Inheritance-based object modeling 3 Linked, compositional object models PART 2 - FUNCTIONS 4 Writing composable, pure code 5 Higher-kinded composition PART 3 - CODE 6 ECMAScript Modules 7 Hooked on metaprogramming PART 4 - DATA 8 Linear async flows 9 Stream programming<br><blockquote>Simply put, the web runs on JavaScript. About the book The Joy of JavaScript introduces techniques that turn JavaScript programmers into JavaScript pros.</blockquote>",
            "url": "http://books.google.com/books?id=rjszEAAAQBAJ&pg=PR1&dq=JavaScript&hl=&cd=7&source=gbs_api",
            "title": "The Joy of JavaScript",
            "summary": "The Joy of JavaScript introduces techniques that turn JavaScript programmers into JavaScript pros. Summary Whether building interactive browser-based applications or creating server-side applications in Node, JavaScript is the most widely used language for web programming. With new features, language improvements, paradigms, and potential use cases appearing regularly, there’s never been a more exciting time to be a JavaScript developer. In The Joy of JavaScript, author and JavaScript expert Luis Atencio teaches you key design concepts that lead to clean, lean, modular, and easy-to-maintain code. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the technology JavaScript is at the heart of web applications on the browser side and, via the popular Node.js runtime, it often powers the server side too. Simply put, the web runs on JavaScript. About the book The Joy of JavaScript introduces techniques that turn JavaScript programmers into JavaScript pros. You’ll work with cutting edge APIs, language features, and coding styles to tackle tricky problems in an elegant manner. Along the way, you’ll practice good object design, drive business logic with functional thinking, and untangle complex data flows. What's inside JavaScript’s objects and module system Working with higher order functions Identifying and creating composable software Preparing for upcoming JavaScript features About the reader Written for experienced and passionate JavaScript developers. About the author Luis Atencio is a software engineer for Citrix Systems, author of Manning’s Functional Programming in JavaScript, and co-author of Manning’s RxJS in Action. Table of Contents 1 JavaScript reloaded PART 1 - OBJECTS 2 Inheritance-based object modeling 3 Linked, compositional object models PART 2 - FUNCTIONS 4 Writing composable, pure code 5 Higher-kinded composition PART 3 - CODE 6 ECMAScript Modules 7 Hooked on metaprogramming PART 4 - DATA 8 Linear async flows 9 Stream programming",
            "image": "http://books.google.com/books/content?id=rjszEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-02-10T00:00:00.000Z"
        },
        {
            "content_html": "JavaScript is very fast, simple and integrate easily with other languages. It allows you to create highly responsive interfaces. This e-book is a gentler introduction to JavaScript. The real issues in learning JavaScript is either not understanding the basic concept clearly or overwhelmed by too much detailed learning resources. To encounter these issues, this e-book is created. It is a small book but the content is well balanced and focuses only on core JavaScript Programming area. The benefit of this book is extended to all groups from beginners to expert levels. If you are a visual learner, this book can be a great aid. Each and every component of JavaScript like loops, variables, built-in data structures and functions are made interactive with images and examples. The code for each function can be executed step-wise, and the output can be checked in real time. The book also shed some lights on OOPs concept to get a good grip over the language. Framework like AngularJS, Backbone, Bootstrap, etc. comes handy after referring to this book. You will be able to build a simple web app by the end of this book. Not every book has both minimum price range and maximum quality content. Table Of Content Chapter 1: What is JavaScript? Javascript History How to Run JavaScript? Chapter 2: Javascript Variables Chapter 3: JavaScript Arrays Chapter 4: For, While and Do While LOOP for loop while loop do…while loop Chapter 5: IF, Else, Else IF Conditional Statements If statement If…Else statement If…Else If…Else statement Chapter 6: Javascript Functions Chapter 7: Cookies in JavaScript Javascript Set Cookie JavaScript get Cookie JavaScript Delete Cookie Chapter 8: JavaScript DOM Chapter 9: Object Oriented JavaScript (OOJS) Chapter 10: Internal & External JavaScript What is Internal JavaScript? What is External JavaScript? Chapter 11: Practical Code Examples using JavaScript Example#1: JavaScript Multiplication Table Example#2: JS Forms Example: Example#3: POPUP Message using Event: Chapter 12: JavaScript Interview Questions & Answers<br><blockquote>Chapter 1: What is <b>JavaScript</b>? 1. <b>Javascript</b> History 2. How to Run <b>JavaScript</b>? Chapter 2: <b>Javascript</b> Variables Chapter 3: <b>JavaScript</b> Arrays Chapter 4: For,&nbsp;...</blockquote>",
            "url": "http://books.google.com/books?id=0eX8DwAAQBAJ&pg=PT3&dq=JavaScript&hl=&cd=8&source=gbs_api",
            "title": "Learn JavaScript in 24 Hours",
            "summary": "JavaScript is very fast, simple and integrate easily with other languages. It allows you to create highly responsive interfaces. This e-book is a gentler introduction to JavaScript. The real issues in learning JavaScript is either not understanding the basic concept clearly or overwhelmed by too much detailed learning resources. To encounter these issues, this e-book is created. It is a small book but the content is well balanced and focuses only on core JavaScript Programming area. The benefit of this book is extended to all groups from beginners to expert levels. If you are a visual learner, this book can be a great aid. Each and every component of JavaScript like loops, variables, built-in data structures and functions are made interactive with images and examples. The code for each function can be executed step-wise, and the output can be checked in real time. The book also shed some lights on OOPs concept to get a good grip over the language. Framework like AngularJS, Backbone, Bootstrap, etc. comes handy after referring to this book. You will be able to build a simple web app by the end of this book. Not every book has both minimum price range and maximum quality content. Table Of Content Chapter 1: What is JavaScript? Javascript History How to Run JavaScript? Chapter 2: Javascript Variables Chapter 3: JavaScript Arrays Chapter 4: For, While and Do While LOOP for loop while loop do…while loop Chapter 5: IF, Else, Else IF Conditional Statements If statement If…Else statement If…Else If…Else statement Chapter 6: Javascript Functions Chapter 7: Cookies in JavaScript Javascript Set Cookie JavaScript get Cookie JavaScript Delete Cookie Chapter 8: JavaScript DOM Chapter 9: Object Oriented JavaScript (OOJS) Chapter 10: Internal & External JavaScript What is Internal JavaScript? What is External JavaScript? Chapter 11: Practical Code Examples using JavaScript Example#1: JavaScript Multiplication Table Example#2: JS Forms Example: Example#3: POPUP Message using Event: Chapter 12: JavaScript Interview Questions & Answers",
            "image": "http://books.google.com/books/content?id=0eX8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2020-09-15T00:00:00.000Z"
        },
        {
            "content_html": "Everything you need to get to grips with HTML, CSS and JavaScript – the three coding languages that are used to create modern web pages – all in easy steps! HTML, CSS & JavaScript in easy steps instructs the reader on each of the three coding languages that are used to create modern web pages; HyperText Markup Language (HTML) tags are used to control the structure of web page content, Cascading Style Sheets (CSS) rules are used to determine how web page content appears, and JavaScript functions are used to provide web page interactivity. HTML, CSS & JavaScript in easy steps contains examples and screenshots that illustrate each feature of all three coding languages. You'll learn how to create web pages to display text, images, lists, tables, hyperlinks, forms, audio, and video. Each chapter builds your knowledge so by the end of the book you'll have gained a sound understanding of HTML markup, CSS rules and JavaScript functions. HTML, CSS & JavaScript in easy steps has an easy-to-follow style that will appeal to anyone who wants to create great functional web pages. It will appeal to programmers who want to quickly add web page coding to their skills set, and to the student who is studying website design at school or college, and to those seeking a career in web development. Table of Contents: 1. Get Started in HTML 2. Manage Page Content 3. Insert Hyperlinks 4. Arrange Page Sections 5. Write Lists and Tables 6. Embed Media Content 7. Create Input Forms 8. Get Started in CSS 9. Manage the Box Model 10. Manipulate Text Styles 11. Organize Tables and Lists 12. Generate Effects 13. Control the Web Page 14. Design with Grids 15. Get Started in JavaScript 16. Perform Useful Operations 17. Manage the Script Flow 18. Use Script Objects 19. Control Numbers and Strings 20. Address the Window Object 21. Interact with the Document<br><blockquote>Each chapter builds your knowledge so by the end of the book you&#39;ll have gained a sound understanding of HTML markup, CSS rules and JavaScript functions.</blockquote>",
            "url": "http://books.google.com/books?id=C3L1DwAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=9&source=gbs_api",
            "title": "HTML, CSS & JavaScript in easy steps",
            "summary": "Everything you need to get to grips with HTML, CSS and JavaScript – the three coding languages that are used to create modern web pages – all in easy steps! HTML, CSS & JavaScript in easy steps instructs the reader on each of the three coding languages that are used to create modern web pages; HyperText Markup Language (HTML) tags are used to control the structure of web page content, Cascading Style Sheets (CSS) rules are used to determine how web page content appears, and JavaScript functions are used to provide web page interactivity. HTML, CSS & JavaScript in easy steps contains examples and screenshots that illustrate each feature of all three coding languages. You'll learn how to create web pages to display text, images, lists, tables, hyperlinks, forms, audio, and video. Each chapter builds your knowledge so by the end of the book you'll have gained a sound understanding of HTML markup, CSS rules and JavaScript functions. HTML, CSS & JavaScript in easy steps has an easy-to-follow style that will appeal to anyone who wants to create great functional web pages. It will appeal to programmers who want to quickly add web page coding to their skills set, and to the student who is studying website design at school or college, and to those seeking a career in web development. Table of Contents: 1. Get Started in HTML 2. Manage Page Content 3. Insert Hyperlinks 4. Arrange Page Sections 5. Write Lists and Tables 6. Embed Media Content 7. Create Input Forms 8. Get Started in CSS 9. Manage the Box Model 10. Manipulate Text Styles 11. Organize Tables and Lists 12. Generate Effects 13. Control the Web Page 14. Design with Grids 15. Get Started in JavaScript 16. Perform Useful Operations 17. Manage the Script Flow 18. Use Script Objects 19. Control Numbers and Strings 20. Address the Window Object 21. Interact with the Document",
            "image": "http://books.google.com/books/content?id=C3L1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2020-08-05T00:00:00.000Z"
        },
        {
            "content_html": "This book is written in a practical and easy way and offers theory and plenty of practical material. Now is your chance to delve into Javascript basics with this easy to follow guide.<br><blockquote>This book is written in a practical and easy way and offers theory and plenty of practical material. Now is your chance to delve into Javascript basics with this easy to follow guide.</blockquote>",
            "url": "http://books.google.com/books?id=2T6MzgEACAAJ&dq=JavaScript&hl=&cd=10&source=gbs_api",
            "title": "Javascript",
            "summary": "This book is written in a practical and easy way and offers theory and plenty of practical material. Now is your chance to delve into Javascript basics with this easy to follow guide.",
            "image": "http://books.google.com/books/content?id=2T6MzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2021-07-13T00:00:00.000Z"
        }
    ]
}