{
    "version": "https://jsonfeed.org/version/1",
    "title": "JavaScript(en) on Google Book",
    "home_page_url": "https://azu.github.io/book-rss/JavaScript-en.json",
    "description": "JavaScript(en) on Google Book",
    "items": [
        {
            "content_html": "Explore an alternative method of front-end application development without using frameworks or third-party libraries. This updated book provides you with the required skills and freedom to consider a “no framework” approach when choosing a technology for creating a new project. New topics covered include a brief history of JavaScript frameworks and their key developments, how to protect domain code, and how to work with frameworkless in legacy applications. You’ll work through the most important issues in a clear and sensible way, using practical methods and tools to gain an understanding of non-functional requirements. This book answers questions on important topics such as state management, making a routing system, creating a REST client using fetch, and reveals the trade-offs and risks associated with choosing the wrong framework or tool for your project, as well as provides sustainability, and functional alternatives. Frameworkless Front-End Development breaks down the concept of technical debt and the ways in which a framework can impact the lifespan of a project. Along with gaining a comprehensive and clear guide on coding effectively from scratch without frameworks, you will also learn some principles of technical decision-making. What You’ll Learn Understand DOM manipulation Manage the state of a fronted application with different patterns Safely migrate existent applications to a new framework or to frameworkless code Understand the importance of non-functional requirements See how a Framework can affect the “health” of a codebase Who This Book Is For Skilled JavaScript developers who want to understand how to effectively write code without using dependencies CTOs who need to help teams to choose a technology stack for their next project Consultants that need to refactor an existent JavaScript front-end codebase<br><blockquote>This book answers questions on important topics such as state management, making a routing system, creating a REST client using fetch, and reveals the trade-offs and risks associated with choosing the wrong framework or tool for your ...</blockquote>",
            "url": "http://books.google.com/books?id=tA-rzwEACAAJ&dq=JavaScript&hl=&cd=1&source=gbs_api",
            "title": "Frameworkless Front-End Development",
            "summary": "Explore an alternative method of front-end application development without using frameworks or third-party libraries. This updated book provides you with the required skills and freedom to consider a “no framework” approach when choosing a technology for creating a new project. New topics covered include a brief history of JavaScript frameworks and their key developments, how to protect domain code, and how to work with frameworkless in legacy applications. You’ll work through the most important issues in a clear and sensible way, using practical methods and tools to gain an understanding of non-functional requirements. This book answers questions on important topics such as state management, making a routing system, creating a REST client using fetch, and reveals the trade-offs and risks associated with choosing the wrong framework or tool for your project, as well as provides sustainability, and functional alternatives. Frameworkless Front-End Development breaks down the concept of technical debt and the ways in which a framework can impact the lifespan of a project. Along with gaining a comprehensive and clear guide on coding effectively from scratch without frameworks, you will also learn some principles of technical decision-making. What You’ll Learn Understand DOM manipulation Manage the state of a fronted application with different patterns Safely migrate existent applications to a new framework or to frameworkless code Understand the importance of non-functional requirements See how a Framework can affect the “health” of a codebase Who This Book Is For Skilled JavaScript developers who want to understand how to effectively write code without using dependencies CTOs who need to help teams to choose a technology stack for their next project Consultants that need to refactor an existent JavaScript front-end codebase",
            "image": "http://books.google.com/books/content?id=tA-rzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2023-10-06T00:00:00.000Z"
        },
        {
            "content_html": "Do you want to write beautiful, structured, and maintainable JavaScript by applying modern design patterns to the language? Do you want clean, efficient, manageable code? Want to stay up-to-date with the latest best practices? If so, the updated second edition of Learning JavaScript Design Patterns is the ideal place to start. Author Addy Osmani shows you how to apply modern design patterns to JavaScript and React—including modules, mixins, observers, and mediators. You'll learn about performance and rendering patterns such as server-side rendering and Islands architecture. You'll also learn how architectural patterns like MVC, MVP, and MVVM are useful from the perspective of a modern web application developer. This book explores: Architectural patterns for structuring your components and apps More than 20 design patterns in JavaScript and React, applicable for developers at any level Different pattern categories including creational, structural, and behavioral Essential performance patterns including dynamic imports and code-splitting Rendering patterns such as server-side rendering, hydration, Islands architecture, and more Additionally, you'll explore modern JavaScript syntax like JavaScript modules, React patterns like Hooks, higher-order components (HOCs), and more, to stay ahead in the ever-evolving world of web development.<br><blockquote>This book explores: Architectural patterns for structuring your components and apps More than 20 design patterns in JavaScript and React, applicable for developers at any level Different pattern categories including creational, structural, ...</blockquote>",
            "url": "http://books.google.com/books?id=Akq8EAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=2&source=gbs_api",
            "title": "Learning JavaScript Design Patterns",
            "summary": "Do you want to write beautiful, structured, and maintainable JavaScript by applying modern design patterns to the language? Do you want clean, efficient, manageable code? Want to stay up-to-date with the latest best practices? If so, the updated second edition of Learning JavaScript Design Patterns is the ideal place to start. Author Addy Osmani shows you how to apply modern design patterns to JavaScript and React—including modules, mixins, observers, and mediators. You'll learn about performance and rendering patterns such as server-side rendering and Islands architecture. You'll also learn how architectural patterns like MVC, MVP, and MVVM are useful from the perspective of a modern web application developer. This book explores: Architectural patterns for structuring your components and apps More than 20 design patterns in JavaScript and React, applicable for developers at any level Different pattern categories including creational, structural, and behavioral Essential performance patterns including dynamic imports and code-splitting Rendering patterns such as server-side rendering, hydration, Islands architecture, and more Additionally, you'll explore modern JavaScript syntax like JavaScript modules, React patterns like Hooks, higher-order components (HOCs), and more, to stay ahead in the ever-evolving world of web development.",
            "image": "http://books.google.com/books/content?id=Akq8EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-04-28T00:00:00.000Z"
        },
        {
            "content_html": "Get familiar with React design patterns and best practices to solve common React development problems KEY FEATURES ● Get tips to create a better React app architecture. ● Explore the best practices for building scalable React apps. ● Discover ways to write tests for your React applications. DESCRIPTION React is a JavaScript library created by Facebook to help build applications with components. In React, there are proven methods to solve common problems experienced by React developers. If you are looking for different ways how to choose your pattern when building a React app, then this book is for you. The book starts by sharing the best practices for architecting your React app. It then helps you learn how to create clean, performant, and maintainable React components using JavaScript and TypeScript. The book helps you explore and work with some useful hooks in React. It also helps you learn how to enable server-side rendering for your React app. Later, the book will help you discover ways to style your React components effectively. Towards the end, the book will help you learn how to write tests for your React applications. By the end of the book, you will be able to build complex and maintainable React apps with JavaScript and TypeScript. WHAT YOU WILL LEARN ● Learn how to manage State with Hooks on React components. ● Learn how to style React components with CSS. ● Understand how to use Next.js for server-side rendering of your React app. ● Explore different ways to fetch data using API in React. ● Test your React app with React testing library, Jest, and Cypress. WHO THIS BOOK IS FOR This book is for Web developers, JavaScript developers, and Typescript developers who want to build complex and scalable apps with React. Software engineers and developers who are early in their React careers will find this book very helpful. TABLE OF CONTENTS 1. React Anti-Patterns and Best Practices 2. Writing Components 3. Clean and Maintainable Code 4. React Hooks 5. Styling 6. Server-Side Renderings 7. Data Fetching 8. Building Scalable Applications 9. Testing<br><blockquote>If you are looking for different ways how to choose your pattern when building a React app, then this book is for you. The book starts by sharing the best practices for architecting your React app.</blockquote>",
            "url": "http://books.google.com/books?id=UfmpEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=3&source=gbs_api",
            "title": "React.js Design Patterns",
            "summary": "Get familiar with React design patterns and best practices to solve common React development problems KEY FEATURES ● Get tips to create a better React app architecture. ● Explore the best practices for building scalable React apps. ● Discover ways to write tests for your React applications. DESCRIPTION React is a JavaScript library created by Facebook to help build applications with components. In React, there are proven methods to solve common problems experienced by React developers. If you are looking for different ways how to choose your pattern when building a React app, then this book is for you. The book starts by sharing the best practices for architecting your React app. It then helps you learn how to create clean, performant, and maintainable React components using JavaScript and TypeScript. The book helps you explore and work with some useful hooks in React. It also helps you learn how to enable server-side rendering for your React app. Later, the book will help you discover ways to style your React components effectively. Towards the end, the book will help you learn how to write tests for your React applications. By the end of the book, you will be able to build complex and maintainable React apps with JavaScript and TypeScript. WHAT YOU WILL LEARN ● Learn how to manage State with Hooks on React components. ● Learn how to style React components with CSS. ● Understand how to use Next.js for server-side rendering of your React app. ● Explore different ways to fetch data using API in React. ● Test your React app with React testing library, Jest, and Cypress. WHO THIS BOOK IS FOR This book is for Web developers, JavaScript developers, and Typescript developers who want to build complex and scalable apps with React. Software engineers and developers who are early in their React careers will find this book very helpful. TABLE OF CONTENTS 1. React Anti-Patterns and Best Practices 2. Writing Components 3. Clean and Maintainable Code 4. React Hooks 5. Styling 6. Server-Side Renderings 7. Data Fetching 8. Building Scalable Applications 9. Testing",
            "image": "http://books.google.com/books/content?id=UfmpEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-01-27T00:00:00.000Z"
        },
        {
            "content_html": "Mastering React Native helps the reader master the React Native framework for faster and more robust mobile app development. React Native is an open-source JavaScript framework that allows you to create applications for many platforms, including iOS, Android, and the web, all with the same code base. It is built on the React framework, and it provides all of React’s power to mobile app development. React Native was a natural continuation of React. It is a mobile framework that includes JavaScript to create near-native apps. JSX, a hybrid of JavaScript and XML-like markup, is used to make React Native applications. The React Native “bridge” then calls the native rendering APIs in Objective-C (for iOS) or Java (for Android) behind the scenes (for Android). As a result, your app will appear and feel like any other mobile app, as it will be rendered using genuine mobile UI components instead of web views. React Native also offers JavaScript interfaces for platform APIs, allowing your React Native apps to use features such as user location and the phone camera. If your app is UI focused, React Native is an excellent choice because it comes with an extensive UI library. Becoming a React Native developer gives you access to exciting, cutting-edge projects which frequently incorporate innovative technology like Augmented Reality. Job opportunities for React Native devs are aplenty, and it is undoubtedly a skill worthy of consideration owing to its popularity with startups and corporates alike. With Mastering React Native, learning React Native becomes easy and will help readers undoubtedly advance their careers. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with more than a decade of experience in the computing field.<br><blockquote>It is built on the React framework, and it provides all of React’s power to mobile app development. React Native was a natural continuation of React. It is a mobile framework that includes JavaScript to create near-native apps.</blockquote>",
            "url": "http://books.google.com/books?id=pE-VEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=4&source=gbs_api",
            "title": "Mastering React Native",
            "summary": "Mastering React Native helps the reader master the React Native framework for faster and more robust mobile app development. React Native is an open-source JavaScript framework that allows you to create applications for many platforms, including iOS, Android, and the web, all with the same code base. It is built on the React framework, and it provides all of React’s power to mobile app development. React Native was a natural continuation of React. It is a mobile framework that includes JavaScript to create near-native apps. JSX, a hybrid of JavaScript and XML-like markup, is used to make React Native applications. The React Native “bridge” then calls the native rendering APIs in Objective-C (for iOS) or Java (for Android) behind the scenes (for Android). As a result, your app will appear and feel like any other mobile app, as it will be rendered using genuine mobile UI components instead of web views. React Native also offers JavaScript interfaces for platform APIs, allowing your React Native apps to use features such as user location and the phone camera. If your app is UI focused, React Native is an excellent choice because it comes with an extensive UI library. Becoming a React Native developer gives you access to exciting, cutting-edge projects which frequently incorporate innovative technology like Augmented Reality. Job opportunities for React Native devs are aplenty, and it is undoubtedly a skill worthy of consideration owing to its popularity with startups and corporates alike. With Mastering React Native, learning React Native becomes easy and will help readers undoubtedly advance their careers. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with more than a decade of experience in the computing field.",
            "image": "http://books.google.com/books/content?id=pE-VEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-11-29T00:00:00.000Z"
        },
        {
            "content_html": "Web developers--this is your all-in-one guide to HTML and CSS! Learn to use HTML to format text and structure web pages. Understand the HTML document skeleton before creating forms, referencing hyperlinks, embedding active content, and more. Then style your pages with CSS: Create consistent designs with selectors, the box model, the cascade algorithm, and inheritance. Round out your client-side development experience by getting to know JavaScript. With detailed code examples, you'll master HTML and CSS in no time! a. HTML for Formatting and StructureMaster HTML syntax and document structure. Work with tags, elements, and attributes to build HTML documents. Create tables and forms, embed images, configure links, and develop interactive HTML elements. b. CSS for Style and DesignDevelop simple and complex web layouts with CSS rules, selectors, declarations, combinators, pseudoclasses, and pseudoelements. Understand the principles of cascading, specificity, and inheritance. Learn to use the CSS box model, the position property, and more. c. JavaScript FundamentalsExpand your knowledge with an introduction to JavaScript. See how to use variables, statements, functions, arrays, and objects to write and run simple programs. Explore the basics of Ajax for interactive web application design. Highlights: HTML syntax and structure HTML elements Tables, links, and images HTML forms CSS selectors Cascade and inheritance CSS box model CSS preprocessors Responsive layout design Testing JavaScript Ajax<br><blockquote>Web developers--this is your all-in-one guide to HTML and CSS!</blockquote>",
            "url": "http://books.google.com/books?id=ANaTzwEACAAJ&dq=JavaScript&hl=&cd=5&source=gbs_api",
            "title": "HTML and CSS",
            "summary": "Web developers--this is your all-in-one guide to HTML and CSS! Learn to use HTML to format text and structure web pages. Understand the HTML document skeleton before creating forms, referencing hyperlinks, embedding active content, and more. Then style your pages with CSS: Create consistent designs with selectors, the box model, the cascade algorithm, and inheritance. Round out your client-side development experience by getting to know JavaScript. With detailed code examples, you'll master HTML and CSS in no time! a. HTML for Formatting and StructureMaster HTML syntax and document structure. Work with tags, elements, and attributes to build HTML documents. Create tables and forms, embed images, configure links, and develop interactive HTML elements. b. CSS for Style and DesignDevelop simple and complex web layouts with CSS rules, selectors, declarations, combinators, pseudoclasses, and pseudoelements. Understand the principles of cascading, specificity, and inheritance. Learn to use the CSS box model, the position property, and more. c. JavaScript FundamentalsExpand your knowledge with an introduction to JavaScript. See how to use variables, statements, functions, arrays, and objects to write and run simple programs. Explore the basics of Ajax for interactive web application design. Highlights: HTML syntax and structure HTML elements Tables, links, and images HTML forms CSS selectors Cascade and inheritance CSS box model CSS preprocessors Responsive layout design Testing JavaScript Ajax",
            "image": "http://books.google.com/books/content?id=ANaTzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2023-01-01T00:00:00.000Z"
        },
        {
            "content_html": "Mastering React helps the reader master the React JavaScript framework for faster and more robust front-end development. React is a JavaScript framework for creating interface design that is coherent, cheap, and customizable. It makes it possible to create complicated user interfaces out of “modules,” which are small, independent pieces of code. The primary goal of using React is the easier creation of visual interfaces. React was developed by Facebook and released to the public in 2013. It powers some of the most popular apps, including Facebook and Instagram. It uses virtual DOM (JavaScript Document Object Model), which increases the application’s performance. The virtualized DOM in JavaScript is faster than the conventional DOM. React can be used as both a standalone framework and in conjunction with other platforms. It employs component and data patterns to improve clarity while also assisting in maintaining larger applications. React saves you time and money during development because it is component-based. The design can be segmented into reusable modules that could be used to adjust interfaces dynamically. The front-end development industry has a reputation for moving at a breakneck speed. Organizations cannot be expected to modify their apps annually to catch pace with technological innovations. This is why businesses prefer React. React simplifies many things, and its ecosystem is full of valuable subframeworks and tools. React is among the most powerful front-end frameworks out there. As such, learning React development can future-proof anyone’s career in the long run, and even yield immediate benefits. This book explains the concepts of React in an easy-to-grasp language. With Mastering React, learning React becomes a charm, and readers will undoubtedly advance their careers with the help of this book. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with more than a decade of experience in the computing field.<br><blockquote>This book explains the concepts of React in an easy-to-grasp language. With Mastering React, learning React becomes a charm, and readers will undoubtedly advance their careers with the help of this book.</blockquote>",
            "url": "http://books.google.com/books?id=j_-VEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=6&source=gbs_api",
            "title": "Mastering React",
            "summary": "Mastering React helps the reader master the React JavaScript framework for faster and more robust front-end development. React is a JavaScript framework for creating interface design that is coherent, cheap, and customizable. It makes it possible to create complicated user interfaces out of “modules,” which are small, independent pieces of code. The primary goal of using React is the easier creation of visual interfaces. React was developed by Facebook and released to the public in 2013. It powers some of the most popular apps, including Facebook and Instagram. It uses virtual DOM (JavaScript Document Object Model), which increases the application’s performance. The virtualized DOM in JavaScript is faster than the conventional DOM. React can be used as both a standalone framework and in conjunction with other platforms. It employs component and data patterns to improve clarity while also assisting in maintaining larger applications. React saves you time and money during development because it is component-based. The design can be segmented into reusable modules that could be used to adjust interfaces dynamically. The front-end development industry has a reputation for moving at a breakneck speed. Organizations cannot be expected to modify their apps annually to catch pace with technological innovations. This is why businesses prefer React. React simplifies many things, and its ecosystem is full of valuable subframeworks and tools. React is among the most powerful front-end frameworks out there. As such, learning React development can future-proof anyone’s career in the long run, and even yield immediate benefits. This book explains the concepts of React in an easy-to-grasp language. With Mastering React, learning React becomes a charm, and readers will undoubtedly advance their careers with the help of this book. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with more than a decade of experience in the computing field.",
            "image": "http://books.google.com/books/content?id=j_-VEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-11-29T00:00:00.000Z"
        },
        {
            "content_html": "Mastering Vue.js helps the reader master the Vue.js JavaScript framework for faster and more robust front-end development. Vue is a popular JavaScript front-end framework that is rapidly expanding. It is easy to use, small (less than 24 KB), and really fast. It is simple to include in other applications and libraries. Vue.js is easy to install, and beginners may quickly learn how to use it and begin creating their interface design. What makes Vue special is that it is different from most other JavaScript frameworks and libraries. Unlike other monolithic frameworks, Vue is built from the ground up to be incrementally adaptable. The core library focuses primarily on the View layer, and is easy to use and combine with other libraries or projects. On the other hand, when merged with contemporary stacks and libraries, Vue is perfectly capable of running powerful Single-Page Web Applications. Working with Vue.js can be fun. Leveraging Vue and its plugins can help one easily create excellent Internet and smartphone-compatible applications. Vue is both compact and customizable, and comes with multiple capabilities for intelligent state management and navigation choices. All said and done, learning Vue is an excellent career initiative, especially since it is rapidly gaining favor among startups and established enterprises alike. Vue is an excellent choice if you want to make a highly engaging, flexible, and data-driven app. It has an easy-to-understand layout which you can learn in minutes. Unlike Angular or React, Vue.js does not have a lot of challenges or concepts to master. It is an excellent choice for programmers looking to learn and implement new technology for their next project. With Mastering Vue.js, learning Vue becomes very straightforward, which will help readers undoubtedly advance their careers. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with over a decade of experience in the computing field.<br><blockquote>Mastering Vue.js helps the reader master the Vue.js JavaScript framework for faster and more robust front-end development. Vue is a popular JavaScript front-end framework that is rapidly expanding.</blockquote>",
            "url": "http://books.google.com/books?id=4NKLEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=7&source=gbs_api",
            "title": "Mastering Vue.js",
            "summary": "Mastering Vue.js helps the reader master the Vue.js JavaScript framework for faster and more robust front-end development. Vue is a popular JavaScript front-end framework that is rapidly expanding. It is easy to use, small (less than 24 KB), and really fast. It is simple to include in other applications and libraries. Vue.js is easy to install, and beginners may quickly learn how to use it and begin creating their interface design. What makes Vue special is that it is different from most other JavaScript frameworks and libraries. Unlike other monolithic frameworks, Vue is built from the ground up to be incrementally adaptable. The core library focuses primarily on the View layer, and is easy to use and combine with other libraries or projects. On the other hand, when merged with contemporary stacks and libraries, Vue is perfectly capable of running powerful Single-Page Web Applications. Working with Vue.js can be fun. Leveraging Vue and its plugins can help one easily create excellent Internet and smartphone-compatible applications. Vue is both compact and customizable, and comes with multiple capabilities for intelligent state management and navigation choices. All said and done, learning Vue is an excellent career initiative, especially since it is rapidly gaining favor among startups and established enterprises alike. Vue is an excellent choice if you want to make a highly engaging, flexible, and data-driven app. It has an easy-to-understand layout which you can learn in minutes. Unlike Angular or React, Vue.js does not have a lot of challenges or concepts to master. It is an excellent choice for programmers looking to learn and implement new technology for their next project. With Mastering Vue.js, learning Vue becomes very straightforward, which will help readers undoubtedly advance their careers. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with over a decade of experience in the computing field.",
            "image": "http://books.google.com/books/content?id=4NKLEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-11-11T00:00:00.000Z"
        },
        {
            "content_html": "Understand the basic building blocks of WebAssembly and learn, install, and use various tools from the Rust and WebAssembly ecosystem Key Features • Understand the Rust programming language and WebAssembly concepts for web development • Build web, mobile, and embedded apps using WebAssembly • Enhance the scalability and resilience of your web apps Book Description Rust is an open source language tuned toward safety, concurrency, and performance. WebAssembly brings all the capabilities of the native world into the JavaScript world. Together, Rust and WebAssembly provide a way to create robust and performant web applications. They help make your web applications blazingly fast and have small binaries. Developers working with JavaScript will be able to put their knowledge to work with this practical guide to developing faster and maintainable code. Complete with step-by-step explanations of essential concepts, examples, and self-assessment questions, you'll begin by exploring WebAssembly, using the various tools provided by the ecosystem, and understanding how to use WebAssembly and JavaScript together to build a high-performing application. You'll then learn binary code to work with a variety of tools that help you to convert native code into WebAssembly. The book will introduce you to the world of Rust and the ecosystem that makes it easy to build/ship WebAssembly-based applications. By the end of this WebAssembly Rust book, you'll be able to create and ship your own WebAssembly applications using Rust and JavaScript, understand how to debug, and use the right tools to optimize and deliver high-performing applications. What you will learn • Explore WebAssembly and the different tools available in the WebAssembly ecosystem • Understand the raw WebAssembly binary and the WebAssembly text format • Use the Web and JavaScript API with wasm-bindgen • Optimize Rust and WebAssembly for high performance • Run and debug WebAssembly and Rust code • Explore various tools available in the RustWASM ecosystem Who this book is for This book is for JavaScript developers who want to deliver better performance and ship type-safe code. Rust developers or backend engineers looking to build full-stack applications without worrying too much about JavaScript programming will also find the book useful.<br><blockquote>By the end of this WebAssembly Rust book, you&#39;ll be able to create and ship your own WebAssembly applications using Rust and JavaScript, understand how to debug, and use the right tools to optimize and deliver high-performing applications.</blockquote>",
            "url": "http://books.google.com/books?id=eCJuEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=8&source=gbs_api",
            "title": "Practical WebAssembly",
            "summary": "Understand the basic building blocks of WebAssembly and learn, install, and use various tools from the Rust and WebAssembly ecosystem Key Features • Understand the Rust programming language and WebAssembly concepts for web development • Build web, mobile, and embedded apps using WebAssembly • Enhance the scalability and resilience of your web apps Book Description Rust is an open source language tuned toward safety, concurrency, and performance. WebAssembly brings all the capabilities of the native world into the JavaScript world. Together, Rust and WebAssembly provide a way to create robust and performant web applications. They help make your web applications blazingly fast and have small binaries. Developers working with JavaScript will be able to put their knowledge to work with this practical guide to developing faster and maintainable code. Complete with step-by-step explanations of essential concepts, examples, and self-assessment questions, you'll begin by exploring WebAssembly, using the various tools provided by the ecosystem, and understanding how to use WebAssembly and JavaScript together to build a high-performing application. You'll then learn binary code to work with a variety of tools that help you to convert native code into WebAssembly. The book will introduce you to the world of Rust and the ecosystem that makes it easy to build/ship WebAssembly-based applications. By the end of this WebAssembly Rust book, you'll be able to create and ship your own WebAssembly applications using Rust and JavaScript, understand how to debug, and use the right tools to optimize and deliver high-performing applications. What you will learn • Explore WebAssembly and the different tools available in the WebAssembly ecosystem • Understand the raw WebAssembly binary and the WebAssembly text format • Use the Web and JavaScript API with wasm-bindgen • Optimize Rust and WebAssembly for high performance • Run and debug WebAssembly and Rust code • Explore various tools available in the RustWASM ecosystem Who this book is for This book is for JavaScript developers who want to deliver better performance and ship type-safe code. Rust developers or backend engineers looking to build full-stack applications without worrying too much about JavaScript programming will also find the book useful.",
            "image": "http://books.google.com/books/content?id=eCJuEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-05-02T00:00:00.000Z"
        },
        {
            "content_html": "Of late, TypeScript has risen in popularity owing to its ease of use and versatile compatibility. As such, more and more developers are looking to quickly and efficiently master TypeScript. If you’re looking for a detailed, yet easy to comprehend guide to TypeScript, your search ends here! The book is a detailed guide that will help learners get started with TypeScript programming in no time. It talks about the basics and then moves on to practical exercises to help readers quickly gain the required knowledge. The book is meant for both JavaScript developers and learners without a formal JS background. Furthermore, while a background in JavaScript programming might be of help, the book requires no prior coding background and can be easily mastered even by beginners. What Will You Learn: Detailed focus on TypeScript programming Introduction to TypeScript concepts and paradigm Introduction to TS architecture and components OOP programming with TS Web development in TypeScript Who Is This Book for: Web developers looking to learn TypeScript; web development beginners; JavaScript developers; and frontend developers. About the Author Sufyan bin Uzayr is a writer, coder, and entrepreneur with more than a decade of experience in the industry. He has authored several books in the past, pertaining to a diverse range of topics, ranging from History to Computers/IT. Sufyan is the Director of Parakozm, a multinational IT company specializing in EdTech solutions. He also runs Zeba Academy, an online learning and teaching vertical with a focus on STEM fields. Sufyan specializes in a wide variety of technologies, such as JavaScript, Dart, WordPress, Drupal, Linux, and Python. He holds multiple degrees, including ones in Management, IT, Literature, and Political Science. Sufyan is a digital nomad, dividing his time between four countries. He has lived and taught in universities and educational institutions around the globe. Sufyan takes a keen interest in technology, politics, literature, history, and sports, and in his spare time, he enjoys teaching coding and English to young students. Learn more at sufyanism.com<br><blockquote>What Will You Learn: Detailed focus on TypeScript programming Introduction to TypeScript concepts and paradigm Introduction to TS architecture and components OOP programming with TS Web development in TypeScript Who Is This Book for: Web ...</blockquote>",
            "url": "http://books.google.com/books?id=P-lZEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=9&source=gbs_api",
            "title": "TypeScript for Beginners",
            "summary": "Of late, TypeScript has risen in popularity owing to its ease of use and versatile compatibility. As such, more and more developers are looking to quickly and efficiently master TypeScript. If you’re looking for a detailed, yet easy to comprehend guide to TypeScript, your search ends here! The book is a detailed guide that will help learners get started with TypeScript programming in no time. It talks about the basics and then moves on to practical exercises to help readers quickly gain the required knowledge. The book is meant for both JavaScript developers and learners without a formal JS background. Furthermore, while a background in JavaScript programming might be of help, the book requires no prior coding background and can be easily mastered even by beginners. What Will You Learn: Detailed focus on TypeScript programming Introduction to TypeScript concepts and paradigm Introduction to TS architecture and components OOP programming with TS Web development in TypeScript Who Is This Book for: Web developers looking to learn TypeScript; web development beginners; JavaScript developers; and frontend developers. About the Author Sufyan bin Uzayr is a writer, coder, and entrepreneur with more than a decade of experience in the industry. He has authored several books in the past, pertaining to a diverse range of topics, ranging from History to Computers/IT. Sufyan is the Director of Parakozm, a multinational IT company specializing in EdTech solutions. He also runs Zeba Academy, an online learning and teaching vertical with a focus on STEM fields. Sufyan specializes in a wide variety of technologies, such as JavaScript, Dart, WordPress, Drupal, Linux, and Python. He holds multiple degrees, including ones in Management, IT, Literature, and Political Science. Sufyan is a digital nomad, dividing his time between four countries. He has lived and taught in universities and educational institutions around the globe. Sufyan takes a keen interest in technology, politics, literature, history, and sports, and in his spare time, he enjoys teaching coding and English to young students. Learn more at sufyanism.com",
            "image": "http://books.google.com/books/content?id=P-lZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-03-23T00:00:00.000Z"
        }
    ]
}