{
    "version": "https://jsonfeed.org/version/1",
    "title": "JavaScript(en) on Google Book",
    "home_page_url": "https://azu.github.io/book-rss/JavaScript-en.json",
    "description": "JavaScript(en) on Google Book",
    "items": [
        {
            "content_html": "Learn the skills you need to build React applications quickly! This fully revised second edition introduces functional components, React hooks, static site generators, and more. Build your skills with React and its ecosystem fast. There’s no slow theory and tedious history. You’ll dive into React code right from the very first chapter. The book teaches you how React thinks, introducing ways of structuring your architecture that even work with large teams. React Quickly, Second Edition is a practical guide to React for busy web developers. Following over 100 carefully chosen and clearly explained examples, you'll learn React development using your existing JavaScript and web development skills. This totally rewritten second edition is full of brand new topics, including chapters on functional components, static site generations, and CSS in JS. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.<br><blockquote>The book teaches you how React thinks, introducing ways of structuring your architecture that even work with large teams. React Quickly, Second Edition is a practical guide to React for busy web developers.</blockquote>",
            "url": "http://books.google.com/books?id=eTfwzgEACAAJ&dq=JavaScript&hl=&cd=1&source=gbs_api",
            "title": "React Quickly, Second Edition",
            "summary": "Learn the skills you need to build React applications quickly! This fully revised second edition introduces functional components, React hooks, static site generators, and more. Build your skills with React and its ecosystem fast. There’s no slow theory and tedious history. You’ll dive into React code right from the very first chapter. The book teaches you how React thinks, introducing ways of structuring your architecture that even work with large teams. React Quickly, Second Edition is a practical guide to React for busy web developers. Following over 100 carefully chosen and clearly explained examples, you'll learn React development using your existing JavaScript and web development skills. This totally rewritten second edition is full of brand new topics, including chapters on functional components, static site generations, and CSS in JS. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.",
            "image": "http://books.google.com/books/content?id=eTfwzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2022-10-25T00:00:00.000Z"
        },
        {
            "content_html": "Leverage the power of Svelte to quickly produce the foundations of a framework-agnostic component library that can extend and develop over time. This is a project-oriented book that simplifies setting up the skeleton of the library and adding components, using little more than a text editor or free software. You'll gain a starting baseline that can be used to develop future projects or incorporated into an existing workflow. You'll take development to the next level and can use this knowledge to create components with any framework, such as React, Angular or Vue.js, not just Svelte. Developing Web Components with Svelte is an excellent resource for getting acquainted with creating and maintaining a component library using a phased approach. It takes the view that you don't have to create something complex and unwieldy. Instead, you can start building something quickly, then extend it as needs dictate over time, without sacrificing speed or features. You'll see how to develop cleaner components in a quick, clear and straightforward way. The components you create in this project can be made available in one of the world's most extensive component ecosystems to be usable by other frameworks, making them genuinely reusable. In short, Svelte offers plenty of opportunities as it is based on Node.js and JavaScript making Svelte a powerful package to work from. What You'll Learn Use the Svelte framework to rapidly create and deploy the foundation of a component library that is versatile and performant Review developing and customizing components based on our needs Work through a real-world project to help solidify skills learned from the book and put them into practice Who This Book Is For Website developers, familiar with JavaScript, who are keen to learn how to leverage the Svelte framework fast Agile development teams, where time is of the essence, and the pressure is on to deliver results quickly Developers who want to focus on simplicity, to produce efficient and optimized content in modern browsers using tools readily available<br><blockquote>This is a project-oriented book that simplifies setting up the skeleton of the library and adding components, using little more than a text editor or free software.</blockquote>",
            "url": "http://books.google.com/books?id=le5yzwEACAAJ&dq=JavaScript&hl=&cd=2&source=gbs_api",
            "title": "Developing Web Components with Svelte",
            "summary": "Leverage the power of Svelte to quickly produce the foundations of a framework-agnostic component library that can extend and develop over time. This is a project-oriented book that simplifies setting up the skeleton of the library and adding components, using little more than a text editor or free software. You'll gain a starting baseline that can be used to develop future projects or incorporated into an existing workflow. You'll take development to the next level and can use this knowledge to create components with any framework, such as React, Angular or Vue.js, not just Svelte. Developing Web Components with Svelte is an excellent resource for getting acquainted with creating and maintaining a component library using a phased approach. It takes the view that you don't have to create something complex and unwieldy. Instead, you can start building something quickly, then extend it as needs dictate over time, without sacrificing speed or features. You'll see how to develop cleaner components in a quick, clear and straightforward way. The components you create in this project can be made available in one of the world's most extensive component ecosystems to be usable by other frameworks, making them genuinely reusable. In short, Svelte offers plenty of opportunities as it is based on Node.js and JavaScript making Svelte a powerful package to work from. What You'll Learn Use the Svelte framework to rapidly create and deploy the foundation of a component library that is versatile and performant Review developing and customizing components based on our needs Work through a real-world project to help solidify skills learned from the book and put them into practice Who This Book Is For Website developers, familiar with JavaScript, who are keen to learn how to leverage the Svelte framework fast Agile development teams, where time is of the essence, and the pressure is on to deliver results quickly Developers who want to focus on simplicity, to produce efficient and optimized content in modern browsers using tools readily available",
            "image": "http://books.google.com/books/content?id=le5yzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2023-02-25T00:00:00.000Z"
        },
        {
            "content_html": "Mastering React Native helps the reader master the React Native framework for faster and more robust mobile app development. React Native is an open-source JavaScript framework that allows you to create applications for many platforms, including iOS, Android, and the web, all with the same code base. It is built on the React framework, and it provides all of React’s power to mobile app development. React Native was a natural continuation of React. It is a mobile framework that includes JavaScript to create near-native apps. JSX, a hybrid of JavaScript and XML-like markup, is used to make React Native applications. The React Native “bridge” then calls the native rendering APIs in Objective-C (for iOS) or Java (for Android) behind the scenes (for Android). As a result, your app will appear and feel like any other mobile app, as it will be rendered using genuine mobile UI components instead of web views. React Native also offers JavaScript interfaces for platform APIs, allowing your React Native apps to use features such as user location and the phone camera. If your app is UI focused, React Native is an excellent choice because it comes with an extensive UI library. Becoming a React Native developer gives you access to exciting, cutting-edge projects which frequently incorporate innovative technology like Augmented Reality. Job opportunities for React Native devs are aplenty, and it is undoubtedly a skill worthy of consideration owing to its popularity with startups and corporates alike. With Mastering React Native, learning React Native becomes easy and will help readers undoubtedly advance their careers. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with more than a decade of experience in the computing field.<br><blockquote>It is built on the React framework, and it provides all of React’s power to mobile app development. React Native was a natural continuation of React. It is a mobile framework that includes JavaScript to create near-native apps.</blockquote>",
            "url": "http://books.google.com/books?id=pE-VEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=3&source=gbs_api",
            "title": "Mastering React Native",
            "summary": "Mastering React Native helps the reader master the React Native framework for faster and more robust mobile app development. React Native is an open-source JavaScript framework that allows you to create applications for many platforms, including iOS, Android, and the web, all with the same code base. It is built on the React framework, and it provides all of React’s power to mobile app development. React Native was a natural continuation of React. It is a mobile framework that includes JavaScript to create near-native apps. JSX, a hybrid of JavaScript and XML-like markup, is used to make React Native applications. The React Native “bridge” then calls the native rendering APIs in Objective-C (for iOS) or Java (for Android) behind the scenes (for Android). As a result, your app will appear and feel like any other mobile app, as it will be rendered using genuine mobile UI components instead of web views. React Native also offers JavaScript interfaces for platform APIs, allowing your React Native apps to use features such as user location and the phone camera. If your app is UI focused, React Native is an excellent choice because it comes with an extensive UI library. Becoming a React Native developer gives you access to exciting, cutting-edge projects which frequently incorporate innovative technology like Augmented Reality. Job opportunities for React Native devs are aplenty, and it is undoubtedly a skill worthy of consideration owing to its popularity with startups and corporates alike. With Mastering React Native, learning React Native becomes easy and will help readers undoubtedly advance their careers. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with more than a decade of experience in the computing field.",
            "image": "http://books.google.com/books/content?id=pE-VEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-11-29T00:00:00.000Z"
        },
        {
            "content_html": "Mastering React helps the reader master the React JavaScript framework for faster and more robust front-end development. React is a JavaScript framework for creating interface design that is coherent, cheap, and customizable. It makes it possible to create complicated user interfaces out of “modules,” which are small, independent pieces of code. The primary goal of using React is the easier creation of visual interfaces. React was developed by Facebook and released to the public in 2013. It powers some of the most popular apps, including Facebook and Instagram. It uses virtual DOM (JavaScript Document Object Model), which increases the application’s performance. The virtualized DOM in JavaScript is faster than the conventional DOM. React can be used as both a standalone framework and in conjunction with other platforms. It employs component and data patterns to improve clarity while also assisting in maintaining larger applications. React saves you time and money during development because it is component-based. The design can be segmented into reusable modules that could be used to adjust interfaces dynamically. The front-end development industry has a reputation for moving at a breakneck speed. Organizations cannot be expected to modify their apps annually to catch pace with technological innovations. This is why businesses prefer React. React simplifies many things, and its ecosystem is full of valuable subframeworks and tools. React is among the most powerful front-end frameworks out there. As such, learning React development can future-proof anyone’s career in the long run, and even yield immediate benefits. This book explains the concepts of React in an easy-to-grasp language. With Mastering React, learning React becomes a charm, and readers will undoubtedly advance their careers with the help of this book. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with more than a decade of experience in the computing field.<br><blockquote>This book explains the concepts of React in an easy-to-grasp language. With Mastering React, learning React becomes a charm, and readers will undoubtedly advance their careers with the help of this book.</blockquote>",
            "url": "http://books.google.com/books?id=j_-VEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=4&source=gbs_api",
            "title": "Mastering React",
            "summary": "Mastering React helps the reader master the React JavaScript framework for faster and more robust front-end development. React is a JavaScript framework for creating interface design that is coherent, cheap, and customizable. It makes it possible to create complicated user interfaces out of “modules,” which are small, independent pieces of code. The primary goal of using React is the easier creation of visual interfaces. React was developed by Facebook and released to the public in 2013. It powers some of the most popular apps, including Facebook and Instagram. It uses virtual DOM (JavaScript Document Object Model), which increases the application’s performance. The virtualized DOM in JavaScript is faster than the conventional DOM. React can be used as both a standalone framework and in conjunction with other platforms. It employs component and data patterns to improve clarity while also assisting in maintaining larger applications. React saves you time and money during development because it is component-based. The design can be segmented into reusable modules that could be used to adjust interfaces dynamically. The front-end development industry has a reputation for moving at a breakneck speed. Organizations cannot be expected to modify their apps annually to catch pace with technological innovations. This is why businesses prefer React. React simplifies many things, and its ecosystem is full of valuable subframeworks and tools. React is among the most powerful front-end frameworks out there. As such, learning React development can future-proof anyone’s career in the long run, and even yield immediate benefits. This book explains the concepts of React in an easy-to-grasp language. With Mastering React, learning React becomes a charm, and readers will undoubtedly advance their careers with the help of this book. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with more than a decade of experience in the computing field.",
            "image": "http://books.google.com/books/content?id=j_-VEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-11-29T00:00:00.000Z"
        },
        {
            "content_html": "This book serves as a succinct guide on ReScript, a functional language for building web applications. Using examples of ReScript language features along with explanations of fundamental concepts in functional programming, this book will show web developers with a background in JavaScript how to effectively use ReScript to its full potential. In Introducing ReScript, you'll learn how to use features in ReScript that JavaScript lacks, such as type inference, null-safety, algebraic data types, pattern matching, and more. Along the way, you'll pick up functional programming concepts like immutability and higher-order functions. You'll also gain a sense of how ReScript works under the hood and how to leverage interoperability between ReScript and JavaScript. Whether you're a web developer interested in dabbling with functional programming or you just want to learn how to write safer and cleaner code for web applications, this book is a great way for you to get started with ReScript. What You Will Learn Use ReScript to write clean, safe, and elegant software Understand the features of ReScript that set it apart from JavaScript, such as type inference, null-safety, and algebraic data types Explore functional programming concepts like immutabhigher-orderr order functions, and pattern matching Use popular JavaScript libraries and frameworks in your ReScript code and integrate ReScript code into JavaScript codebases Who This Book Is For Web developers that want a strictly typed, safer alternative to JavaScript, as well as web developers interested in learning functional programming and leveraging the elegant and powerful functional features in ReScript.<br><blockquote>This book serves as a succinct guide on ReScript, a functional language for building web applications.</blockquote>",
            "url": "http://books.google.com/books?id=1ZRYzwEACAAJ&dq=JavaScript&hl=&cd=5&source=gbs_api",
            "title": "Introducing ReScript",
            "summary": "This book serves as a succinct guide on ReScript, a functional language for building web applications. Using examples of ReScript language features along with explanations of fundamental concepts in functional programming, this book will show web developers with a background in JavaScript how to effectively use ReScript to its full potential. In Introducing ReScript, you'll learn how to use features in ReScript that JavaScript lacks, such as type inference, null-safety, algebraic data types, pattern matching, and more. Along the way, you'll pick up functional programming concepts like immutability and higher-order functions. You'll also gain a sense of how ReScript works under the hood and how to leverage interoperability between ReScript and JavaScript. Whether you're a web developer interested in dabbling with functional programming or you just want to learn how to write safer and cleaner code for web applications, this book is a great way for you to get started with ReScript. What You Will Learn Use ReScript to write clean, safe, and elegant software Understand the features of ReScript that set it apart from JavaScript, such as type inference, null-safety, and algebraic data types Explore functional programming concepts like immutabhigher-orderr order functions, and pattern matching Use popular JavaScript libraries and frameworks in your ReScript code and integrate ReScript code into JavaScript codebases Who This Book Is For Web developers that want a strictly typed, safer alternative to JavaScript, as well as web developers interested in learning functional programming and leveraging the elegant and powerful functional features in ReScript.",
            "image": "http://books.google.com/books/content?id=1ZRYzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2022-12-28T00:00:00.000Z"
        },
        {
            "content_html": "Mastering Vue.js helps the reader master the Vue.js JavaScript framework for faster and more robust front-end development. Vue is a popular JavaScript front-end framework that is rapidly expanding. It is easy to use, small (less than 24 KB), and really fast. It is simple to include in other applications and libraries. Vue.js is easy to install, and beginners may quickly learn how to use it and begin creating their interface design. What makes Vue special is that it is different from most other JavaScript frameworks and libraries. Unlike other monolithic frameworks, Vue is built from the ground up to be incrementally adaptable. The core library focuses primarily on the View layer, and is easy to use and combine with other libraries or projects. On the other hand, when merged with contemporary stacks and libraries, Vue is perfectly capable of running powerful Single-Page Web Applications. Working with Vue.js can be fun. Leveraging Vue and its plugins can help one easily create excellent Internet and smartphone-compatible applications. Vue is both compact and customizable, and comes with multiple capabilities for intelligent state management and navigation choices. All said and done, learning Vue is an excellent career initiative, especially since it is rapidly gaining favor among startups and established enterprises alike. Vue is an excellent choice if you want to make a highly engaging, flexible, and data-driven app. It has an easy-to-understand layout which you can learn in minutes. Unlike Angular or React, Vue.js does not have a lot of challenges or concepts to master. It is an excellent choice for programmers looking to learn and implement new technology for their next project. With Mastering Vue.js, learning Vue becomes very straightforward, which will help readers undoubtedly advance their careers. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with over a decade of experience in the computing field.<br><blockquote>Mastering Vue.js helps the reader master the Vue.js JavaScript framework for faster and more robust front-end development. Vue is a popular JavaScript front-end framework that is rapidly expanding.</blockquote>",
            "url": "http://books.google.com/books?id=4NKLEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=6&source=gbs_api",
            "title": "Mastering Vue.js",
            "summary": "Mastering Vue.js helps the reader master the Vue.js JavaScript framework for faster and more robust front-end development. Vue is a popular JavaScript front-end framework that is rapidly expanding. It is easy to use, small (less than 24 KB), and really fast. It is simple to include in other applications and libraries. Vue.js is easy to install, and beginners may quickly learn how to use it and begin creating their interface design. What makes Vue special is that it is different from most other JavaScript frameworks and libraries. Unlike other monolithic frameworks, Vue is built from the ground up to be incrementally adaptable. The core library focuses primarily on the View layer, and is easy to use and combine with other libraries or projects. On the other hand, when merged with contemporary stacks and libraries, Vue is perfectly capable of running powerful Single-Page Web Applications. Working with Vue.js can be fun. Leveraging Vue and its plugins can help one easily create excellent Internet and smartphone-compatible applications. Vue is both compact and customizable, and comes with multiple capabilities for intelligent state management and navigation choices. All said and done, learning Vue is an excellent career initiative, especially since it is rapidly gaining favor among startups and established enterprises alike. Vue is an excellent choice if you want to make a highly engaging, flexible, and data-driven app. It has an easy-to-understand layout which you can learn in minutes. Unlike Angular or React, Vue.js does not have a lot of challenges or concepts to master. It is an excellent choice for programmers looking to learn and implement new technology for their next project. With Mastering Vue.js, learning Vue becomes very straightforward, which will help readers undoubtedly advance their careers. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with over a decade of experience in the computing field.",
            "image": "http://books.google.com/books/content?id=4NKLEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-11-11T00:00:00.000Z"
        },
        {
            "content_html": "Learn how React Native works under the hood and what this means for building large-scale, cross-platform, production-ready applications without compromising on the quality and performance Key FeaturesExplore a modern approach to React Native, covering state management, animations, gestures, and moreImplement best practices and practical techniques for creating large-scale, production-ready appsCreate a development process including workflow automation with GitHub Actions, Fastlane, and BitriseBook Description The React Native framework offers a range of powerful features that make it possible to efficiently build high-quality, easy-to-maintain frontend applications across multiple platforms such as iOS, Android, Linux, Mac OS X, Windows, and the web, helping you save both time and money. And this book is your key to unlocking its capabilities. Professional React Native provides the ultimate coverage of essential concepts, best practices, advanced processes, and tips for everyday developer problems. The book makes it easy to understand how React Native works under the hood using step-by-step explanations and practical examples so you can use this knowledge to develop highly performant apps. As you follow along, you'll learn the difference between React and React Native, navigate the React Native ecosystem, and revisit the basics of JavaScript and TypeScript needed to create a React Native application. What's more, you'll work with animations and even control your app with gestures. Finally, you'll be able to structure larger apps and improve developer efficiency through automated processes, testing, and continuous integration. By the end of this React native app development book, you'll have gained the confidence to build high-performance apps for multiple platforms, even on a bigger scale. What you will learnBecome familiar with how React Native works under the hoodUnderstand how to make the most of React Native for app developmentExplore different approaches to building apps across various platformsBecome familiar with process automation and automated testingContribute to open source code and structure your own code libraryUnderstand how to set up the architecture for bigger React Native projectsWho this book is for This book is for developers who want to get started with React Native as well as experienced React Native developers interested in building professional cross-platform applications. Familiarity with the basics of JavaScript (including its syntax) and general software engineering concepts, such as data types, control flows, and server/client structures, is required. Although useful, experience with React Native is not necessary.<br><blockquote>And this book is your key to unlocking its capabilities. Professional React Native provides the ultimate coverage of essential concepts, best practices, advanced processes, and tips for everyday developer problems.</blockquote>",
            "url": "http://books.google.com/books?id=pXuUEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=7&source=gbs_api",
            "title": "Professional React Native",
            "summary": "Learn how React Native works under the hood and what this means for building large-scale, cross-platform, production-ready applications without compromising on the quality and performance Key FeaturesExplore a modern approach to React Native, covering state management, animations, gestures, and moreImplement best practices and practical techniques for creating large-scale, production-ready appsCreate a development process including workflow automation with GitHub Actions, Fastlane, and BitriseBook Description The React Native framework offers a range of powerful features that make it possible to efficiently build high-quality, easy-to-maintain frontend applications across multiple platforms such as iOS, Android, Linux, Mac OS X, Windows, and the web, helping you save both time and money. And this book is your key to unlocking its capabilities. Professional React Native provides the ultimate coverage of essential concepts, best practices, advanced processes, and tips for everyday developer problems. The book makes it easy to understand how React Native works under the hood using step-by-step explanations and practical examples so you can use this knowledge to develop highly performant apps. As you follow along, you'll learn the difference between React and React Native, navigate the React Native ecosystem, and revisit the basics of JavaScript and TypeScript needed to create a React Native application. What's more, you'll work with animations and even control your app with gestures. Finally, you'll be able to structure larger apps and improve developer efficiency through automated processes, testing, and continuous integration. By the end of this React native app development book, you'll have gained the confidence to build high-performance apps for multiple platforms, even on a bigger scale. What you will learnBecome familiar with how React Native works under the hoodUnderstand how to make the most of React Native for app developmentExplore different approaches to building apps across various platformsBecome familiar with process automation and automated testingContribute to open source code and structure your own code libraryUnderstand how to set up the architecture for bigger React Native projectsWho this book is for This book is for developers who want to get started with React Native as well as experienced React Native developers interested in building professional cross-platform applications. Familiarity with the basics of JavaScript (including its syntax) and general software engineering concepts, such as data types, control flows, and server/client structures, is required. Although useful, experience with React Native is not necessary.",
            "image": "http://books.google.com/books/content?id=pXuUEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-10-31T00:00:00.000Z"
        },
        {
            "content_html": "Take advantage of your C# skills to build UI components and client-side experiences with .NET. With this practical guide, you'll learn how to use Blazor WebAssembly to develop next-generation web experiences. Built on top of ASP.NET Core, Blazor represents the future of .NET single-page application investments. Author David Pine, who focuses on .NET and Azure content development at Microsoft, explains how WebAssembly enables many non-JavaScript-based programming languages to run on the client browser. In this book, you'll learn about real-time web functionality with ASP.NET Core SignalR and discover strategies for bidirectional JavaScript interop. David also covers component data binding, hierarchical event-driven communications, in-memory state management, and local storage. This book shows you how to: Create a beautiful, feature-rich Blazor app Develop and localize an enterprise-scale app using GitHub Actions and Azure Cognitive Services Translator Create advanced validation scenarios for input-based components with forms Automatically deploy and host to Azure Static Web Apps, and rely on HTTP services Use a geolocation service and speech synthesis and recognition native to the browser Author a custom modal verification mechanism for validating a user<br><blockquote>This book shows you how to: Create a beautiful, feature-rich Blazor app Develop and localize an enterprise-scale app using GitHub Actions and Azure Cognitive Services Translator Create advanced validation scenarios for input-based ...</blockquote>",
            "url": "http://books.google.com/books?id=cBKMEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=8&source=gbs_api",
            "title": "Learning Blazor",
            "summary": "Take advantage of your C# skills to build UI components and client-side experiences with .NET. With this practical guide, you'll learn how to use Blazor WebAssembly to develop next-generation web experiences. Built on top of ASP.NET Core, Blazor represents the future of .NET single-page application investments. Author David Pine, who focuses on .NET and Azure content development at Microsoft, explains how WebAssembly enables many non-JavaScript-based programming languages to run on the client browser. In this book, you'll learn about real-time web functionality with ASP.NET Core SignalR and discover strategies for bidirectional JavaScript interop. David also covers component data binding, hierarchical event-driven communications, in-memory state management, and local storage. This book shows you how to: Create a beautiful, feature-rich Blazor app Develop and localize an enterprise-scale app using GitHub Actions and Azure Cognitive Services Translator Create advanced validation scenarios for input-based components with forms Automatically deploy and host to Azure Static Web Apps, and rely on HTTP services Use a geolocation service and speech synthesis and recognition native to the browser Author a custom modal verification mechanism for validating a user",
            "image": "http://books.google.com/books/content?id=cBKMEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-09-26T00:00:00.000Z"
        },
        {
            "content_html": "Node.js: Novice to Ninja is your hands-on guide to learning everything needed to build a professional web application using Node.js, the hugely popular open-source, cross-platform, back-end JavaScript runtime environment. You'll start off by getting familiar with the basics - installation and building your first apps - before moving onto more advanced concepts, including debugging, asynchronous programming, using Express.js, working with databases, deployment, and more. You'll finish by building a complete multi-player real-time quiz application. Install Node and build your first application Get started with Express.js and use it to process forms Master asynchronous programming in Node.js Work with MongoDB and MySQL databases Use WebSockets for real-time applications Understand the Node ecosystem: npm and modules Build a complete multiplayer quiz app And much more! The book includes access to 25 high quality tutorial videos, containing 1.5 hours of content.<br><blockquote>The book includes access to 25 high quality tutorial videos, containing 1.5 hours of content.</blockquote>",
            "url": "http://books.google.com/books?id=o991EAAAQBAJ&pg=PA1&dq=JavaScript&hl=&cd=9&source=gbs_api",
            "title": "Node.js: Novice to Ninja",
            "summary": "Node.js: Novice to Ninja is your hands-on guide to learning everything needed to build a professional web application using Node.js, the hugely popular open-source, cross-platform, back-end JavaScript runtime environment. You'll start off by getting familiar with the basics - installation and building your first apps - before moving onto more advanced concepts, including debugging, asynchronous programming, using Express.js, working with databases, deployment, and more. You'll finish by building a complete multi-player real-time quiz application. Install Node and build your first application Get started with Express.js and use it to process forms Master asynchronous programming in Node.js Work with MongoDB and MySQL databases Use WebSockets for real-time applications Understand the Node ecosystem: npm and modules Build a complete multiplayer quiz app And much more! The book includes access to 25 high quality tutorial videos, containing 1.5 hours of content.",
            "image": "http://books.google.com/books/content?id=o991EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-06-07T00:00:00.000Z"
        },
        {
            "content_html": "Of late, TypeScript has risen in popularity owing to its ease of use and versatile compatibility. As such, more and more developers are looking to quickly and efficiently master TypeScript. If you’re looking for a detailed, yet easy to comprehend guide to TypeScript, your search ends here! The book is a detailed guide that will help learners get started with TypeScript programming in no time. It talks about the basics and then moves on to practical exercises to help readers quickly gain the required knowledge. The book is meant for both JavaScript developers and learners without a formal JS background. Furthermore, while a background in JavaScript programming might be of help, the book requires no prior coding background and can be easily mastered even by beginners. What Will You Learn: Detailed focus on TypeScript programming Introduction to TypeScript concepts and paradigm Introduction to TS architecture and components OOP programming with TS Web development in TypeScript Who Is This Book for: Web developers looking to learn TypeScript; web development beginners; JavaScript developers; and frontend developers. About the Author Sufyan bin Uzayr is a writer, coder, and entrepreneur with more than a decade of experience in the industry. He has authored several books in the past, pertaining to a diverse range of topics, ranging from History to Computers/IT. Sufyan is the Director of Parakozm, a multinational IT company specializing in EdTech solutions. He also runs Zeba Academy, an online learning and teaching vertical with a focus on STEM fields. Sufyan specializes in a wide variety of technologies, such as JavaScript, Dart, WordPress, Drupal, Linux, and Python. He holds multiple degrees, including ones in Management, IT, Literature, and Political Science. Sufyan is a digital nomad, dividing his time between four countries. He has lived and taught in universities and educational institutions around the globe. Sufyan takes a keen interest in technology, politics, literature, history, and sports, and in his spare time, he enjoys teaching coding and English to young students. Learn more at sufyanism.com<br><blockquote>What Will You Learn: Detailed focus on TypeScript programming Introduction to TypeScript concepts and paradigm Introduction to TS architecture and components OOP programming with TS Web development in TypeScript Who Is This Book for: Web ...</blockquote>",
            "url": "http://books.google.com/books?id=P-lZEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=10&source=gbs_api",
            "title": "TypeScript for Beginners",
            "summary": "Of late, TypeScript has risen in popularity owing to its ease of use and versatile compatibility. As such, more and more developers are looking to quickly and efficiently master TypeScript. If you’re looking for a detailed, yet easy to comprehend guide to TypeScript, your search ends here! The book is a detailed guide that will help learners get started with TypeScript programming in no time. It talks about the basics and then moves on to practical exercises to help readers quickly gain the required knowledge. The book is meant for both JavaScript developers and learners without a formal JS background. Furthermore, while a background in JavaScript programming might be of help, the book requires no prior coding background and can be easily mastered even by beginners. What Will You Learn: Detailed focus on TypeScript programming Introduction to TypeScript concepts and paradigm Introduction to TS architecture and components OOP programming with TS Web development in TypeScript Who Is This Book for: Web developers looking to learn TypeScript; web development beginners; JavaScript developers; and frontend developers. About the Author Sufyan bin Uzayr is a writer, coder, and entrepreneur with more than a decade of experience in the industry. He has authored several books in the past, pertaining to a diverse range of topics, ranging from History to Computers/IT. Sufyan is the Director of Parakozm, a multinational IT company specializing in EdTech solutions. He also runs Zeba Academy, an online learning and teaching vertical with a focus on STEM fields. Sufyan specializes in a wide variety of technologies, such as JavaScript, Dart, WordPress, Drupal, Linux, and Python. He holds multiple degrees, including ones in Management, IT, Literature, and Political Science. Sufyan is a digital nomad, dividing his time between four countries. He has lived and taught in universities and educational institutions around the globe. Sufyan takes a keen interest in technology, politics, literature, history, and sports, and in his spare time, he enjoys teaching coding and English to young students. Learn more at sufyanism.com",
            "image": "http://books.google.com/books/content?id=P-lZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-03-23T00:00:00.000Z"
        }
    ]
}