{
    "version": "https://jsonfeed.org/version/1",
    "title": "JavaScript(en) on Google Book",
    "home_page_url": "https://azu.github.io/book-rss/JavaScript-en.json",
    "description": "JavaScript(en) on Google Book",
    "items": [
        {
            "content_html": "Learn PHP, the programming language used to build sites like Facebook, Wikipedia and WordPress, then discover how these sites store information in a database (MySQL) and use the database to create the web pages. This full-color book is packed with inspiring code examples, infographics and photography that not only teach you the PHP language and how to work with databases, but also show you how to build new applications from scratch. It demonstrates practical techniques that you will recognize from popular sites where visitors can: Register as a member and log in Create articles, posts and profiles that are saved in a database Upload their own images and files Automatically receive email notifications Like and comment on posts To show you how to apply the skills you learn, you will build a complete content management system, enhanced with features that are commonly seen on social networks. Written by best-selling HTML & CSS and JavaScript & jQuery author Jon Duckett, this book uses a unique visual approach, with step-by-step instructions, practical code examples and pro tips that will teach you how to build modern database-driven websites using PHP.<br><blockquote>The simple, visual explanations and bite-size code examples in this book will make it easy for you to develop websites using PHP &amp; MySQL that allow visitors to register as members, create and edit articles, upload images, manage profiles, ...</blockquote>",
            "url": "http://books.google.com/books?id=Z4ShuQEACAAJ&dq=JavaScript&hl=&cd=1&source=gbs_api",
            "title": "PHP & MySQL",
            "summary": "Learn PHP, the programming language used to build sites like Facebook, Wikipedia and WordPress, then discover how these sites store information in a database (MySQL) and use the database to create the web pages. This full-color book is packed with inspiring code examples, infographics and photography that not only teach you the PHP language and how to work with databases, but also show you how to build new applications from scratch. It demonstrates practical techniques that you will recognize from popular sites where visitors can: Register as a member and log in Create articles, posts and profiles that are saved in a database Upload their own images and files Automatically receive email notifications Like and comment on posts To show you how to apply the skills you learn, you will build a complete content management system, enhanced with features that are commonly seen on social networks. Written by best-selling HTML & CSS and JavaScript & jQuery author Jon Duckett, this book uses a unique visual approach, with step-by-step instructions, practical code examples and pro tips that will teach you how to build modern database-driven websites using PHP.",
            "image": "http://books.google.com/books/content?id=Z4ShuQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2018-10-30T00:00:00.000Z"
        },
        {
            "content_html": "Discover blueprints that explore various components of Blazor, C#, and .NET to help you build web apps without learning JavaScript Key FeaturesExplore complete, easy-to-follow web projects using BlazorBuild projects such as a weather app, expense tracker, and Kanban board with real-world applicationsUnderstand and work with Blazor WebAssembly effectively without spending too much time focusing on the theoryBook Description Blazor WebAssembly makes it possible to run C# code on the browser instead of having to use JavaScript, and does not rely on plugins or add-ons. The only technical requirement for using Blazor WebAssembly is a browser that supports WebAssembly, which, as of today, all modern browsers do. Blazor WebAssembly by Example is a project-based guide for learning how to build single-page web applications using the Blazor WebAssembly framework. This book emphasizes the practical over the theoretical by providing detailed step-by-step instructions for each project. You'll start by building simple standalone web applications and progress to developing more advanced hosted web applications with SQL Server backends. Each project covers a different aspect of the Blazor WebAssembly ecosystem, such as Razor components, JavaScript interop, event handling, application state, and dependency injection. The book is designed in such a way that you can complete the projects in any order. By the end of this book, you will have experience building a wide variety of single-page web applications with .NET, Blazor WebAssembly, and C#. What you will learnDiscover the power of the C# language for both server-side and client-side web developmentUse the Blazor WebAssembly App project template to build your first Blazor WebAssembly applicationUse templated components and the Razor class library to build and share a modal dialog boxUnderstand how to use JavaScript with Blazor WebAssemblyBuild a progressive web app (PWA) to enable native app-like performance and speedUnderstand dependency injection (DI) in .NET to build a shopping cart appGet to grips with .NET Web APIs by building a task manager appWho this book is for This book is for .NET web developers who are tired of constantly learning new JavaScript frameworks and wish to write web applications using Blazor WebAssembly, leveraging the power of .NET and C#. The book assumes beginner-level knowledge of the C# language, .NET framework, Microsoft Visual Studio, and web development concepts.<br><blockquote>By the end of this book, you will have experience building a wide variety of single-page web applications with .NET, Blazor WebAssembly, and C#. What you will learnDiscover the power of the C# language for both server-side and client-side ...</blockquote>",
            "url": "http://books.google.com/books?id=Ly0zEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=2&source=gbs_api",
            "title": "Blazor WebAssembly by Example",
            "summary": "Discover blueprints that explore various components of Blazor, C#, and .NET to help you build web apps without learning JavaScript Key FeaturesExplore complete, easy-to-follow web projects using BlazorBuild projects such as a weather app, expense tracker, and Kanban board with real-world applicationsUnderstand and work with Blazor WebAssembly effectively without spending too much time focusing on the theoryBook Description Blazor WebAssembly makes it possible to run C# code on the browser instead of having to use JavaScript, and does not rely on plugins or add-ons. The only technical requirement for using Blazor WebAssembly is a browser that supports WebAssembly, which, as of today, all modern browsers do. Blazor WebAssembly by Example is a project-based guide for learning how to build single-page web applications using the Blazor WebAssembly framework. This book emphasizes the practical over the theoretical by providing detailed step-by-step instructions for each project. You'll start by building simple standalone web applications and progress to developing more advanced hosted web applications with SQL Server backends. Each project covers a different aspect of the Blazor WebAssembly ecosystem, such as Razor components, JavaScript interop, event handling, application state, and dependency injection. The book is designed in such a way that you can complete the projects in any order. By the end of this book, you will have experience building a wide variety of single-page web applications with .NET, Blazor WebAssembly, and C#. What you will learnDiscover the power of the C# language for both server-side and client-side web developmentUse the Blazor WebAssembly App project template to build your first Blazor WebAssembly applicationUse templated components and the Razor class library to build and share a modal dialog boxUnderstand how to use JavaScript with Blazor WebAssemblyBuild a progressive web app (PWA) to enable native app-like performance and speedUnderstand dependency injection (DI) in .NET to build a shopping cart appGet to grips with .NET Web APIs by building a task manager appWho this book is for This book is for .NET web developers who are tired of constantly learning new JavaScript frameworks and wish to write web applications using Blazor WebAssembly, leveraging the power of .NET and C#. The book assumes beginner-level knowledge of the C# language, .NET framework, Microsoft Visual Studio, and web development concepts.",
            "image": "http://books.google.com/books/content?id=Ly0zEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-07-09T00:00:00.000Z"
        },
        {
            "content_html": "Learn to use JavaScript, the popular scripting language that allows web page authors to develop interactive web pages and sites. Carey/Vodnik's JAVASCRIPT FOR WEB WARRIORS, Seventh Edition introduces a variety of techniques that focus on what you need to know to begin using JavaScript right away. Step-by-step tasks within each chapter focus on particular techniques essential for building actual JavaScript programs. Guided activities reinforce skills and build in complexity as you progress. You also study debugging techniques. This edition's text is embedding with JavaScript coding exercises that let you read and immediately practice to strengthen your understanding of new programming concepts and their applications. Learning objectives, summaries, review and key terms highlight major concepts while reinforcement exercises let you further practice new techniques. After completing this course, you will able to use JavaScript to build professional quality web applications. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.<br><blockquote>You also study debugging techniques. This edition&#39;s text is embedding with JavaScript coding exercises that let you read and immediately practice to strengthen your understanding of new programming concepts and their applications.</blockquote>",
            "url": "http://books.google.com/books?id=Iwk1EAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=3&source=gbs_api",
            "title": "JavaScript for Web Warriors",
            "summary": "Learn to use JavaScript, the popular scripting language that allows web page authors to develop interactive web pages and sites. Carey/Vodnik's JAVASCRIPT FOR WEB WARRIORS, Seventh Edition introduces a variety of techniques that focus on what you need to know to begin using JavaScript right away. Step-by-step tasks within each chapter focus on particular techniques essential for building actual JavaScript programs. Guided activities reinforce skills and build in complexity as you progress. You also study debugging techniques. This edition's text is embedding with JavaScript coding exercises that let you read and immediately practice to strengthen your understanding of new programming concepts and their applications. Learning objectives, summaries, review and key terms highlight major concepts while reinforcement exercises let you further practice new techniques. After completing this course, you will able to use JavaScript to build professional quality web applications. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.",
            "image": "http://books.google.com/books/content?id=Iwk1EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-07-06T00:00:00.000Z"
        },
        {
            "content_html": "ABOUT THE BOOK Gain the knowledge you need to navigate your way confidently through the ever-expanding landscape of modern JavaScript technologies. With more than 100 Node.js frameworks available and the number rising every month, it is becoming increasingly difficult to avoid JavaScript fatigue and keep abreast of the developments that are most useful and relevant to your own projects. In such a saturated environment, the knowledge of exactly which tools will best fit your goals is invaluable. This book will guide you through the quagmire by clearly and comprehensively outlining the most practically useful Node frameworks, libraries, and tools, as well as how they might be employed in your own projects. You will learn about JavaScript frameworks, including such as Polymer, Webix, Aurelia, Svelte, and Meteor. This book will empower you to cut through the noise and learn how to achieve your career goals with the right tools meant especially for you. WHAT WILL YOU LEARN The what, why and how behind a variety of JavaScript Node frameworks, including Polymer, Aurelia, and Svelte How to choose the right Node framework for different types of projects How to ensure server-side optimization is done correctly, even if you are not a server admin Guide to such JS tools as Gulp, Grunt, and npm WHO IS THIS BOOK FOR Web developers looking to learn JavaScript; web development beginners; JavaScript developers; and frontend developers.<br><blockquote>This book will guide you through the quagmire by clearly and comprehensively outlining the most practically useful Node frameworks, libraries, and tools, as well as how they might be employed in your own projects.</blockquote>",
            "url": "http://books.google.com/books?id=1E--zgEACAAJ&dq=JavaScript&hl=&cd=4&source=gbs_api",
            "title": "Getting the Most Out of Node. Js Frameworks",
            "summary": "ABOUT THE BOOK Gain the knowledge you need to navigate your way confidently through the ever-expanding landscape of modern JavaScript technologies. With more than 100 Node.js frameworks available and the number rising every month, it is becoming increasingly difficult to avoid JavaScript fatigue and keep abreast of the developments that are most useful and relevant to your own projects. In such a saturated environment, the knowledge of exactly which tools will best fit your goals is invaluable. This book will guide you through the quagmire by clearly and comprehensively outlining the most practically useful Node frameworks, libraries, and tools, as well as how they might be employed in your own projects. You will learn about JavaScript frameworks, including such as Polymer, Webix, Aurelia, Svelte, and Meteor. This book will empower you to cut through the noise and learn how to achieve your career goals with the right tools meant especially for you. WHAT WILL YOU LEARN The what, why and how behind a variety of JavaScript Node frameworks, including Polymer, Aurelia, and Svelte How to choose the right Node framework for different types of projects How to ensure server-side optimization is done correctly, even if you are not a server admin Guide to such JS tools as Gulp, Grunt, and npm WHO IS THIS BOOK FOR Web developers looking to learn JavaScript; web development beginners; JavaScript developers; and frontend developers.",
            "image": "http://books.google.com/books/content?id=1E--zgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2022-01-01T00:00:00.000Z"
        },
        {
            "content_html": "Got basic programming skills but are new to JavaScript? Ready to pitch in and save humanity from the zombie hordes? Now you can do both at the same time. You’ll learn how to work with JavaScript objects, creating and setting properties, defining and using methods and the way objects are used in the Document Object Model (DOM). All while kicking serious zombie tuchus. Speaking of the DOM you’ll become comfortable working with it, selecting elements out of it, creating elements and adding them to it and removing any apocalyptic elements that might slip through. Once you have all that under your post-apocalyptic utility belt you’ll then be introduced to events, event handlers and how to utilize them. By the end of this book you should be ready to manipulate a web page into post-apocalyptic submission (which is like normal submission except it’s, you know, like, after the apocalypse). How You'll Learn to Smack Zombies Around You won't just passively take in the view, like a zombie shuffling across the mainland. You’ll have plenty of combat practice with analogies, examples, and code tutorials you can build, break and fix again. Working with your hands and your head you’ll craft code that pleases the eye and knocks a zombie into last Tuesday. All the code and directions are provided as both codepen tutorials and downloadable html files, so you can fight the apocalypse how and where you like. You can work with them on the codepen site or on your own device. And later you'll bring those skills together in a final project that cements those skills into zombie smashing muscle memory. Why Zombies? Are zombies just a gimmick? Why would this be any better than a straight laced book that sticks to the facts? Straight laced books are often straight boring. And if you have insomnia problems go buy that book. The author, John, has read the boring books and knows that staying awake and engaged are also important for learning. But this book uses zombie references and analogies not just to make you smile, but to help the material stick. If a tough technical concept is related in silly terms you understand, like a zombie trying to buy gum at a super market, it’s much more likely to stay in that brain those zombies are intent on eating.<br><blockquote>The author, John, has read the boring books and knows that staying awake and engaged are also important for learning. But this book uses zombie references and analogies not just to make you smile, but to help the material stick.</blockquote>",
            "url": "http://books.google.com/books?id=QhErEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=5&source=gbs_api",
            "title": "JavaScript Basics",
            "summary": "Got basic programming skills but are new to JavaScript? Ready to pitch in and save humanity from the zombie hordes? Now you can do both at the same time. You’ll learn how to work with JavaScript objects, creating and setting properties, defining and using methods and the way objects are used in the Document Object Model (DOM). All while kicking serious zombie tuchus. Speaking of the DOM you’ll become comfortable working with it, selecting elements out of it, creating elements and adding them to it and removing any apocalyptic elements that might slip through. Once you have all that under your post-apocalyptic utility belt you’ll then be introduced to events, event handlers and how to utilize them. By the end of this book you should be ready to manipulate a web page into post-apocalyptic submission (which is like normal submission except it’s, you know, like, after the apocalypse). How You'll Learn to Smack Zombies Around You won't just passively take in the view, like a zombie shuffling across the mainland. You’ll have plenty of combat practice with analogies, examples, and code tutorials you can build, break and fix again. Working with your hands and your head you’ll craft code that pleases the eye and knocks a zombie into last Tuesday. All the code and directions are provided as both codepen tutorials and downloadable html files, so you can fight the apocalypse how and where you like. You can work with them on the codepen site or on your own device. And later you'll bring those skills together in a final project that cements those skills into zombie smashing muscle memory. Why Zombies? Are zombies just a gimmick? Why would this be any better than a straight laced book that sticks to the facts? Straight laced books are often straight boring. And if you have insomnia problems go buy that book. The author, John, has read the boring books and knows that staying awake and engaged are also important for learning. But this book uses zombie references and analogies not just to make you smile, but to help the material stick. If a tough technical concept is related in silly terms you understand, like a zombie trying to buy gum at a super market, it’s much more likely to stay in that brain those zombies are intent on eating.",
            "image": "http://books.google.com/books/content?id=QhErEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-05-01T00:00:00.000Z"
        },
        {
            "content_html": "Learn to use JavaScript, the popular scripting language that allows web page authors to develop interactive web pages and sites. Carey/Vodnik's JAVASCRIPT FOR WEB WARRIORS, Seventh Edition introduces a variety of techniques that focus on what you need to know to begin using JavaScript right away. Step-by-step tasks within each chapter highlight particular techniques essential for building actual JavaScript programs. Guided activities reinforce skills and build in complexity as you progress. You also study debugging techniques. Using accompanying MindTap digital resources, you read and immediately practice with embedded JavaScript coding exercises in an authentic integrated development environment (IDE). Learning objectives, summaries, review and key terms highlight major concepts while reinforcement exercises let you further practice new techniques. After completing your course, you will able to use JavaScript to build professional quality web applications.<br><blockquote>Carey/Vodnik&#39;s JAVASCRIPT FOR WEB WARRIORS, Seventh Edition introduces a variety of techniques that focus on what you need to know to begin using JavaScript right away.</blockquote>",
            "url": "http://books.google.com/books?id=SVlIzgEACAAJ&dq=JavaScript&hl=&cd=6&source=gbs_api",
            "title": "JavaScript for Web Warriors",
            "summary": "Learn to use JavaScript, the popular scripting language that allows web page authors to develop interactive web pages and sites. Carey/Vodnik's JAVASCRIPT FOR WEB WARRIORS, Seventh Edition introduces a variety of techniques that focus on what you need to know to begin using JavaScript right away. Step-by-step tasks within each chapter highlight particular techniques essential for building actual JavaScript programs. Guided activities reinforce skills and build in complexity as you progress. You also study debugging techniques. Using accompanying MindTap digital resources, you read and immediately practice with embedded JavaScript coding exercises in an authentic integrated development environment (IDE). Learning objectives, summaries, review and key terms highlight major concepts while reinforcement exercises let you further practice new techniques. After completing your course, you will able to use JavaScript to build professional quality web applications.",
            "image": "http://books.google.com/books/content?id=SVlIzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2021-08-18T00:00:00.000Z"
        },
        {
            "content_html": "Do you want to learn JavaScript? Do you want to find out how does Javascript work? Do you want to exploit what JavaScript programming offers? Quite frankly, JavaScript is vital in web development. Furthermore, due to the increasing user bases of current development frameworks, its popularity has grown. If you're new to JavaScript and don't need a detailed guide, this book is worth looking at. Learn how to use JavaScript Visually uses a creative, visual approach to help beginners understand simple concepts. It's a short book, so it's a good weekend read for somebody who's just starting up with JavaScript. Picking up a 1,000-page book with nothing but boring text inside is more miserable, frustrating, and discouraging for a new coder. Not only is the presentation appealing, but it is also organized well. It layers logically and adequately progresses to the advanced concepts. It isn't a JavaScript book in the traditional sense. It's an introduction to programming that uses JavaScript, as the title suggests. It's excellent for this reason. A student who does not understand how to write a JavaScript program is widespread. It's common to come across a developer who can code JavaScript but has no background in computer science. Java Script Programming will help develop a strong computer science base (its prime purpose). Here's what you're going to discover in the pages of JAVASCRIPT PROGRAMMING: Basics of Javascript Working of Javascript Basic rules and practical applications Make your Javascript program Mistakes to avoid with Javascript ...and more! So what are you waiting for? Get this book now and start your journey to learning JavaScript<br><blockquote>So what are you waiting for? Get this book now and start your journey to learning JavaScript</blockquote>",
            "url": "http://books.google.com/books?id=A4uBzgEACAAJ&dq=JavaScript&hl=&cd=7&source=gbs_api",
            "title": "JavaScript Programming for Beginners",
            "summary": "Do you want to learn JavaScript? Do you want to find out how does Javascript work? Do you want to exploit what JavaScript programming offers? Quite frankly, JavaScript is vital in web development. Furthermore, due to the increasing user bases of current development frameworks, its popularity has grown. If you're new to JavaScript and don't need a detailed guide, this book is worth looking at. Learn how to use JavaScript Visually uses a creative, visual approach to help beginners understand simple concepts. It's a short book, so it's a good weekend read for somebody who's just starting up with JavaScript. Picking up a 1,000-page book with nothing but boring text inside is more miserable, frustrating, and discouraging for a new coder. Not only is the presentation appealing, but it is also organized well. It layers logically and adequately progresses to the advanced concepts. It isn't a JavaScript book in the traditional sense. It's an introduction to programming that uses JavaScript, as the title suggests. It's excellent for this reason. A student who does not understand how to write a JavaScript program is widespread. It's common to come across a developer who can code JavaScript but has no background in computer science. Java Script Programming will help develop a strong computer science base (its prime purpose). Here's what you're going to discover in the pages of JAVASCRIPT PROGRAMMING: Basics of Javascript Working of Javascript Basic rules and practical applications Make your Javascript program Mistakes to avoid with Javascript ...and more! So what are you waiting for? Get this book now and start your journey to learning JavaScript",
            "image": "http://books.google.com/books/content?id=A4uBzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2021-06-04T00:00:00.000Z"
        },
        {
            "content_html": "Create responsive front-end web applications in Python using the React and Material-UI JavaScript libraries, without having to program in JavaScript, by using the Transcrypt transpiler that turns your Python code into JavaScript.<br><blockquote>Create responsive front-end web applications in Python using the React and Material-UI JavaScript libraries, without having to program in JavaScript, by using the Transcrypt transpiler that turns your Python code into JavaScript.</blockquote>",
            "url": "http://books.google.com/books?id=EnplzgEACAAJ&dq=JavaScript&hl=&cd=8&source=gbs_api",
            "title": "React to Python",
            "summary": "Create responsive front-end web applications in Python using the React and Material-UI JavaScript libraries, without having to program in JavaScript, by using the Transcrypt transpiler that turns your Python code into JavaScript.",
            "image": "http://books.google.com/books/content?id=EnplzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2021-05-01T00:00:00.000Z"
        },
        {
            "content_html": "55 % discount for bookstores ! Now At $49.99 instead of $ 77.48 $ Your customers will never stop reading this guide !!! C++ C++ is an object orientated computer language created by remarkable computer scientist Bjarne Stroustrup as a part of the evolution of the C family of languages. A few call C++ \"C with Classes\" because it introduces object orientated programming principles, including using defined classes, to C program language period framework. C++ is stated \"see-plus-plus.\" In object orientated programming, an object is a facts kind that has each records and capabilities inherent in its design. Previous to the arrival of object orientated programming, programmers or users usually noticed a codebase as composed of individual command line commands. The identity of objects with functions and data constructed in brought about a brand-new way of packaging and automating code work. JAVASCRIPT Understanding degree is a significant piece of learning any programming language. The presentation of let aligns JavaScript with most other current dialects. While JavaScript isn't the main language to help terminations, it is one of the first mainstream (nonacademic) dialects to do as such. The JavaScript people group has utilized terminations to incredible impact, and it's a significant piece of current JavaScript improvement. There's a great deal of force and adaptability incorporated into the JavaScript's Array class, yet it can once in a while be overwhelming to know which technique to utilize when. Article arranged writing computer programs is a hugely well-known worldview, and for great reason. PYTHON applications in a wide assortment of areas. It is free, convenient, amazing, and astoundingly simple and amusing to utilize. Developers from each edge of the product business have discovered Python's attention on designer efficiency and programming quality to be an essential benefit in projects both enormous and little. html HTML is changing so quick it's practically difficult to stay aware of improvements. XHTML is HTML 4.0 revised in XML; it gives the exactness of XML while holding the adaptability of HTML. HTML and XHTML: The Definitive Guide, fourth Edition, unites everything. It's the most exhaustive book accessible on HTML and XHTML today. It covers Netscape Navigator 6.0, Internet Explorer 5.0, HTML 4.01, XHTML 1.0, JavaScript, Style sheets, Layers, and the entirety of the highlights upheld by the mainstream internet browsers. SQL The truth is: SQL is an abbreviation for Structured Query Language. It is one of the most sought after and simple programming languages of our age. SQL is lost behind a crowd of other, more popular programming languages such as C++, Python, Java etc. There are many people who have used SQL and discarded its legitimacy as a programming language simply because of its user friendly interface and a limited number of functions. However, all true computer wiz's must know that no matter how developed and advanced third level programming languages such as C++ and Python are, it doesn't change the fact that SQL is also a programming language - a very resourceful one at that. Buy it Now and let your customers get addicted to this amazing book !!!<br><blockquote>HTML and XHTML: The Definitive Guide, fourth Edition, unites everything. It&#39;s the most exhaustive book accessible on HTML and XHTML today.</blockquote>",
            "url": "http://books.google.com/books?id=mmNtzgEACAAJ&dq=JavaScript&hl=&cd=9&source=gbs_api",
            "title": "Computer Programming ( Edition 4 )",
            "summary": "55 % discount for bookstores ! Now At $49.99 instead of $ 77.48 $ Your customers will never stop reading this guide !!! C++ C++ is an object orientated computer language created by remarkable computer scientist Bjarne Stroustrup as a part of the evolution of the C family of languages. A few call C++ \"C with Classes\" because it introduces object orientated programming principles, including using defined classes, to C program language period framework. C++ is stated \"see-plus-plus.\" In object orientated programming, an object is a facts kind that has each records and capabilities inherent in its design. Previous to the arrival of object orientated programming, programmers or users usually noticed a codebase as composed of individual command line commands. The identity of objects with functions and data constructed in brought about a brand-new way of packaging and automating code work. JAVASCRIPT Understanding degree is a significant piece of learning any programming language. The presentation of let aligns JavaScript with most other current dialects. While JavaScript isn't the main language to help terminations, it is one of the first mainstream (nonacademic) dialects to do as such. The JavaScript people group has utilized terminations to incredible impact, and it's a significant piece of current JavaScript improvement. There's a great deal of force and adaptability incorporated into the JavaScript's Array class, yet it can once in a while be overwhelming to know which technique to utilize when. Article arranged writing computer programs is a hugely well-known worldview, and for great reason. PYTHON applications in a wide assortment of areas. It is free, convenient, amazing, and astoundingly simple and amusing to utilize. Developers from each edge of the product business have discovered Python's attention on designer efficiency and programming quality to be an essential benefit in projects both enormous and little. html HTML is changing so quick it's practically difficult to stay aware of improvements. XHTML is HTML 4.0 revised in XML; it gives the exactness of XML while holding the adaptability of HTML. HTML and XHTML: The Definitive Guide, fourth Edition, unites everything. It's the most exhaustive book accessible on HTML and XHTML today. It covers Netscape Navigator 6.0, Internet Explorer 5.0, HTML 4.01, XHTML 1.0, JavaScript, Style sheets, Layers, and the entirety of the highlights upheld by the mainstream internet browsers. SQL The truth is: SQL is an abbreviation for Structured Query Language. It is one of the most sought after and simple programming languages of our age. SQL is lost behind a crowd of other, more popular programming languages such as C++, Python, Java etc. There are many people who have used SQL and discarded its legitimacy as a programming language simply because of its user friendly interface and a limited number of functions. However, all true computer wiz's must know that no matter how developed and advanced third level programming languages such as C++ and Python are, it doesn't change the fact that SQL is also a programming language - a very resourceful one at that. Buy it Now and let your customers get addicted to this amazing book !!!",
            "image": "http://books.google.com/books/content?id=mmNtzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2021-04-27T00:00:00.000Z"
        },
        {
            "content_html": "Learn to create fully functional web applications with authentication, content management systems, payment processing, RESTful APIs, and more Key Features Implement advanced functionalities, such as full-text search engines, user activity streams, payment gateways, and recommendation engines Integrate JavaScript, PostgreSQL, Redis, Celery, and Memcached into your applications Add real-time features with Django Channels and WebSockets Book Description Django 4 By Example is the 4th edition of the best-selling franchise that helps you build web apps. This book will walk you through the creation of real-world applications, solving common problems, and implementing best practices using a step-by-step approach. You'll cover a wide range of web app development topics as you build four different apps: A blog application: Create data models, views, and URLs and implement an admin site for your blog. Create sitemaps and RSS feeds and implement a full-text search engine with PostgreSQL. A social website: Implement authentication with Facebook, Twitter, and Google. Create user profiles, image thumbnails, a bookmarklet, and an activity stream. Implement a user follower system and add infinite scroll pagination to your website. An e-commerce application: Build a product catalog, a shopping cart, and asynchronous tasks with Celery and RabbitMQ. Process payments with Stripe and manage payment notifications via webhooks. Build a product recommendation engine with Redis. Create PDF invoices and export orders to CSV. An e-learning platform: Create a content management system to manage polymorphic content. Cache content with Memcached and Redis. Build and consume a RESTful API. Implement a real-time chat using WebSockets with ASGI. Create a production environment using NGINX, uWSGI and Daphne with Docker Compose. This is a practical book that will have you creating web apps quickly. What you will learn Learn Django essentials, including models, ORM, views, templates, URLs, forms, authentication, signals and middleware Implement different modules of the Django framework to solve specific problems Integrate third-party Django applications into your project Build asynchronous (ASGI) applications with Django Set up a production environment for your projects Easily create complex web applications to solve real use cases Who this book is for This book is for readers with basic Python knowledge and programmers transitioning from other web frameworks who wish to learn Django by doing. If you already use Django or have in the past, and want to learn best practices and integrate other technologies to scale your applications, then this book is for you too. This book will help you master the most relevant areas of the framework by building practical projects from scratch. Some previous knowledge of HTML and JavaScript is assumed.<br><blockquote>addEventListener(&#39;DOMContentLoaded&#39;, (event) =&gt; { // DOM loaded {% block domready %} {% endblock %} }) &lt;/script&gt; &lt;/body&gt; &lt;/html&gt; We have added a &lt;script&gt; tag to include <b>JavaScript</b> code. The document.addEventListener() method is used to&nbsp;...</blockquote>",
            "url": "http://books.google.com/books?id=GLaEEAAAQBAJ&pg=PA270&dq=JavaScript&hl=&cd=10&source=gbs_api",
            "title": "Django 4 By Example",
            "summary": "Learn to create fully functional web applications with authentication, content management systems, payment processing, RESTful APIs, and more Key Features Implement advanced functionalities, such as full-text search engines, user activity streams, payment gateways, and recommendation engines Integrate JavaScript, PostgreSQL, Redis, Celery, and Memcached into your applications Add real-time features with Django Channels and WebSockets Book Description Django 4 By Example is the 4th edition of the best-selling franchise that helps you build web apps. This book will walk you through the creation of real-world applications, solving common problems, and implementing best practices using a step-by-step approach. You'll cover a wide range of web app development topics as you build four different apps: A blog application: Create data models, views, and URLs and implement an admin site for your blog. Create sitemaps and RSS feeds and implement a full-text search engine with PostgreSQL. A social website: Implement authentication with Facebook, Twitter, and Google. Create user profiles, image thumbnails, a bookmarklet, and an activity stream. Implement a user follower system and add infinite scroll pagination to your website. An e-commerce application: Build a product catalog, a shopping cart, and asynchronous tasks with Celery and RabbitMQ. Process payments with Stripe and manage payment notifications via webhooks. Build a product recommendation engine with Redis. Create PDF invoices and export orders to CSV. An e-learning platform: Create a content management system to manage polymorphic content. Cache content with Memcached and Redis. Build and consume a RESTful API. Implement a real-time chat using WebSockets with ASGI. Create a production environment using NGINX, uWSGI and Daphne with Docker Compose. This is a practical book that will have you creating web apps quickly. What you will learn Learn Django essentials, including models, ORM, views, templates, URLs, forms, authentication, signals and middleware Implement different modules of the Django framework to solve specific problems Integrate third-party Django applications into your project Build asynchronous (ASGI) applications with Django Set up a production environment for your projects Easily create complex web applications to solve real use cases Who this book is for This book is for readers with basic Python knowledge and programmers transitioning from other web frameworks who wish to learn Django by doing. If you already use Django or have in the past, and want to learn best practices and integrate other technologies to scale your applications, then this book is for you too. This book will help you master the most relevant areas of the framework by building practical projects from scratch. Some previous knowledge of HTML and JavaScript is assumed.",
            "image": "http://books.google.com/books/content?id=GLaEEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-08-29T00:00:00.000Z"
        }
    ]
}