{
    "version": "https://jsonfeed.org/version/1",
    "title": "JavaScript(en) on Google Book",
    "home_page_url": "https://azu.github.io/book-rss/JavaScript-en.json",
    "description": "JavaScript(en) on Google Book",
    "items": [
        {
            "content_html": "A hands-on, beginner-friendly approach to developing complete web applications from the ground up, using JavaScript and its most popular frameworks, including Node.js and React.js. This book is an easy, hands-on introduction to the creation of web applications from the ground up. Each chapter covers a particular part of an application, introducing you to modern techniques and architectural patterns for achieving it—with a practical focus on the most popular tools, libraries, and frameworks used by today’s full-stack developers. You’ll learn to build an entire application from start to finish, from creating a Node.js server, to developing a front-end interface with React.js components and Next.js pages. You’ll then expand your web application by writing REST and GraphQL APIs, implementing middleware, and connecting your application to a MongoDB database on the back end. Finally, you’ll learn how to add OAuth authorization to your application, write automated tests with Jest, and deploy your project as microservices using Docker. You’ll learn: Contemporary best practices, like the use of a microservice architecture and test-driven development techniques Essential concepts of the tools, frameworks, and full-stack technologies, and how to use them Steps for creating a full-stack web application—from React.js components on the front end, to GraphQL APIs in the middleware and the MongoDB database on the back end How to add OAuth authorization to integrate login with GitHub and write automated tests with Jest<br><blockquote>This book is an easy, hands-on introduction to the creation of web applications from the ground up.</blockquote>",
            "url": "http://books.google.com/books?id=TWy1EAAAQBAJ&dq=JavaScript&hl=&cd=1&source=gbs_api",
            "title": "Modern Full Stack Development",
            "summary": "A hands-on, beginner-friendly approach to developing complete web applications from the ground up, using JavaScript and its most popular frameworks, including Node.js and React.js. This book is an easy, hands-on introduction to the creation of web applications from the ground up. Each chapter covers a particular part of an application, introducing you to modern techniques and architectural patterns for achieving it—with a practical focus on the most popular tools, libraries, and frameworks used by today’s full-stack developers. You’ll learn to build an entire application from start to finish, from creating a Node.js server, to developing a front-end interface with React.js components and Next.js pages. You’ll then expand your web application by writing REST and GraphQL APIs, implementing middleware, and connecting your application to a MongoDB database on the back end. Finally, you’ll learn how to add OAuth authorization to your application, write automated tests with Jest, and deploy your project as microservices using Docker. You’ll learn: Contemporary best practices, like the use of a microservice architecture and test-driven development techniques Essential concepts of the tools, frameworks, and full-stack technologies, and how to use them Steps for creating a full-stack web application—from React.js components on the front end, to GraphQL APIs in the middleware and the MongoDB database on the back end How to add OAuth authorization to integrate login with GitHub and write automated tests with Jest",
            "image": "http://books.google.com/books/content?id=TWy1EAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2023-10-10T00:00:00.000Z"
        },
        {
            "content_html": "JavaScript is the world's most popular programming language. JavaScript is the programming language of the Web. JavaScript is easy to learn. Here we learn JavaScript, starting from scratch and go on to advanced concepts like OOP. You will learn by examples In this book, learning speed is your choice. Everything is up to you. If you are struggling, take a break, or re-read the material. JavaScript is already running in your browser on your computer, on your tablet, and on your smart-phone. JavaScript is free to use for everyone. Start your coding today!<br><blockquote>JavaScript is the programming language of the Web. JavaScript is easy to learn. Here we learn JavaScript, starting from scratch and go on to advanced concepts like OOP. You will learn by examples In this book, learning speed is your choice.</blockquote>",
            "url": "http://books.google.com/books?id=z7D2DwAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=2&source=gbs_api",
            "title": "The Modern JavaScript Basics Tutorial",
            "summary": "JavaScript is the world's most popular programming language. JavaScript is the programming language of the Web. JavaScript is easy to learn. Here we learn JavaScript, starting from scratch and go on to advanced concepts like OOP. You will learn by examples In this book, learning speed is your choice. Everything is up to you. If you are struggling, take a break, or re-read the material. JavaScript is already running in your browser on your computer, on your tablet, and on your smart-phone. JavaScript is free to use for everyone. Start your coding today!",
            "image": "http://books.google.com/books/content?id=z7D2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-01-15T00:00:00.000Z"
        },
        {
            "content_html": "Learn the skills you need to build React applications quickly! This fully revised second edition introduces functional components, React hooks, static site generators, and more. Build your skills with React and its ecosystem fast. There’s no slow theory and tedious history. You’ll dive into React code right from the very first chapter. The book teaches you how React thinks, introducing ways of structuring your architecture that even work with large teams. React Quickly, Second Edition is a practical guide to React for busy web developers. Following over 100 carefully chosen and clearly explained examples, you'll learn React development using your existing JavaScript and web development skills. This totally rewritten second edition is full of brand new topics, including chapters on functional components, static site generations, and CSS in JS. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.<br><blockquote>The book teaches you how React thinks, introducing ways of structuring your architecture that even work with large teams. React Quickly, Second Edition is a practical guide to React for busy web developers.</blockquote>",
            "url": "http://books.google.com/books?id=eTfwzgEACAAJ&dq=JavaScript&hl=&cd=3&source=gbs_api",
            "title": "React Quickly, Second Edition",
            "summary": "Learn the skills you need to build React applications quickly! This fully revised second edition introduces functional components, React hooks, static site generators, and more. Build your skills with React and its ecosystem fast. There’s no slow theory and tedious history. You’ll dive into React code right from the very first chapter. The book teaches you how React thinks, introducing ways of structuring your architecture that even work with large teams. React Quickly, Second Edition is a practical guide to React for busy web developers. Following over 100 carefully chosen and clearly explained examples, you'll learn React development using your existing JavaScript and web development skills. This totally rewritten second edition is full of brand new topics, including chapters on functional components, static site generations, and CSS in JS. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.",
            "image": "http://books.google.com/books/content?id=eTfwzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2022-10-25T00:00:00.000Z"
        },
        {
            "content_html": "Web developers--this is your all-in-one guide to HTML and CSS! Learn to use HTML to format text and structure web pages. Understand the HTML document skeleton before creating forms, referencing hyperlinks, embedding active content, and more. Then style your pages with CSS: Create consistent designs with selectors, the box model, the cascade algorithm, and inheritance. Round out your client-side development experience by getting to know JavaScript. With detailed code examples, you'll master HTML and CSS in no time! a. HTML for Formatting and StructureMaster HTML syntax and document structure. Work with tags, elements, and attributes to build HTML documents. Create tables and forms, embed images, configure links, and develop interactive HTML elements. b. CSS for Style and DesignDevelop simple and complex web layouts with CSS rules, selectors, declarations, combinators, pseudoclasses, and pseudoelements. Understand the principles of cascading, specificity, and inheritance. Learn to use the CSS box model, the position property, and more. c. JavaScript FundamentalsExpand your knowledge with an introduction to JavaScript. See how to use variables, statements, functions, arrays, and objects to write and run simple programs. Explore the basics of Ajax for interactive web application design. Highlights: HTML syntax and structure HTML elements Tables, links, and images HTML forms CSS selectors Cascade and inheritance CSS box model CSS preprocessors Responsive layout design Testing JavaScript Ajax<br><blockquote>Web developers--this is your all-in-one guide to HTML and CSS!</blockquote>",
            "url": "http://books.google.com/books?id=ANaTzwEACAAJ&dq=JavaScript&hl=&cd=4&source=gbs_api",
            "title": "HTML and CSS",
            "summary": "Web developers--this is your all-in-one guide to HTML and CSS! Learn to use HTML to format text and structure web pages. Understand the HTML document skeleton before creating forms, referencing hyperlinks, embedding active content, and more. Then style your pages with CSS: Create consistent designs with selectors, the box model, the cascade algorithm, and inheritance. Round out your client-side development experience by getting to know JavaScript. With detailed code examples, you'll master HTML and CSS in no time! a. HTML for Formatting and StructureMaster HTML syntax and document structure. Work with tags, elements, and attributes to build HTML documents. Create tables and forms, embed images, configure links, and develop interactive HTML elements. b. CSS for Style and DesignDevelop simple and complex web layouts with CSS rules, selectors, declarations, combinators, pseudoclasses, and pseudoelements. Understand the principles of cascading, specificity, and inheritance. Learn to use the CSS box model, the position property, and more. c. JavaScript FundamentalsExpand your knowledge with an introduction to JavaScript. See how to use variables, statements, functions, arrays, and objects to write and run simple programs. Explore the basics of Ajax for interactive web application design. Highlights: HTML syntax and structure HTML elements Tables, links, and images HTML forms CSS selectors Cascade and inheritance CSS box model CSS preprocessors Responsive layout design Testing JavaScript Ajax",
            "image": "http://books.google.com/books/content?id=ANaTzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2023-01-01T00:00:00.000Z"
        },
        {
            "content_html": "This book serves as a succinct guide on ReScript, a functional language for building web applications. Using examples of ReScript language features along with explanations of fundamental concepts in functional programming, this book will show web developers with a background in JavaScript how to effectively use ReScript to its full potential. In Introducing ReScript, you'll learn how to use features in ReScript that JavaScript lacks, such as type inference, null-safety, algebraic data types, pattern matching, and more. Along the way, you'll pick up functional programming concepts like immutability and higher-order functions. You'll also gain a sense of how ReScript works under the hood and how to leverage interoperability between ReScript and JavaScript. Whether you're a web developer interested in dabbling with functional programming or you just want to learn how to write safer and cleaner code for web applications, this book is a great way for you to get started with ReScript. What You Will Learn Use ReScript to write clean, safe, and elegant software Understand the features of ReScript that set it apart from JavaScript, such as type inference, null-safety, and algebraic data types Explore functional programming concepts like immutabhigher-orderr order functions, and pattern matching Use popular JavaScript libraries and frameworks in your ReScript code and integrate ReScript code into JavaScript codebases Who This Book Is For Web developers that want a strictly typed, safer alternative to JavaScript, as well as web developers interested in learning functional programming and leveraging the elegant and powerful functional features in ReScript.<br><blockquote>This book serves as a succinct guide on ReScript, a functional language for building web applications.</blockquote>",
            "url": "http://books.google.com/books?id=1ZRYzwEACAAJ&dq=JavaScript&hl=&cd=5&source=gbs_api",
            "title": "Introducing ReScript",
            "summary": "This book serves as a succinct guide on ReScript, a functional language for building web applications. Using examples of ReScript language features along with explanations of fundamental concepts in functional programming, this book will show web developers with a background in JavaScript how to effectively use ReScript to its full potential. In Introducing ReScript, you'll learn how to use features in ReScript that JavaScript lacks, such as type inference, null-safety, algebraic data types, pattern matching, and more. Along the way, you'll pick up functional programming concepts like immutability and higher-order functions. You'll also gain a sense of how ReScript works under the hood and how to leverage interoperability between ReScript and JavaScript. Whether you're a web developer interested in dabbling with functional programming or you just want to learn how to write safer and cleaner code for web applications, this book is a great way for you to get started with ReScript. What You Will Learn Use ReScript to write clean, safe, and elegant software Understand the features of ReScript that set it apart from JavaScript, such as type inference, null-safety, and algebraic data types Explore functional programming concepts like immutabhigher-orderr order functions, and pattern matching Use popular JavaScript libraries and frameworks in your ReScript code and integrate ReScript code into JavaScript codebases Who This Book Is For Web developers that want a strictly typed, safer alternative to JavaScript, as well as web developers interested in learning functional programming and leveraging the elegant and powerful functional features in ReScript.",
            "image": "http://books.google.com/books/content?id=1ZRYzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2022-12-28T00:00:00.000Z"
        },
        {
            "content_html": "Mastering React helps the reader master the React JavaScript framework for faster and more robust front-end development. React is a JavaScript framework for creating interface design that is coherent, cheap, and customizable. It makes it possible to create complicated user interfaces out of “modules,” which are small, independent pieces of code. The primary goal of using React is the easier creation of visual interfaces. React was developed by Facebook and released to the public in 2013. It powers some of the most popular apps, including Facebook and Instagram. It uses virtual DOM (JavaScript Document Object Model), which increases the application’s performance. The virtualized DOM in JavaScript is faster than the conventional DOM. React can be used as both a standalone framework and in conjunction with other platforms. It employs component and data patterns to improve clarity while also assisting in maintaining larger applications. React saves you time and money during development because it is component-based. The design can be segmented into reusable modules that could be used to adjust interfaces dynamically. The front-end development industry has a reputation for moving at a breakneck speed. Organizations cannot be expected to modify their apps annually to catch pace with technological innovations. This is why businesses prefer React. React simplifies many things, and its ecosystem is full of valuable subframeworks and tools. React is among the most powerful front-end frameworks out there. As such, learning React development can future-proof anyone’s career in the long run, and even yield immediate benefits. This book explains the concepts of React in an easy-to-grasp language. With Mastering React, learning React becomes a charm, and readers will undoubtedly advance their careers with the help of this book. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with more than a decade of experience in the computing field.<br><blockquote>This book explains the concepts of React in an easy-to-grasp language. With Mastering React, learning React becomes a charm, and readers will undoubtedly advance their careers with the help of this book.</blockquote>",
            "url": "http://books.google.com/books?id=j_-VEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=6&source=gbs_api",
            "title": "Mastering React",
            "summary": "Mastering React helps the reader master the React JavaScript framework for faster and more robust front-end development. React is a JavaScript framework for creating interface design that is coherent, cheap, and customizable. It makes it possible to create complicated user interfaces out of “modules,” which are small, independent pieces of code. The primary goal of using React is the easier creation of visual interfaces. React was developed by Facebook and released to the public in 2013. It powers some of the most popular apps, including Facebook and Instagram. It uses virtual DOM (JavaScript Document Object Model), which increases the application’s performance. The virtualized DOM in JavaScript is faster than the conventional DOM. React can be used as both a standalone framework and in conjunction with other platforms. It employs component and data patterns to improve clarity while also assisting in maintaining larger applications. React saves you time and money during development because it is component-based. The design can be segmented into reusable modules that could be used to adjust interfaces dynamically. The front-end development industry has a reputation for moving at a breakneck speed. Organizations cannot be expected to modify their apps annually to catch pace with technological innovations. This is why businesses prefer React. React simplifies many things, and its ecosystem is full of valuable subframeworks and tools. React is among the most powerful front-end frameworks out there. As such, learning React development can future-proof anyone’s career in the long run, and even yield immediate benefits. This book explains the concepts of React in an easy-to-grasp language. With Mastering React, learning React becomes a charm, and readers will undoubtedly advance their careers with the help of this book. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with more than a decade of experience in the computing field.",
            "image": "http://books.google.com/books/content?id=j_-VEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-11-29T00:00:00.000Z"
        },
        {
            "content_html": "Mastering Vue.js helps the reader master the Vue.js JavaScript framework for faster and more robust front-end development. Vue is a popular JavaScript front-end framework that is rapidly expanding. It is easy to use, small (less than 24 KB), and really fast. It is simple to include in other applications and libraries. Vue.js is easy to install, and beginners may quickly learn how to use it and begin creating their interface design. What makes Vue special is that it is different from most other JavaScript frameworks and libraries. Unlike other monolithic frameworks, Vue is built from the ground up to be incrementally adaptable. The core library focuses primarily on the View layer, and is easy to use and combine with other libraries or projects. On the other hand, when merged with contemporary stacks and libraries, Vue is perfectly capable of running powerful Single-Page Web Applications. Working with Vue.js can be fun. Leveraging Vue and its plugins can help one easily create excellent Internet and smartphone-compatible applications. Vue is both compact and customizable, and comes with multiple capabilities for intelligent state management and navigation choices. All said and done, learning Vue is an excellent career initiative, especially since it is rapidly gaining favor among startups and established enterprises alike. Vue is an excellent choice if you want to make a highly engaging, flexible, and data-driven app. It has an easy-to-understand layout which you can learn in minutes. Unlike Angular or React, Vue.js does not have a lot of challenges or concepts to master. It is an excellent choice for programmers looking to learn and implement new technology for their next project. With Mastering Vue.js, learning Vue becomes very straightforward, which will help readers undoubtedly advance their careers. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with over a decade of experience in the computing field.<br><blockquote>Mastering Vue.js helps the reader master the Vue.js JavaScript framework for faster and more robust front-end development. Vue is a popular JavaScript front-end framework that is rapidly expanding.</blockquote>",
            "url": "http://books.google.com/books?id=4NKLEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=7&source=gbs_api",
            "title": "Mastering Vue.js",
            "summary": "Mastering Vue.js helps the reader master the Vue.js JavaScript framework for faster and more robust front-end development. Vue is a popular JavaScript front-end framework that is rapidly expanding. It is easy to use, small (less than 24 KB), and really fast. It is simple to include in other applications and libraries. Vue.js is easy to install, and beginners may quickly learn how to use it and begin creating their interface design. What makes Vue special is that it is different from most other JavaScript frameworks and libraries. Unlike other monolithic frameworks, Vue is built from the ground up to be incrementally adaptable. The core library focuses primarily on the View layer, and is easy to use and combine with other libraries or projects. On the other hand, when merged with contemporary stacks and libraries, Vue is perfectly capable of running powerful Single-Page Web Applications. Working with Vue.js can be fun. Leveraging Vue and its plugins can help one easily create excellent Internet and smartphone-compatible applications. Vue is both compact and customizable, and comes with multiple capabilities for intelligent state management and navigation choices. All said and done, learning Vue is an excellent career initiative, especially since it is rapidly gaining favor among startups and established enterprises alike. Vue is an excellent choice if you want to make a highly engaging, flexible, and data-driven app. It has an easy-to-understand layout which you can learn in minutes. Unlike Angular or React, Vue.js does not have a lot of challenges or concepts to master. It is an excellent choice for programmers looking to learn and implement new technology for their next project. With Mastering Vue.js, learning Vue becomes very straightforward, which will help readers undoubtedly advance their careers. The Mastering Computer Science series is edited by Sufyan bin Uzayr, a writer and educator with over a decade of experience in the computing field.",
            "image": "http://books.google.com/books/content?id=4NKLEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-11-11T00:00:00.000Z"
        },
        {
            "content_html": "Node.js: Novice to Ninja is your hands-on guide to learning everything needed to build a professional web application using Node.js, the hugely popular open-source, cross-platform, back-end JavaScript runtime environment. You'll start off by getting familiar with the basics - installation and building your first apps - before moving onto more advanced concepts, including debugging, asynchronous programming, using Express.js, working with databases, deployment, and more. You'll finish by building a complete multi-player real-time quiz application. Install Node and build your first application Get started with Express.js and use it to process forms Master asynchronous programming in Node.js Work with MongoDB and MySQL databases Use WebSockets for real-time applications Understand the Node ecosystem: npm and modules Build a complete multiplayer quiz app And much more! The book includes access to 25 high quality tutorial videos, containing 1.5 hours of content.<br><blockquote>The book includes access to 25 high quality tutorial videos, containing 1.5 hours of content.</blockquote>",
            "url": "http://books.google.com/books?id=o991EAAAQBAJ&pg=PA1&dq=JavaScript&hl=&cd=8&source=gbs_api",
            "title": "Node.js: Novice to Ninja",
            "summary": "Node.js: Novice to Ninja is your hands-on guide to learning everything needed to build a professional web application using Node.js, the hugely popular open-source, cross-platform, back-end JavaScript runtime environment. You'll start off by getting familiar with the basics - installation and building your first apps - before moving onto more advanced concepts, including debugging, asynchronous programming, using Express.js, working with databases, deployment, and more. You'll finish by building a complete multi-player real-time quiz application. Install Node and build your first application Get started with Express.js and use it to process forms Master asynchronous programming in Node.js Work with MongoDB and MySQL databases Use WebSockets for real-time applications Understand the Node ecosystem: npm and modules Build a complete multiplayer quiz app And much more! The book includes access to 25 high quality tutorial videos, containing 1.5 hours of content.",
            "image": "http://books.google.com/books/content?id=o991EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-06-07T00:00:00.000Z"
        },
        {
            "content_html": "Hit the ground running with React, the open source technology from Facebook for building rich web applications fast. Updated for the latest React release, the second edition of this hands-on guide shows you how to build React components and organize them into maintainable large-scale apps. If you're familiar with JavaScript syntax, you're ready to get started. Through the course of this book, author Stoyan Stefanov helps web developers and programmers build a complete single-page application. You'll quickly learn why some developers consider React the key to the web app development puzzle. Set up React and write your first \"Hello, World\" web app Create and use custom React components alongside generic DOM components Build a data table component that lets you edit, sort, search, and export its contents Master the JSX syntax Use built-in Hooks and create your own custom ones Manage the app's data flow with reducers and contexts Use Create React App to take care of the build process and focus on React itself Build a complete custom app that lets you store data on the client<br><blockquote>If you&#39;re familiar with JavaScript syntax, you&#39;re ready to get started. Through the course of this book, author Stoyan Stefanov helps web developers and programmers build a complete single-page application.</blockquote>",
            "url": "http://books.google.com/books?id=Z_xNEAAAQBAJ&printsec=frontcover&dq=JavaScript&hl=&cd=9&source=gbs_api",
            "title": "React: Up & Running",
            "summary": "Hit the ground running with React, the open source technology from Facebook for building rich web applications fast. Updated for the latest React release, the second edition of this hands-on guide shows you how to build React components and organize them into maintainable large-scale apps. If you're familiar with JavaScript syntax, you're ready to get started. Through the course of this book, author Stoyan Stefanov helps web developers and programmers build a complete single-page application. You'll quickly learn why some developers consider React the key to the web app development puzzle. Set up React and write your first \"Hello, World\" web app Create and use custom React components alongside generic DOM components Build a data table component that lets you edit, sort, search, and export its contents Master the JSX syntax Use built-in Hooks and create your own custom ones Manage the app's data flow with reducers and contexts Use Create React App to take care of the build process and focus on React itself Build a complete custom app that lets you store data on the client",
            "image": "http://books.google.com/books/content?id=Z_xNEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-11-11T00:00:00.000Z"
        },
        {
            "content_html": "Get the definitive guide on Gatsby, the JavaScript framework for building blazing fast websites and applications. Used by Nike, Costa Coffee, and other companies worldwide, Gatsby is emerging as one of the key technologies in the Jamstack (JavaScript, APIs, and markup) ecosystem. With this comprehensive guide, you'll learn how to architect, build, and deploy Gatsby sites independently or with CMSs, commerce systems, and other data sources. Author Preston So begins by showing you how to set up a Gatsby site from scratch. From there, youâ??ll learn ways to use Gatsbyâ??s declarative rendering and GraphQL API, build complex offline-enabled sites, and continuously deploy Gatsby sites on a variety of platforms, including Gatsby Cloud. Discover how Gatsby integrates with many data sources and plug-ins Set up, configure, and architect Gatsby sites using Gatsby's CLI, React, JSX, and GraphQL with high performance out of the box Build an independent Gatsby site based on Markdown and data- and content-driven Gatsby sites that integrate with CMSs and commerce platforms Deploy Gatsby sites with full CI/CD and test coverage on a variety of platforms, including Netlify, Vercel, and Gatsby Cloud<br><blockquote>Get the definitive guide on Gatsby, the JavaScript framework for building blazing fast websites and applications.</blockquote>",
            "url": "http://books.google.com/books?id=mDhCEAAAQBAJ&pg=PP1&dq=JavaScript&hl=&cd=10&source=gbs_api",
            "title": "Gatsby: The Definitive Guide",
            "summary": "Get the definitive guide on Gatsby, the JavaScript framework for building blazing fast websites and applications. Used by Nike, Costa Coffee, and other companies worldwide, Gatsby is emerging as one of the key technologies in the Jamstack (JavaScript, APIs, and markup) ecosystem. With this comprehensive guide, you'll learn how to architect, build, and deploy Gatsby sites independently or with CMSs, commerce systems, and other data sources. Author Preston So begins by showing you how to set up a Gatsby site from scratch. From there, youâ??ll learn ways to use Gatsbyâ??s declarative rendering and GraphQL API, build complex offline-enabled sites, and continuously deploy Gatsby sites on a variety of platforms, including Gatsby Cloud. Discover how Gatsby integrates with many data sources and plug-ins Set up, configure, and architect Gatsby sites using Gatsby's CLI, React, JSX, and GraphQL with high performance out of the box Build an independent Gatsby site based on Markdown and data- and content-driven Gatsby sites that integrate with CMSs and commerce platforms Deploy Gatsby sites with full CI/CD and test coverage on a variety of platforms, including Netlify, Vercel, and Gatsby Cloud",
            "image": "http://books.google.com/books/content?id=mDhCEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2021-09-09T00:00:00.000Z"
        }
    ]
}