{
    "version": "https://jsonfeed.org/version/1",
    "title": "TypeScript(en) on Google Book",
    "home_page_url": "https://azu.github.io/book-rss/TypeScript-en.json",
    "description": "TypeScript(en) on Google Book",
    "items": [
        {
            "content_html": "Now in its third edition, this bestselling guide to TypeScript takes you through the nuts and bolts of the language. No frills, no fuss—just TypeScript essentials! TypeScript enhances JavaScript with static typing, while keeping all the JS flexibility you know and love! It’s the perfect choice for any developer looking to improve the predictability and reliability of their code. Essential TypeScript 5, Third Edition teaches you how to get the most out of TypeScript 5 for a consistent, dependable development experience. Inside Essential TypeScript 5, Third Edition you’ll learn how to: Configure the TypeScript development tools Use type annotations Create strongly typed functions and classes Use generic types Use type guards to determine types Create and consume type declaration files Use TypeScript to create web applications with Angular and React The book starts you off with a proper understanding of the JavaScript type system that will make using TypeScript so much easier. On that solid foundation, you’ll build your understanding of TypeScript development, following a hands-on learning path all the way to TypeScript’s advanced features. About the technology TypeScript is a popular superset of JavaScript that adds support for static typing. TypeScript’s typing features, which will be instantly familiar to C# or Java programmers, help you reduce errors and improve the overall quality of your JavaScript code. About the book Essential TypeScript 5 is a fully updated third edition of the classic Adam Freeman bestseller. It provides full coverage of TypeScript 5, including new features like decorators. You’ll begin with the hows-and-whys of TypeScript, then quickly progress to practical applications of static types. No wasted pages! Each chapter is focused on the skills you need to write awesome web apps. What's inside Configure your development tools Create strongly typed functions and classes Use generic types, type annotations, and type guards Create and consume type declaration files About the reader For JavaScript developers. No previous experience with TypeScript required. About the author Adam Freeman has held senior positions in a range of companies, most recently serving as CTO and COO of a global bank. He has written 50 programming books. The technical editor on this book is Fabio Claudio Ferracchiati. Table of Contents 1 Understanding TypeScript Part 1 2 Your first TypeScript application 3 JavaScript primer, part 1 4 JavaScript primer, part 2 5 Using the TypeScript compiler 6 Testing and debugging TypeScript Part 2 7 Understanding static types 8 Using functions 9 Using arrays, tuples, and enums 10 Working with objects 11 Working with classes and interfaces 12 Using generic types 13 Advanced generic types 14 Using decorators 15 Working with JavaScript Part 3 16 Creating a stand-alone web app, part 1 17 Creating a stand-alone web app, part 2 18 Creating an Angular app, part 1 19 Creating an Angular app, part 2 20 Creating a React app 21 Creating a React app, part 2<br><blockquote>About the author Adam Freeman has held senior positions in a range of companies, most recently serving as CTO and COO of a global bank. He has written 50 programming books. The technical editor on this book is Fabio Claudio Ferracchiati.</blockquote>",
            "url": "http://books.google.com/books?id=SU3TEAAAQBAJ&dq=TypeScript&hl=&cd=1&source=gbs_api",
            "title": "Essential TypeScript 5, Third Edition",
            "summary": "Now in its third edition, this bestselling guide to TypeScript takes you through the nuts and bolts of the language. No frills, no fuss—just TypeScript essentials! TypeScript enhances JavaScript with static typing, while keeping all the JS flexibility you know and love! It’s the perfect choice for any developer looking to improve the predictability and reliability of their code. Essential TypeScript 5, Third Edition teaches you how to get the most out of TypeScript 5 for a consistent, dependable development experience. Inside Essential TypeScript 5, Third Edition you’ll learn how to: Configure the TypeScript development tools Use type annotations Create strongly typed functions and classes Use generic types Use type guards to determine types Create and consume type declaration files Use TypeScript to create web applications with Angular and React The book starts you off with a proper understanding of the JavaScript type system that will make using TypeScript so much easier. On that solid foundation, you’ll build your understanding of TypeScript development, following a hands-on learning path all the way to TypeScript’s advanced features. About the technology TypeScript is a popular superset of JavaScript that adds support for static typing. TypeScript’s typing features, which will be instantly familiar to C# or Java programmers, help you reduce errors and improve the overall quality of your JavaScript code. About the book Essential TypeScript 5 is a fully updated third edition of the classic Adam Freeman bestseller. It provides full coverage of TypeScript 5, including new features like decorators. You’ll begin with the hows-and-whys of TypeScript, then quickly progress to practical applications of static types. No wasted pages! Each chapter is focused on the skills you need to write awesome web apps. What's inside Configure your development tools Create strongly typed functions and classes Use generic types, type annotations, and type guards Create and consume type declaration files About the reader For JavaScript developers. No previous experience with TypeScript required. About the author Adam Freeman has held senior positions in a range of companies, most recently serving as CTO and COO of a global bank. He has written 50 programming books. The technical editor on this book is Fabio Claudio Ferracchiati. Table of Contents 1 Understanding TypeScript Part 1 2 Your first TypeScript application 3 JavaScript primer, part 1 4 JavaScript primer, part 2 5 Using the TypeScript compiler 6 Testing and debugging TypeScript Part 2 7 Understanding static types 8 Using functions 9 Using arrays, tuples, and enums 10 Working with objects 11 Working with classes and interfaces 12 Using generic types 13 Advanced generic types 14 Using decorators 15 Working with JavaScript Part 3 16 Creating a stand-alone web app, part 1 17 Creating a stand-alone web app, part 2 18 Creating an Angular app, part 1 19 Creating an Angular app, part 2 20 Creating a React app 21 Creating a React app, part 2",
            "image": "http://books.google.com/books/content?id=SU3TEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2023-12-12T00:00:00.000Z"
        },
        {
            "content_html": "TypeScript is a typed superset of JavaScript that compiles to plain JavaScript. It is a powerful tool that can help you write more robust, maintainable, and scalable JavaScript code. This book is a comprehensive guide to TypeScript. It covers everything you need to know to get started with TypeScript.<br><blockquote>TypeScript is a typed superset of JavaScript that compiles to plain JavaScript. It is a powerful tool that can help you write more robust, maintainable, and scalable JavaScript code. This book is a comprehensive guide to TypeScript.</blockquote>",
            "url": "http://books.google.com/books?id=UYDZEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=2&source=gbs_api",
            "title": "Learning TypeScript",
            "summary": "TypeScript is a typed superset of JavaScript that compiles to plain JavaScript. It is a powerful tool that can help you write more robust, maintainable, and scalable JavaScript code. This book is a comprehensive guide to TypeScript. It covers everything you need to know to get started with TypeScript.",
            "image": "http://books.google.com/books/content?id=UYDZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-09-27T00:00:00.000Z"
        },
        {
            "content_html": "Mastering TypeScript Shaping the Frontier of Web Development Delve into the dynamic world of TypeScript—a powerful superset of JavaScript, designed to enhance productivity, facilitate large-scale applications, and push web development boundaries. Whether you're a frontend enthusiast, a backend guru, or someone in-between, \"Mastering TypeScript\" stands as your comprehensive companion in this journey. Venture forth and discover: TypeScript Essentials: Navigate through the basics, understanding TypeScript's type system, interfaces, and the harmony it brings to JavaScript's dynamic nature. Elegant Code Paradigms: Dive deeper into advanced type manipulations, decorators, and asynchronous patterns, ensuring your code remains robust and DRY. Real-World Applications: Harness the might of TypeScript in various environments, from Node.js backends to React, Angular, and Vue frontends. Optimized Tooling: Get acquainted with the TypeScript compiler, linters, and best practices for optimal development workflows. TypeScript and Beyond: Delve into integration insights with existing JavaScript libraries, ensuring seamless transitions and collaborations on diverse projects. \"Mastering TypeScript\" is more than an instructional manual—it's a portal. One that ushers you into a world where type safety meets flexibility, where potential errors are caught at compile-time, and where JavaScript's capabilities are amplified. Embark on a transformative journey in web development with TypeScript as your guide.<br><blockquote>Mastering TypeScript Shaping the Frontier of Web Development Delve into the dynamic world of TypeScript—a powerful superset of JavaScript, designed to enhance productivity, facilitate large-scale applications, and push web development ...</blockquote>",
            "url": "http://books.google.com/books?id=MjTZEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=3&source=gbs_api",
            "title": "Mastering TypeScript",
            "summary": "Mastering TypeScript Shaping the Frontier of Web Development Delve into the dynamic world of TypeScript—a powerful superset of JavaScript, designed to enhance productivity, facilitate large-scale applications, and push web development boundaries. Whether you're a frontend enthusiast, a backend guru, or someone in-between, \"Mastering TypeScript\" stands as your comprehensive companion in this journey. Venture forth and discover: TypeScript Essentials: Navigate through the basics, understanding TypeScript's type system, interfaces, and the harmony it brings to JavaScript's dynamic nature. Elegant Code Paradigms: Dive deeper into advanced type manipulations, decorators, and asynchronous patterns, ensuring your code remains robust and DRY. Real-World Applications: Harness the might of TypeScript in various environments, from Node.js backends to React, Angular, and Vue frontends. Optimized Tooling: Get acquainted with the TypeScript compiler, linters, and best practices for optimal development workflows. TypeScript and Beyond: Delve into integration insights with existing JavaScript libraries, ensuring seamless transitions and collaborations on diverse projects. \"Mastering TypeScript\" is more than an instructional manual—it's a portal. One that ushers you into a world where type safety meets flexibility, where potential errors are caught at compile-time, and where JavaScript's capabilities are amplified. Embark on a transformative journey in web development with TypeScript as your guide.",
            "image": "http://books.google.com/books/content?id=MjTZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-09-26T00:00:00.000Z"
        },
        {
            "content_html": "TypeScript is one of the most important tools for JavaScript developers. Still, even experienced developers wonder why the TypeScript compiler is throwing squiggly red lines at them. Enter TypeScript Cookbook. With this practical guide, author Stefan Baumgartner provides senior engineers with solutions for everyday TypeScript problems. If you're conversant with TypeScript as well as JavaScript basics, this book provides actionable recipes to help you tackle a wide array of issues. From setting up complex project structures to developing advanced helper types, each self-contained recipe guides you through the problem and discusses why and how a solution works. The ideal companion for your ongoing TypeScript journey, this cookbook helps you: Dive into the inner workings of the TypeScript type system Integrate TypeScript into a variety of projects Craft advanced type definitions that allow for flexible scenarios Create useful helper types that function across projects Ensure readability along with type safety Create robust APIs for helper types and their coworkers Strongly type function signatures that rely on string types Work around limitations of the standard library Integrate TypeScript into advanced React projects<br><blockquote>Enter TypeScript Cookbook. With this practical guide, author Stefan Baumgartner provides senior engineers with solutions for everyday TypeScript problems.</blockquote>",
            "url": "http://books.google.com/books?id=I-DPEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=4&source=gbs_api",
            "title": "TypeScript Cookbook",
            "summary": "TypeScript is one of the most important tools for JavaScript developers. Still, even experienced developers wonder why the TypeScript compiler is throwing squiggly red lines at them. Enter TypeScript Cookbook. With this practical guide, author Stefan Baumgartner provides senior engineers with solutions for everyday TypeScript problems. If you're conversant with TypeScript as well as JavaScript basics, this book provides actionable recipes to help you tackle a wide array of issues. From setting up complex project structures to developing advanced helper types, each self-contained recipe guides you through the problem and discusses why and how a solution works. The ideal companion for your ongoing TypeScript journey, this cookbook helps you: Dive into the inner workings of the TypeScript type system Integrate TypeScript into a variety of projects Craft advanced type definitions that allow for flexible scenarios Create useful helper types that function across projects Ensure readability along with type safety Create robust APIs for helper types and their coworkers Strongly type function signatures that rely on string types Work around limitations of the standard library Integrate TypeScript into advanced React projects",
            "image": "http://books.google.com/books/content?id=I-DPEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-08-08T00:00:00.000Z"
        },
        {
            "content_html": "Unleash the Power of Modern Web Development with Typescript KEY FEATURES ● This book offers hands-on examples for Typescript programming ● Advanced Typescript features such as enums, interfaces and namespaces explained ● Shares best practices for structuring TypeScript code using type annotations. Helps develop maintainable and scalable TypeScript code. DESCRIPTION This book provides a comprehensive guide to TypeScript, a programming language that extends JavaScript with powerful features like static typing, classes, and interfaces. The book is divided into thirteen chapters that cover everything from setting up a development environment to building an Angular app with TypeScript. We start with an introduction to TypeScript and its benefits and go on to explain how TypeScript can help developers write more maintainable, scalable code and catch errors before they make it to production. The book then dives into more technical topics like basic type annotations, using the TypeScript compiler, advanced features like enums and interfaces, and manipulating types. The book then discusses chapters on classes and control flow analysis that are particularly helpful for developers looking to build more complex applications. The book teaches by example, with numerous code examples that illustrate the main concepts and approaches towards writing TypeScript programs and codes, and finishes with a comprehensive practical example that shows step-by-step development of a modern web application using TypeScript and Angular. WHAT WILL YOU LEARN ● Learn how to create a new TypeScript project with default settings and configurations. ● Discover how to incorporate basic type-annotations into your code for improved clarity and accuracy. ● Explore the use of type-aliases, interfaces, and enums to write more organized and expressive TypeScript code. ● Gain knowledge on building modular and error-free applications in TypeScript. ● Discover how to leverage type-guards, classes, and other TypeScript utilities to write more robust code. ● Learn how to work with advanced features like generics and take your TypeScript skills to the next level. WHO IS THIS BOOK FOR? This book is targeted towards front-end developers who are familiar with JavaScript and are interested in expanding their skillset with TypeScript. Whether you are a beginner with little to no experience or an intermediate developer looking for a reference guide, this book is designed to help you supercharge your development and enhance your tooling. With its clear and concise explanations, it's perfect for those who are new to TypeScript and looking to gain a deeper understanding of its capabilities. TABLE OF CONTENTS Chapter 1: Introduction to TypeScript and its Benefits Chapter 2: Setting Up a Development Environment Chapter 3: Basic Type Annotations Chapter 4: Using the TypeScript Compiler Chapter 5: Enums, Interfaces, and Namespaces Chapter 6: Objects, Arrays, and Tuples in TypeScript Chapter 7: Functions in TypeScript Chapter 8: Classes in TypeScript Chapter 9: Control Flow Analysis Chapter 10: Manipulating Types Chapter 11: TypeScript Modules Chapter 12: Creating Declaration Files Chapter 13: TypeScript Project: Creating an Angular App<br><blockquote>WHO IS THIS BOOK FOR? This book is targeted towards front-end developers who are familiar with JavaScript and are interested in expanding their skillset with TypeScript.</blockquote>",
            "url": "http://books.google.com/books?id=W9bMEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=5&source=gbs_api",
            "title": "Ultimate Typescript Handbook",
            "summary": "Unleash the Power of Modern Web Development with Typescript KEY FEATURES ● This book offers hands-on examples for Typescript programming ● Advanced Typescript features such as enums, interfaces and namespaces explained ● Shares best practices for structuring TypeScript code using type annotations. Helps develop maintainable and scalable TypeScript code. DESCRIPTION This book provides a comprehensive guide to TypeScript, a programming language that extends JavaScript with powerful features like static typing, classes, and interfaces. The book is divided into thirteen chapters that cover everything from setting up a development environment to building an Angular app with TypeScript. We start with an introduction to TypeScript and its benefits and go on to explain how TypeScript can help developers write more maintainable, scalable code and catch errors before they make it to production. The book then dives into more technical topics like basic type annotations, using the TypeScript compiler, advanced features like enums and interfaces, and manipulating types. The book then discusses chapters on classes and control flow analysis that are particularly helpful for developers looking to build more complex applications. The book teaches by example, with numerous code examples that illustrate the main concepts and approaches towards writing TypeScript programs and codes, and finishes with a comprehensive practical example that shows step-by-step development of a modern web application using TypeScript and Angular. WHAT WILL YOU LEARN ● Learn how to create a new TypeScript project with default settings and configurations. ● Discover how to incorporate basic type-annotations into your code for improved clarity and accuracy. ● Explore the use of type-aliases, interfaces, and enums to write more organized and expressive TypeScript code. ● Gain knowledge on building modular and error-free applications in TypeScript. ● Discover how to leverage type-guards, classes, and other TypeScript utilities to write more robust code. ● Learn how to work with advanced features like generics and take your TypeScript skills to the next level. WHO IS THIS BOOK FOR? This book is targeted towards front-end developers who are familiar with JavaScript and are interested in expanding their skillset with TypeScript. Whether you are a beginner with little to no experience or an intermediate developer looking for a reference guide, this book is designed to help you supercharge your development and enhance your tooling. With its clear and concise explanations, it's perfect for those who are new to TypeScript and looking to gain a deeper understanding of its capabilities. TABLE OF CONTENTS Chapter 1: Introduction to TypeScript and its Benefits Chapter 2: Setting Up a Development Environment Chapter 3: Basic Type Annotations Chapter 4: Using the TypeScript Compiler Chapter 5: Enums, Interfaces, and Namespaces Chapter 6: Objects, Arrays, and Tuples in TypeScript Chapter 7: Functions in TypeScript Chapter 8: Classes in TypeScript Chapter 9: Control Flow Analysis Chapter 10: Manipulating Types Chapter 11: TypeScript Modules Chapter 12: Creating Declaration Files Chapter 13: TypeScript Project: Creating an Angular App",
            "image": "http://books.google.com/books/content?id=W9bMEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-07-18T00:00:00.000Z"
        },
        {
            "content_html": "Apply functional programming techniques to write testable terser code for frontend and backend development with improved clarity, concurrency, and performance Purchase of the print or Kindle book includes a free PDF eBook Key Features Apply functional programming concepts and techniques to everyday JavaScript or TypeScript programming Master functional programming in JavaScript and TypeScript to solve real-world development problems Apply functional programming to get better testable programs with higher modularity and reusability Book Description Functional programming is a programming paradigm that uses functions for developing software. This book is filled with examples that enable you to leverage the latest JavaScript and TypeScript versions to produce modern and clean code, as well as teach you to how apply functional programming techniques to develop more efficient algorithms, write more concise code, and simplify unit testing. This book provides comprehensive coverage of the major topics in functional programming to produce shorter, clearer, and testable programs. You'll begin by getting to grips with writing and testing pure functions, reducing side effects, as well as other key features to make your applications functional in nature. The book specifically explores techniques to simplify coding, apply recursion, perform high-level coding, learn ways to achieve immutability, implement design patterns, and work with data types. By the end of this book, you'll have developed the practical programming skills needed to confidently enhance your applications by adding functional programming to wherever it's most suitable. What you will learn Understand when to use functional programming versus classic object-oriented programming Use declarative coding instead of imperative coding for clearer, more understandable code Know how to avoid side effects and create more reliable code with closures and immutable data Use recursion to help design and implement more understandable solutions to complex problems Define functional programing data types with or without TypeScript, add type checking, and implement immutability Apply advanced containers to get better structures to tackle errors and implement async programming Who this book is for If you are a JavaScript or TypeScript developer looking to enhance your programming skills, then this book is for you. The book applies to both frontend developers working with frameworks such as React, Vue, or Angular as well as backend developers using Node.js or Deno.<br><blockquote>This book is filled with examples that enable you to leverage the latest JavaScript and TypeScript versions to produce modern and clean code, as well as teach you to how apply functional programming techniques to develop more efficient ...</blockquote>",
            "url": "http://books.google.com/books?id=G9a4EAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=6&source=gbs_api",
            "title": "Mastering JavaScript Functional Programming",
            "summary": "Apply functional programming techniques to write testable terser code for frontend and backend development with improved clarity, concurrency, and performance Purchase of the print or Kindle book includes a free PDF eBook Key Features Apply functional programming concepts and techniques to everyday JavaScript or TypeScript programming Master functional programming in JavaScript and TypeScript to solve real-world development problems Apply functional programming to get better testable programs with higher modularity and reusability Book Description Functional programming is a programming paradigm that uses functions for developing software. This book is filled with examples that enable you to leverage the latest JavaScript and TypeScript versions to produce modern and clean code, as well as teach you to how apply functional programming techniques to develop more efficient algorithms, write more concise code, and simplify unit testing. This book provides comprehensive coverage of the major topics in functional programming to produce shorter, clearer, and testable programs. You'll begin by getting to grips with writing and testing pure functions, reducing side effects, as well as other key features to make your applications functional in nature. The book specifically explores techniques to simplify coding, apply recursion, perform high-level coding, learn ways to achieve immutability, implement design patterns, and work with data types. By the end of this book, you'll have developed the practical programming skills needed to confidently enhance your applications by adding functional programming to wherever it's most suitable. What you will learn Understand when to use functional programming versus classic object-oriented programming Use declarative coding instead of imperative coding for clearer, more understandable code Know how to avoid side effects and create more reliable code with closures and immutable data Use recursion to help design and implement more understandable solutions to complex problems Define functional programing data types with or without TypeScript, add type checking, and implement immutability Apply advanced containers to get better structures to tackle errors and implement async programming Who this book is for If you are a JavaScript or TypeScript developer looking to enhance your programming skills, then this book is for you. The book applies to both frontend developers working with frameworks such as React, Vue, or Angular as well as backend developers using Node.js or Deno.",
            "image": "http://books.google.com/books/content?id=G9a4EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-04-28T00:00:00.000Z"
        },
        {
            "content_html": "Now in its third edition, this bestselling guide to TypeScript takes you through the nuts and bolts of the language. No frills, no fuss—just TypeScript essentials! TypeScript enhances JavaScript with static typing, while keeping all the JS flexibility you know and love! It’s the perfect choice for any developer looking to improve the predictability and reliability of their code. Essential TypeScript 5, Third Edition teaches you how to get the most out of TypeScript 5 for a consistent, dependable development experience. Inside Essential TypeScript 5, Third Edition you’ll learn how to: Configure the TypeScript development tools Use type annotations Create strongly typed functions and classes Use generic types Use type guards to determine types Create and consume type declaration files Use TypeScript to create web applications with Angular and React The book starts you off with a proper understanding of the JavaScript type system that will make using TypeScript so much easier. On that solid foundation, you’ll build your understanding of TypeScript development, following a hands-on learning path all the way to TypeScript’s advanced features. About the technology TypeScript is a popular superset of JavaScript that adds support for static typing. TypeScript’s typing features, which will be instantly familiar to C# or Java programmers, help you reduce errors and improve the overall quality of your JavaScript code. About the book Essential TypeScript 5 is a fully updated third edition of the classic Adam Freeman bestseller. It provides full coverage of TypeScript 5, including new features like decorators. You’ll begin with the hows-and-whys of TypeScript, then quickly progress to practical applications of static types. No wasted pages! Each chapter is focused on the skills you need to write awesome web apps. What's inside Configure your development tools Create strongly typed functions and classes Use generic types, type annotations, and type guards Create and consume type declaration files About the reader For JavaScript developers. No previous experience with TypeScript required. About the author Adam Freeman has held senior positions in a range of companies, most recently serving as CTO and COO of a global bank. He has written 50 programming books. The technical editor on this book is Fabio Claudio Ferracchiati. Table of Contents 1 Understanding TypeScript Part 1 2 Your first TypeScript application 3 JavaScript primer, part 1 4 JavaScript primer, part 2 5 Using the TypeScript compiler 6 Testing and debugging TypeScript Part 2 7 Understanding static types 8 Using functions 9 Using arrays, tuples, and enums 10 Working with objects 11 Working with classes and interfaces 12 Using generic types 13 Advanced generic types 14 Using decorators 15 Working with JavaScript Part 3 16 Creating a stand-alone web app, part 1 17 Creating a stand-alone web app, part 2 18 Creating an Angular app, part 1 19 Creating an Angular app, part 2 20 Creating a React app 21 Creating a React app, part 2<br><blockquote>Now in its third edition, this bestselling guide to TypeScript takes you through the nuts and bolts of the language.</blockquote>",
            "url": "http://books.google.com/books?id=0WbxzwEACAAJ&dq=TypeScript&hl=&cd=7&source=gbs_api",
            "title": "Essential TypeScript 5, Third Edition",
            "summary": "Now in its third edition, this bestselling guide to TypeScript takes you through the nuts and bolts of the language. No frills, no fuss—just TypeScript essentials! TypeScript enhances JavaScript with static typing, while keeping all the JS flexibility you know and love! It’s the perfect choice for any developer looking to improve the predictability and reliability of their code. Essential TypeScript 5, Third Edition teaches you how to get the most out of TypeScript 5 for a consistent, dependable development experience. Inside Essential TypeScript 5, Third Edition you’ll learn how to: Configure the TypeScript development tools Use type annotations Create strongly typed functions and classes Use generic types Use type guards to determine types Create and consume type declaration files Use TypeScript to create web applications with Angular and React The book starts you off with a proper understanding of the JavaScript type system that will make using TypeScript so much easier. On that solid foundation, you’ll build your understanding of TypeScript development, following a hands-on learning path all the way to TypeScript’s advanced features. About the technology TypeScript is a popular superset of JavaScript that adds support for static typing. TypeScript’s typing features, which will be instantly familiar to C# or Java programmers, help you reduce errors and improve the overall quality of your JavaScript code. About the book Essential TypeScript 5 is a fully updated third edition of the classic Adam Freeman bestseller. It provides full coverage of TypeScript 5, including new features like decorators. You’ll begin with the hows-and-whys of TypeScript, then quickly progress to practical applications of static types. No wasted pages! Each chapter is focused on the skills you need to write awesome web apps. What's inside Configure your development tools Create strongly typed functions and classes Use generic types, type annotations, and type guards Create and consume type declaration files About the reader For JavaScript developers. No previous experience with TypeScript required. About the author Adam Freeman has held senior positions in a range of companies, most recently serving as CTO and COO of a global bank. He has written 50 programming books. The technical editor on this book is Fabio Claudio Ferracchiati. Table of Contents 1 Understanding TypeScript Part 1 2 Your first TypeScript application 3 JavaScript primer, part 1 4 JavaScript primer, part 2 5 Using the TypeScript compiler 6 Testing and debugging TypeScript Part 2 7 Understanding static types 8 Using functions 9 Using arrays, tuples, and enums 10 Working with objects 11 Working with classes and interfaces 12 Using generic types 13 Advanced generic types 14 Using decorators 15 Working with JavaScript Part 3 16 Creating a stand-alone web app, part 1 17 Creating a stand-alone web app, part 2 18 Creating an Angular app, part 1 19 Creating an Angular app, part 2 20 Creating a React app 21 Creating a React app, part 2",
            "image": "http://books.google.com/books/content?id=0WbxzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2023-10-10T00:00:00.000Z"
        },
        {
            "content_html": "Get familiar with React design patterns and best practices to solve common React development problems KEY FEATURES ● Get tips to create a better React app architecture. ● Explore the best practices for building scalable React apps. ● Discover ways to write tests for your React applications. DESCRIPTION React is a JavaScript library created by Facebook to help build applications with components. In React, there are proven methods to solve common problems experienced by React developers. If you are looking for different ways how to choose your pattern when building a React app, then this book is for you. The book starts by sharing the best practices for architecting your React app. It then helps you learn how to create clean, performant, and maintainable React components using JavaScript and TypeScript. The book helps you explore and work with some useful hooks in React. It also helps you learn how to enable server-side rendering for your React app. Later, the book will help you discover ways to style your React components effectively. Towards the end, the book will help you learn how to write tests for your React applications. By the end of the book, you will be able to build complex and maintainable React apps with JavaScript and TypeScript. WHAT YOU WILL LEARN ● Learn how to manage State with Hooks on React components. ● Learn how to style React components with CSS. ● Understand how to use Next.js for server-side rendering of your React app. ● Explore different ways to fetch data using API in React. ● Test your React app with React testing library, Jest, and Cypress. WHO THIS BOOK IS FOR This book is for Web developers, JavaScript developers, and Typescript developers who want to build complex and scalable apps with React. Software engineers and developers who are early in their React careers will find this book very helpful. TABLE OF CONTENTS 1. React Anti-Patterns and Best Practices 2. Writing Components 3. Clean and Maintainable Code 4. React Hooks 5. Styling 6. Server-Side Renderings 7. Data Fetching 8. Building Scalable Applications 9. Testing<br><blockquote>If you are looking for different ways how to choose your pattern when building a React app, then this book is for you. The book starts by sharing the best practices for architecting your React app.</blockquote>",
            "url": "http://books.google.com/books?id=UfmpEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=8&source=gbs_api",
            "title": "React.js Design Patterns",
            "summary": "Get familiar with React design patterns and best practices to solve common React development problems KEY FEATURES ● Get tips to create a better React app architecture. ● Explore the best practices for building scalable React apps. ● Discover ways to write tests for your React applications. DESCRIPTION React is a JavaScript library created by Facebook to help build applications with components. In React, there are proven methods to solve common problems experienced by React developers. If you are looking for different ways how to choose your pattern when building a React app, then this book is for you. The book starts by sharing the best practices for architecting your React app. It then helps you learn how to create clean, performant, and maintainable React components using JavaScript and TypeScript. The book helps you explore and work with some useful hooks in React. It also helps you learn how to enable server-side rendering for your React app. Later, the book will help you discover ways to style your React components effectively. Towards the end, the book will help you learn how to write tests for your React applications. By the end of the book, you will be able to build complex and maintainable React apps with JavaScript and TypeScript. WHAT YOU WILL LEARN ● Learn how to manage State with Hooks on React components. ● Learn how to style React components with CSS. ● Understand how to use Next.js for server-side rendering of your React app. ● Explore different ways to fetch data using API in React. ● Test your React app with React testing library, Jest, and Cypress. WHO THIS BOOK IS FOR This book is for Web developers, JavaScript developers, and Typescript developers who want to build complex and scalable apps with React. Software engineers and developers who are early in their React careers will find this book very helpful. TABLE OF CONTENTS 1. React Anti-Patterns and Best Practices 2. Writing Components 3. Clean and Maintainable Code 4. React Hooks 5. Styling 6. Server-Side Renderings 7. Data Fetching 8. Building Scalable Applications 9. Testing",
            "image": "http://books.google.com/books/content?id=UfmpEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-01-27T00:00:00.000Z"
        },
        {
            "content_html": "Learn how React Native works under the hood and what this means for building large-scale, cross-platform, production-ready applications without compromising on the quality and performance Key FeaturesExplore a modern approach to React Native, covering state management, animations, gestures, and moreImplement best practices and practical techniques for creating large-scale, production-ready appsCreate a development process including workflow automation with GitHub Actions, Fastlane, and BitriseBook Description The React Native framework offers a range of powerful features that make it possible to efficiently build high-quality, easy-to-maintain frontend applications across multiple platforms such as iOS, Android, Linux, Mac OS X, Windows, and the web, helping you save both time and money. And this book is your key to unlocking its capabilities. Professional React Native provides the ultimate coverage of essential concepts, best practices, advanced processes, and tips for everyday developer problems. The book makes it easy to understand how React Native works under the hood using step-by-step explanations and practical examples so you can use this knowledge to develop highly performant apps. As you follow along, you'll learn the difference between React and React Native, navigate the React Native ecosystem, and revisit the basics of JavaScript and TypeScript needed to create a React Native application. What's more, you'll work with animations and even control your app with gestures. Finally, you'll be able to structure larger apps and improve developer efficiency through automated processes, testing, and continuous integration. By the end of this React native app development book, you'll have gained the confidence to build high-performance apps for multiple platforms, even on a bigger scale. What you will learnBecome familiar with how React Native works under the hoodUnderstand how to make the most of React Native for app developmentExplore different approaches to building apps across various platformsBecome familiar with process automation and automated testingContribute to open source code and structure your own code libraryUnderstand how to set up the architecture for bigger React Native projectsWho this book is for This book is for developers who want to get started with React Native as well as experienced React Native developers interested in building professional cross-platform applications. Familiarity with the basics of JavaScript (including its syntax) and general software engineering concepts, such as data types, control flows, and server/client structures, is required. Although useful, experience with React Native is not necessary.<br><blockquote>And this book is your key to unlocking its capabilities. Professional React Native provides the ultimate coverage of essential concepts, best practices, advanced processes, and tips for everyday developer problems.</blockquote>",
            "url": "http://books.google.com/books?id=pXuUEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=9&source=gbs_api",
            "title": "Professional React Native",
            "summary": "Learn how React Native works under the hood and what this means for building large-scale, cross-platform, production-ready applications without compromising on the quality and performance Key FeaturesExplore a modern approach to React Native, covering state management, animations, gestures, and moreImplement best practices and practical techniques for creating large-scale, production-ready appsCreate a development process including workflow automation with GitHub Actions, Fastlane, and BitriseBook Description The React Native framework offers a range of powerful features that make it possible to efficiently build high-quality, easy-to-maintain frontend applications across multiple platforms such as iOS, Android, Linux, Mac OS X, Windows, and the web, helping you save both time and money. And this book is your key to unlocking its capabilities. Professional React Native provides the ultimate coverage of essential concepts, best practices, advanced processes, and tips for everyday developer problems. The book makes it easy to understand how React Native works under the hood using step-by-step explanations and practical examples so you can use this knowledge to develop highly performant apps. As you follow along, you'll learn the difference between React and React Native, navigate the React Native ecosystem, and revisit the basics of JavaScript and TypeScript needed to create a React Native application. What's more, you'll work with animations and even control your app with gestures. Finally, you'll be able to structure larger apps and improve developer efficiency through automated processes, testing, and continuous integration. By the end of this React native app development book, you'll have gained the confidence to build high-performance apps for multiple platforms, even on a bigger scale. What you will learnBecome familiar with how React Native works under the hoodUnderstand how to make the most of React Native for app developmentExplore different approaches to building apps across various platformsBecome familiar with process automation and automated testingContribute to open source code and structure your own code libraryUnderstand how to set up the architecture for bigger React Native projectsWho this book is for This book is for developers who want to get started with React Native as well as experienced React Native developers interested in building professional cross-platform applications. Familiarity with the basics of JavaScript (including its syntax) and general software engineering concepts, such as data types, control flows, and server/client structures, is required. Although useful, experience with React Native is not necessary.",
            "image": "http://books.google.com/books/content?id=pXuUEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-10-31T00:00:00.000Z"
        },
        {
            "content_html": "Learn Deno with TypeScript KEY FEATURES ● Take advantage of modern tools and frameworks like React and GraphQL. ● Exposure to the Deno ecosystem and many different third-party modules. ● Coverage of the creation of UIs and APIs for numerous apps. DESCRIPTION Deno is a web platform that offers capabilities for JavaScript and TypeScript and supports modern web standards. It is a straightforward, up-to-date, secure runtime environment for web developers. This book will teach all you need to know about Deno's primitives, its ideas, and how you can use them to build applications that work in the real world. The book's first part is devoted to familiarizing you with Deno's runtime and comprehensive ecosystem. This book will help you to get familiar with TypeScript and experiment with Deno. The book will also help you to learn about GraphQL and Oak and build basic scripts. It will help you to design basic web applications such as a phonebook application and a to-do list application, both of which will have their user interfaces (UI) and APIs developed. This book will help you to get a good level of confidence with Deno over NodeJS so that you can start using Deno to build, maintain, and deploy web apps that are reliable and secure. WHAT YOU WILL LEARN ● Get started with the basics of TypeScript and Deno. ● Use Deno to create your next React or Svelte app's user interface. ● Develop a GraphQL API server with Deno. ● Make the most of TypeScript when creating applications. ● Take advantage of the various plugins that Deno and its creators offer. WHO THIS BOOK IS FOR Readers interested in utilizing the power of Deno to fuel their apps, whether they are web developers, TypeScript users, or JavaScript users will find this book helpful. The code will be easier to understand if you are familiar with JavaScript already. TABLE OF CONTENTS 1. The Deno Land 2. Introduction to TypeScript 3. Setting Up Deno 4. Deno Ecosystem 5. Todos App - API 6. Todos App - UI Implementation 7. Introduction to GraphQL, Oak, and Oak-GraphQL 8. PhoneBook App—API Implementation 9. PhoneBook App—UI Implementation<br><blockquote>The book&#39;s first part is devoted to familiarizing you with Deno&#39;s runtime and comprehensive ecosystem. This book will help you to get familiar with TypeScript and experiment with Deno.</blockquote>",
            "url": "http://books.google.com/books?id=JK-TEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=10&source=gbs_api",
            "title": "Modern Web Development with Deno",
            "summary": "Learn Deno with TypeScript KEY FEATURES ● Take advantage of modern tools and frameworks like React and GraphQL. ● Exposure to the Deno ecosystem and many different third-party modules. ● Coverage of the creation of UIs and APIs for numerous apps. DESCRIPTION Deno is a web platform that offers capabilities for JavaScript and TypeScript and supports modern web standards. It is a straightforward, up-to-date, secure runtime environment for web developers. This book will teach all you need to know about Deno's primitives, its ideas, and how you can use them to build applications that work in the real world. The book's first part is devoted to familiarizing you with Deno's runtime and comprehensive ecosystem. This book will help you to get familiar with TypeScript and experiment with Deno. The book will also help you to learn about GraphQL and Oak and build basic scripts. It will help you to design basic web applications such as a phonebook application and a to-do list application, both of which will have their user interfaces (UI) and APIs developed. This book will help you to get a good level of confidence with Deno over NodeJS so that you can start using Deno to build, maintain, and deploy web apps that are reliable and secure. WHAT YOU WILL LEARN ● Get started with the basics of TypeScript and Deno. ● Use Deno to create your next React or Svelte app's user interface. ● Develop a GraphQL API server with Deno. ● Make the most of TypeScript when creating applications. ● Take advantage of the various plugins that Deno and its creators offer. WHO THIS BOOK IS FOR Readers interested in utilizing the power of Deno to fuel their apps, whether they are web developers, TypeScript users, or JavaScript users will find this book helpful. The code will be easier to understand if you are familiar with JavaScript already. TABLE OF CONTENTS 1. The Deno Land 2. Introduction to TypeScript 3. Setting Up Deno 4. Deno Ecosystem 5. Todos App - API 6. Todos App - UI Implementation 7. Introduction to GraphQL, Oak, and Oak-GraphQL 8. PhoneBook App—API Implementation 9. PhoneBook App—UI Implementation",
            "image": "http://books.google.com/books/content?id=JK-TEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-10-07T00:00:00.000Z"
        }
    ]
}