{
    "version": "https://jsonfeed.org/version/1",
    "title": "TypeScript(en) on Google Book",
    "home_page_url": "https://azu.github.io/book-rss/TypeScript-en.json",
    "description": "TypeScript(en) on Google Book",
    "items": [
        {
            "content_html": "Jumpstart your working knowledge of Typescript with a quick, practical guide and start using this open source, object orientated language with confidence. This book highlights how Typescript works with JavaScript and its frameworks, giving it greater functionality, especially for larger enterprise projects. You'll start by reviewing some fundamentals such as how to run a TypeScript file and compile it to JavaScript as well as understand how it sits within the full ecosystem alongside React, Redux, Angular and Webpack. Using a practical project-led approach, you'll go through key concepts and aspects of Typescript such as compilers, arrays, classes and interfaces. Once you complete the fundamental basics, you'll move onto more complex topics like advanced types. You'll also learn about Decorators, which are a must-have feature in Angular. The book then presents a small To-do list project followed by a larger 'Drag and Drop' project. You'll see how to divide the drag and drop project into small manageable modules and learn to make the project more efficient with Webpack. Lastly, you'll create two more React projects, a party app with React and then one with React and Redux. Typescript Basics reveals how this JavaScript extension is currently the fastest growing language for web development with more and more developers and companies looking to utilize and adopt it within their current workflows and projects. What You'll Learn Understand the particulars of Typescript and how it feeds into the JS and Web development eco-system Implement Typescript for enterprise projects Use Typescript with practical projects and examples See how Typescript interacts with major frameworks like React and Angular Who This Book Is For Those who want to learn about TypeScript and implement it in their Enterprise or hobby projects with React and Angular. Beginners will find it easy to learn the basic concepts and principles to get started and to progress onto more advanced projects and how to implement them.<br><blockquote>This book highlights how Typescript works with JavaScript and its frameworks, giving it greater functionality, especially for larger enterprise projects.</blockquote>",
            "url": "http://books.google.com/books?id=-NTXzwEACAAJ&dq=TypeScript&hl=&cd=1&source=gbs_api",
            "title": "TypeScript Basics",
            "summary": "Jumpstart your working knowledge of Typescript with a quick, practical guide and start using this open source, object orientated language with confidence. This book highlights how Typescript works with JavaScript and its frameworks, giving it greater functionality, especially for larger enterprise projects. You'll start by reviewing some fundamentals such as how to run a TypeScript file and compile it to JavaScript as well as understand how it sits within the full ecosystem alongside React, Redux, Angular and Webpack. Using a practical project-led approach, you'll go through key concepts and aspects of Typescript such as compilers, arrays, classes and interfaces. Once you complete the fundamental basics, you'll move onto more complex topics like advanced types. You'll also learn about Decorators, which are a must-have feature in Angular. The book then presents a small To-do list project followed by a larger 'Drag and Drop' project. You'll see how to divide the drag and drop project into small manageable modules and learn to make the project more efficient with Webpack. Lastly, you'll create two more React projects, a party app with React and then one with React and Redux. Typescript Basics reveals how this JavaScript extension is currently the fastest growing language for web development with more and more developers and companies looking to utilize and adopt it within their current workflows and projects. What You'll Learn Understand the particulars of Typescript and how it feeds into the JS and Web development eco-system Implement Typescript for enterprise projects Use Typescript with practical projects and examples See how Typescript interacts with major frameworks like React and Angular Who This Book Is For Those who want to learn about TypeScript and implement it in their Enterprise or hobby projects with React and Angular. Beginners will find it easy to learn the basic concepts and principles to get started and to progress onto more advanced projects and how to implement them.",
            "image": "http://books.google.com/books/content?id=-NTXzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2023-11-20T00:00:00.000Z"
        },
        {
            "content_html": "TypeScript is one of the most important tools for JavaScript developers. Still, even experienced developers wonder why the TypeScript compiler is throwing squiggly red lines at them. Enter TypeScript Cookbook. With this practical guide, author Stefan Baumgartner provides senior engineers with solutions for everyday TypeScript problems. If you're conversant with TypeScript as well as JavaScript basics, this book provides actionable recipes to help you tackle a wide array of issues. From setting up complex project structures to developing advanced helper types, each self-contained recipe guides you through the problem and discusses why and how a solution works. The ideal companion for your ongoing TypeScript journey, this cookbook helps you: Dive into the inner workings of the TypeScript type system Integrate TypeScript into a variety of projects Craft advanced type definitions that allow for flexible scenarios Create useful helper types that function across projects Ensure readability along with type safety Create robust APIs for helper types and their coworkers Strongly type function signatures that rely on string types Work around limitations of the standard library Integrate TypeScript into advanced React projects<br><blockquote>Enter TypeScript Cookbook. With this practical guide, author Stefan Baumgartner provides senior engineers with solutions for everyday TypeScript problems.</blockquote>",
            "url": "http://books.google.com/books?id=I-DPEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=2&source=gbs_api",
            "title": "TypeScript Cookbook",
            "summary": "TypeScript is one of the most important tools for JavaScript developers. Still, even experienced developers wonder why the TypeScript compiler is throwing squiggly red lines at them. Enter TypeScript Cookbook. With this practical guide, author Stefan Baumgartner provides senior engineers with solutions for everyday TypeScript problems. If you're conversant with TypeScript as well as JavaScript basics, this book provides actionable recipes to help you tackle a wide array of issues. From setting up complex project structures to developing advanced helper types, each self-contained recipe guides you through the problem and discusses why and how a solution works. The ideal companion for your ongoing TypeScript journey, this cookbook helps you: Dive into the inner workings of the TypeScript type system Integrate TypeScript into a variety of projects Craft advanced type definitions that allow for flexible scenarios Create useful helper types that function across projects Ensure readability along with type safety Create robust APIs for helper types and their coworkers Strongly type function signatures that rely on string types Work around limitations of the standard library Integrate TypeScript into advanced React projects",
            "image": "http://books.google.com/books/content?id=I-DPEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-08-08T00:00:00.000Z"
        },
        {
            "content_html": "Unleash the Power of Modern Web Development with Typescript KEY FEATURES ● This book offers hands-on examples for Typescript programming ● Advanced Typescript features such as enums, interfaces and namespaces explained ● Shares best practices for structuring TypeScript code using type annotations. Helps develop maintainable and scalable TypeScript code. DESCRIPTION This book provides a comprehensive guide to TypeScript, a programming language that extends JavaScript with powerful features like static typing, classes, and interfaces. The book is divided into thirteen chapters that cover everything from setting up a development environment to building an Angular app with TypeScript. We start with an introduction to TypeScript and its benefits and go on to explain how TypeScript can help developers write more maintainable, scalable code and catch errors before they make it to production. The book then dives into more technical topics like basic type annotations, using the TypeScript compiler, advanced features like enums and interfaces, and manipulating types. The book then discusses chapters on classes and control flow analysis that are particularly helpful for developers looking to build more complex applications. The book teaches by example, with numerous code examples that illustrate the main concepts and approaches towards writing TypeScript programs and codes, and finishes with a comprehensive practical example that shows step-by-step development of a modern web application using TypeScript and Angular. WHAT WILL YOU LEARN ● Learn how to create a new TypeScript project with default settings and configurations. ● Discover how to incorporate basic type-annotations into your code for improved clarity and accuracy. ● Explore the use of type-aliases, interfaces, and enums to write more organized and expressive TypeScript code. ● Gain knowledge on building modular and error-free applications in TypeScript. ● Discover how to leverage type-guards, classes, and other TypeScript utilities to write more robust code. ● Learn how to work with advanced features like generics and take your TypeScript skills to the next level. WHO IS THIS BOOK FOR? This book is targeted towards front-end developers who are familiar with JavaScript and are interested in expanding their skillset with TypeScript. Whether you are a beginner with little to no experience or an intermediate developer looking for a reference guide, this book is designed to help you supercharge your development and enhance your tooling. With its clear and concise explanations, it's perfect for those who are new to TypeScript and looking to gain a deeper understanding of its capabilities. TABLE OF CONTENTS Chapter 1: Introduction to TypeScript and its Benefits Chapter 2: Setting Up a Development Environment Chapter 3: Basic Type Annotations Chapter 4: Using the TypeScript Compiler Chapter 5: Enums, Interfaces, and Namespaces Chapter 6: Objects, Arrays, and Tuples in TypeScript Chapter 7: Functions in TypeScript Chapter 8: Classes in TypeScript Chapter 9: Control Flow Analysis Chapter 10: Manipulating Types Chapter 11: TypeScript Modules Chapter 12: Creating Declaration Files Chapter 13: TypeScript Project: Creating an Angular App<br><blockquote>WHO IS THIS BOOK FOR? This book is targeted towards front-end developers who are familiar with JavaScript and are interested in expanding their skillset with TypeScript.</blockquote>",
            "url": "http://books.google.com/books?id=W9bMEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=3&source=gbs_api",
            "title": "Ultimate Typescript Handbook",
            "summary": "Unleash the Power of Modern Web Development with Typescript KEY FEATURES ● This book offers hands-on examples for Typescript programming ● Advanced Typescript features such as enums, interfaces and namespaces explained ● Shares best practices for structuring TypeScript code using type annotations. Helps develop maintainable and scalable TypeScript code. DESCRIPTION This book provides a comprehensive guide to TypeScript, a programming language that extends JavaScript with powerful features like static typing, classes, and interfaces. The book is divided into thirteen chapters that cover everything from setting up a development environment to building an Angular app with TypeScript. We start with an introduction to TypeScript and its benefits and go on to explain how TypeScript can help developers write more maintainable, scalable code and catch errors before they make it to production. The book then dives into more technical topics like basic type annotations, using the TypeScript compiler, advanced features like enums and interfaces, and manipulating types. The book then discusses chapters on classes and control flow analysis that are particularly helpful for developers looking to build more complex applications. The book teaches by example, with numerous code examples that illustrate the main concepts and approaches towards writing TypeScript programs and codes, and finishes with a comprehensive practical example that shows step-by-step development of a modern web application using TypeScript and Angular. WHAT WILL YOU LEARN ● Learn how to create a new TypeScript project with default settings and configurations. ● Discover how to incorporate basic type-annotations into your code for improved clarity and accuracy. ● Explore the use of type-aliases, interfaces, and enums to write more organized and expressive TypeScript code. ● Gain knowledge on building modular and error-free applications in TypeScript. ● Discover how to leverage type-guards, classes, and other TypeScript utilities to write more robust code. ● Learn how to work with advanced features like generics and take your TypeScript skills to the next level. WHO IS THIS BOOK FOR? This book is targeted towards front-end developers who are familiar with JavaScript and are interested in expanding their skillset with TypeScript. Whether you are a beginner with little to no experience or an intermediate developer looking for a reference guide, this book is designed to help you supercharge your development and enhance your tooling. With its clear and concise explanations, it's perfect for those who are new to TypeScript and looking to gain a deeper understanding of its capabilities. TABLE OF CONTENTS Chapter 1: Introduction to TypeScript and its Benefits Chapter 2: Setting Up a Development Environment Chapter 3: Basic Type Annotations Chapter 4: Using the TypeScript Compiler Chapter 5: Enums, Interfaces, and Namespaces Chapter 6: Objects, Arrays, and Tuples in TypeScript Chapter 7: Functions in TypeScript Chapter 8: Classes in TypeScript Chapter 9: Control Flow Analysis Chapter 10: Manipulating Types Chapter 11: TypeScript Modules Chapter 12: Creating Declaration Files Chapter 13: TypeScript Project: Creating an Angular App",
            "image": "http://books.google.com/books/content?id=W9bMEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-07-18T00:00:00.000Z"
        },
        {
            "content_html": "Apply functional programming techniques to write testable terser code for frontend and backend development with improved clarity, concurrency, and performance Purchase of the print or Kindle book includes a free PDF eBook Key Features Apply functional programming concepts and techniques to everyday JavaScript or TypeScript programming Master functional programming in JavaScript and TypeScript to solve real-world development problems Apply functional programming to get better testable programs with higher modularity and reusability Book Description Functional programming is a programming paradigm that uses functions for developing software. This book is filled with examples that enable you to leverage the latest JavaScript and TypeScript versions to produce modern and clean code, as well as teach you to how apply functional programming techniques to develop more efficient algorithms, write more concise code, and simplify unit testing. This book provides comprehensive coverage of the major topics in functional programming to produce shorter, clearer, and testable programs. You'll begin by getting to grips with writing and testing pure functions, reducing side effects, as well as other key features to make your applications functional in nature. The book specifically explores techniques to simplify coding, apply recursion, perform high-level coding, learn ways to achieve immutability, implement design patterns, and work with data types. By the end of this book, you'll have developed the practical programming skills needed to confidently enhance your applications by adding functional programming to wherever it's most suitable. What you will learn Understand when to use functional programming versus classic object-oriented programming Use declarative coding instead of imperative coding for clearer, more understandable code Know how to avoid side effects and create more reliable code with closures and immutable data Use recursion to help design and implement more understandable solutions to complex problems Define functional programing data types with or without TypeScript, add type checking, and implement immutability Apply advanced containers to get better structures to tackle errors and implement async programming Who this book is for If you are a JavaScript or TypeScript developer looking to enhance your programming skills, then this book is for you. The book applies to both frontend developers working with frameworks such as React, Vue, or Angular as well as backend developers using Node.js or Deno.<br><blockquote>This book is filled with examples that enable you to leverage the latest JavaScript and TypeScript versions to produce modern and clean code, as well as teach you to how apply functional programming techniques to develop more efficient ...</blockquote>",
            "url": "http://books.google.com/books?id=G9a4EAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=4&source=gbs_api",
            "title": "Mastering JavaScript Functional Programming",
            "summary": "Apply functional programming techniques to write testable terser code for frontend and backend development with improved clarity, concurrency, and performance Purchase of the print or Kindle book includes a free PDF eBook Key Features Apply functional programming concepts and techniques to everyday JavaScript or TypeScript programming Master functional programming in JavaScript and TypeScript to solve real-world development problems Apply functional programming to get better testable programs with higher modularity and reusability Book Description Functional programming is a programming paradigm that uses functions for developing software. This book is filled with examples that enable you to leverage the latest JavaScript and TypeScript versions to produce modern and clean code, as well as teach you to how apply functional programming techniques to develop more efficient algorithms, write more concise code, and simplify unit testing. This book provides comprehensive coverage of the major topics in functional programming to produce shorter, clearer, and testable programs. You'll begin by getting to grips with writing and testing pure functions, reducing side effects, as well as other key features to make your applications functional in nature. The book specifically explores techniques to simplify coding, apply recursion, perform high-level coding, learn ways to achieve immutability, implement design patterns, and work with data types. By the end of this book, you'll have developed the practical programming skills needed to confidently enhance your applications by adding functional programming to wherever it's most suitable. What you will learn Understand when to use functional programming versus classic object-oriented programming Use declarative coding instead of imperative coding for clearer, more understandable code Know how to avoid side effects and create more reliable code with closures and immutable data Use recursion to help design and implement more understandable solutions to complex problems Define functional programing data types with or without TypeScript, add type checking, and implement immutability Apply advanced containers to get better structures to tackle errors and implement async programming Who this book is for If you are a JavaScript or TypeScript developer looking to enhance your programming skills, then this book is for you. The book applies to both frontend developers working with frameworks such as React, Vue, or Angular as well as backend developers using Node.js or Deno.",
            "image": "http://books.google.com/books/content?id=G9a4EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-04-28T00:00:00.000Z"
        },
        {
            "content_html": "Get familiar with React design patterns and best practices to solve common React development problems KEY FEATURES ● Get tips to create a better React app architecture. ● Explore the best practices for building scalable React apps. ● Discover ways to write tests for your React applications. DESCRIPTION React is a JavaScript library created by Facebook to help build applications with components. In React, there are proven methods to solve common problems experienced by React developers. If you are looking for different ways how to choose your pattern when building a React app, then this book is for you. The book starts by sharing the best practices for architecting your React app. It then helps you learn how to create clean, performant, and maintainable React components using JavaScript and TypeScript. The book helps you explore and work with some useful hooks in React. It also helps you learn how to enable server-side rendering for your React app. Later, the book will help you discover ways to style your React components effectively. Towards the end, the book will help you learn how to write tests for your React applications. By the end of the book, you will be able to build complex and maintainable React apps with JavaScript and TypeScript. WHAT YOU WILL LEARN ● Learn how to manage State with Hooks on React components. ● Learn how to style React components with CSS. ● Understand how to use Next.js for server-side rendering of your React app. ● Explore different ways to fetch data using API in React. ● Test your React app with React testing library, Jest, and Cypress. WHO THIS BOOK IS FOR This book is for Web developers, JavaScript developers, and Typescript developers who want to build complex and scalable apps with React. Software engineers and developers who are early in their React careers will find this book very helpful. TABLE OF CONTENTS 1. React Anti-Patterns and Best Practices 2. Writing Components 3. Clean and Maintainable Code 4. React Hooks 5. Styling 6. Server-Side Renderings 7. Data Fetching 8. Building Scalable Applications 9. Testing<br><blockquote>If you are looking for different ways how to choose your pattern when building a React app, then this book is for you. The book starts by sharing the best practices for architecting your React app.</blockquote>",
            "url": "http://books.google.com/books?id=UfmpEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=5&source=gbs_api",
            "title": "React.js Design Patterns",
            "summary": "Get familiar with React design patterns and best practices to solve common React development problems KEY FEATURES ● Get tips to create a better React app architecture. ● Explore the best practices for building scalable React apps. ● Discover ways to write tests for your React applications. DESCRIPTION React is a JavaScript library created by Facebook to help build applications with components. In React, there are proven methods to solve common problems experienced by React developers. If you are looking for different ways how to choose your pattern when building a React app, then this book is for you. The book starts by sharing the best practices for architecting your React app. It then helps you learn how to create clean, performant, and maintainable React components using JavaScript and TypeScript. The book helps you explore and work with some useful hooks in React. It also helps you learn how to enable server-side rendering for your React app. Later, the book will help you discover ways to style your React components effectively. Towards the end, the book will help you learn how to write tests for your React applications. By the end of the book, you will be able to build complex and maintainable React apps with JavaScript and TypeScript. WHAT YOU WILL LEARN ● Learn how to manage State with Hooks on React components. ● Learn how to style React components with CSS. ● Understand how to use Next.js for server-side rendering of your React app. ● Explore different ways to fetch data using API in React. ● Test your React app with React testing library, Jest, and Cypress. WHO THIS BOOK IS FOR This book is for Web developers, JavaScript developers, and Typescript developers who want to build complex and scalable apps with React. Software engineers and developers who are early in their React careers will find this book very helpful. TABLE OF CONTENTS 1. React Anti-Patterns and Best Practices 2. Writing Components 3. Clean and Maintainable Code 4. React Hooks 5. Styling 6. Server-Side Renderings 7. Data Fetching 8. Building Scalable Applications 9. Testing",
            "image": "http://books.google.com/books/content?id=UfmpEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2023-01-27T00:00:00.000Z"
        },
        {
            "content_html": "Learn how React Native works under the hood and what this means for building large-scale, cross-platform, production-ready applications without compromising on the quality and performance Key FeaturesExplore a modern approach to React Native, covering state management, animations, gestures, and moreImplement best practices and practical techniques for creating large-scale, production-ready appsCreate a development process including workflow automation with GitHub Actions, Fastlane, and BitriseBook Description The React Native framework offers a range of powerful features that make it possible to efficiently build high-quality, easy-to-maintain frontend applications across multiple platforms such as iOS, Android, Linux, Mac OS X, Windows, and the web, helping you save both time and money. And this book is your key to unlocking its capabilities. Professional React Native provides the ultimate coverage of essential concepts, best practices, advanced processes, and tips for everyday developer problems. The book makes it easy to understand how React Native works under the hood using step-by-step explanations and practical examples so you can use this knowledge to develop highly performant apps. As you follow along, you'll learn the difference between React and React Native, navigate the React Native ecosystem, and revisit the basics of JavaScript and TypeScript needed to create a React Native application. What's more, you'll work with animations and even control your app with gestures. Finally, you'll be able to structure larger apps and improve developer efficiency through automated processes, testing, and continuous integration. By the end of this React native app development book, you'll have gained the confidence to build high-performance apps for multiple platforms, even on a bigger scale. What you will learnBecome familiar with how React Native works under the hoodUnderstand how to make the most of React Native for app developmentExplore different approaches to building apps across various platformsBecome familiar with process automation and automated testingContribute to open source code and structure your own code libraryUnderstand how to set up the architecture for bigger React Native projectsWho this book is for This book is for developers who want to get started with React Native as well as experienced React Native developers interested in building professional cross-platform applications. Familiarity with the basics of JavaScript (including its syntax) and general software engineering concepts, such as data types, control flows, and server/client structures, is required. Although useful, experience with React Native is not necessary.<br><blockquote>And this book is your key to unlocking its capabilities. Professional React Native provides the ultimate coverage of essential concepts, best practices, advanced processes, and tips for everyday developer problems.</blockquote>",
            "url": "http://books.google.com/books?id=pXuUEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=6&source=gbs_api",
            "title": "Professional React Native",
            "summary": "Learn how React Native works under the hood and what this means for building large-scale, cross-platform, production-ready applications without compromising on the quality and performance Key FeaturesExplore a modern approach to React Native, covering state management, animations, gestures, and moreImplement best practices and practical techniques for creating large-scale, production-ready appsCreate a development process including workflow automation with GitHub Actions, Fastlane, and BitriseBook Description The React Native framework offers a range of powerful features that make it possible to efficiently build high-quality, easy-to-maintain frontend applications across multiple platforms such as iOS, Android, Linux, Mac OS X, Windows, and the web, helping you save both time and money. And this book is your key to unlocking its capabilities. Professional React Native provides the ultimate coverage of essential concepts, best practices, advanced processes, and tips for everyday developer problems. The book makes it easy to understand how React Native works under the hood using step-by-step explanations and practical examples so you can use this knowledge to develop highly performant apps. As you follow along, you'll learn the difference between React and React Native, navigate the React Native ecosystem, and revisit the basics of JavaScript and TypeScript needed to create a React Native application. What's more, you'll work with animations and even control your app with gestures. Finally, you'll be able to structure larger apps and improve developer efficiency through automated processes, testing, and continuous integration. By the end of this React native app development book, you'll have gained the confidence to build high-performance apps for multiple platforms, even on a bigger scale. What you will learnBecome familiar with how React Native works under the hoodUnderstand how to make the most of React Native for app developmentExplore different approaches to building apps across various platformsBecome familiar with process automation and automated testingContribute to open source code and structure your own code libraryUnderstand how to set up the architecture for bigger React Native projectsWho this book is for This book is for developers who want to get started with React Native as well as experienced React Native developers interested in building professional cross-platform applications. Familiarity with the basics of JavaScript (including its syntax) and general software engineering concepts, such as data types, control flows, and server/client structures, is required. Although useful, experience with React Native is not necessary.",
            "image": "http://books.google.com/books/content?id=pXuUEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-10-31T00:00:00.000Z"
        },
        {
            "content_html": "Learn Deno with TypeScript KEY FEATURES ● Take advantage of modern tools and frameworks like React and GraphQL. ● Exposure to the Deno ecosystem and many different third-party modules. ● Coverage of the creation of UIs and APIs for numerous apps. DESCRIPTION Deno is a web platform that offers capabilities for JavaScript and TypeScript and supports modern web standards. It is a straightforward, up-to-date, secure runtime environment for web developers. This book will teach all you need to know about Deno's primitives, its ideas, and how you can use them to build applications that work in the real world. The book's first part is devoted to familiarizing you with Deno's runtime and comprehensive ecosystem. This book will help you to get familiar with TypeScript and experiment with Deno. The book will also help you to learn about GraphQL and Oak and build basic scripts. It will help you to design basic web applications such as a phonebook application and a to-do list application, both of which will have their user interfaces (UI) and APIs developed. This book will help you to get a good level of confidence with Deno over NodeJS so that you can start using Deno to build, maintain, and deploy web apps that are reliable and secure. WHAT YOU WILL LEARN ● Get started with the basics of TypeScript and Deno. ● Use Deno to create your next React or Svelte app's user interface. ● Develop a GraphQL API server with Deno. ● Make the most of TypeScript when creating applications. ● Take advantage of the various plugins that Deno and its creators offer. WHO THIS BOOK IS FOR Readers interested in utilizing the power of Deno to fuel their apps, whether they are web developers, TypeScript users, or JavaScript users will find this book helpful. The code will be easier to understand if you are familiar with JavaScript already. TABLE OF CONTENTS 1. The Deno Land 2. Introduction to TypeScript 3. Setting Up Deno 4. Deno Ecosystem 5. Todos App - API 6. Todos App - UI Implementation 7. Introduction to GraphQL, Oak, and Oak-GraphQL 8. PhoneBook App—API Implementation 9. PhoneBook App—UI Implementation<br><blockquote>The book&#39;s first part is devoted to familiarizing you with Deno&#39;s runtime and comprehensive ecosystem. This book will help you to get familiar with TypeScript and experiment with Deno.</blockquote>",
            "url": "http://books.google.com/books?id=JK-TEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=7&source=gbs_api",
            "title": "Modern Web Development with Deno",
            "summary": "Learn Deno with TypeScript KEY FEATURES ● Take advantage of modern tools and frameworks like React and GraphQL. ● Exposure to the Deno ecosystem and many different third-party modules. ● Coverage of the creation of UIs and APIs for numerous apps. DESCRIPTION Deno is a web platform that offers capabilities for JavaScript and TypeScript and supports modern web standards. It is a straightforward, up-to-date, secure runtime environment for web developers. This book will teach all you need to know about Deno's primitives, its ideas, and how you can use them to build applications that work in the real world. The book's first part is devoted to familiarizing you with Deno's runtime and comprehensive ecosystem. This book will help you to get familiar with TypeScript and experiment with Deno. The book will also help you to learn about GraphQL and Oak and build basic scripts. It will help you to design basic web applications such as a phonebook application and a to-do list application, both of which will have their user interfaces (UI) and APIs developed. This book will help you to get a good level of confidence with Deno over NodeJS so that you can start using Deno to build, maintain, and deploy web apps that are reliable and secure. WHAT YOU WILL LEARN ● Get started with the basics of TypeScript and Deno. ● Use Deno to create your next React or Svelte app's user interface. ● Develop a GraphQL API server with Deno. ● Make the most of TypeScript when creating applications. ● Take advantage of the various plugins that Deno and its creators offer. WHO THIS BOOK IS FOR Readers interested in utilizing the power of Deno to fuel their apps, whether they are web developers, TypeScript users, or JavaScript users will find this book helpful. The code will be easier to understand if you are familiar with JavaScript already. TABLE OF CONTENTS 1. The Deno Land 2. Introduction to TypeScript 3. Setting Up Deno 4. Deno Ecosystem 5. Todos App - API 6. Todos App - UI Implementation 7. Introduction to GraphQL, Oak, and Oak-GraphQL 8. PhoneBook App—API Implementation 9. PhoneBook App—UI Implementation",
            "image": "http://books.google.com/books/content?id=JK-TEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-10-07T00:00:00.000Z"
        },
        {
            "content_html": "Design, build and deploy robust web applications using ASP.NET 6, Angular 13, and Entity Framework Core Key FeaturesThe most up-to-date book that covers cutting-edge features released in ASP.NET Core 6 and Angular 13Create a production-ready Single-Page Application (SPA) or Progressive Web Application (PWA)Adopt a full-stack approach to handle data management, API documentation, Web APIs, end-to-end testing, security, and deploymentBook Description Every full-stack ninja needs the tools to operate on front-end and back-end application development. This web app development book takes a hands-on, project-based approach to provide you with all the tools and techniques that web developers need to create, debug, and deploy efficient web applications using ASP.NET Core and Angular. The fifth edition has been updated to cover advanced topics such as Minimal APIs, Web APIs with GraphQL, real-time updates with SignalR, and new features in .NET 6 and Angular 13. You begin by building a data model with Entity Framework Core, alongside utilizing the Entity Core Fluent API and EntityTypeConfiguration class. You'll learn how to fetch and display data and handle user input with Angular reactive forms and front-end and back-end validators for maximum effect. Later, you will perform advanced debugging and explore the unit testing features provided by xUnit.net (.NET 6) and Jasmine, as well as Karma for Angular. After adding authentication and authorization to your apps, you will explore progressive web applications, learning about their technical requirements, testing processes, and how to convert a standard web application to a PWA. By the end of this web development book, you will understand how to tie together the front-end and back-end to build and deploy secure and robust web applications. What you will learnUse the new Visual Studio Standalone TypeScript Angular templateImplement and consume a Web API interface with ASP.NET CoreSet up an SQL database server using a local instance or a cloud datastorePerform C# and TypeScript debugging using Visual Studio 2022Create TDD and BDD unit tests using xUnit, Jasmine, and KarmaPerform DBMS structured logging using providers such as SeriLogDeploy web apps to Azure App Service using IIS, Kestrel, and NGINXLearn to develop fast and flexible Web APIs using GraphQLAdd real-time capabilities to Angular apps with ASP.NET Core SignalRWho this book is for This book is for experienced ASP.NET developers who already possess some familiarity with ASP.NET Core and Angular and are looking to learn how to use them effectively together. The fully documented code samples (also available on GitHub) and the step-by-step implementation tutorials make this book easy to follow.<br><blockquote>The fully documented code samples (also available on GitHub) and the step-by-step implementation tutorials make this book easy to follow.</blockquote>",
            "url": "http://books.google.com/books?id=9txmEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=8&source=gbs_api",
            "title": "ASP.NET Core 6 and Angular",
            "summary": "Design, build and deploy robust web applications using ASP.NET 6, Angular 13, and Entity Framework Core Key FeaturesThe most up-to-date book that covers cutting-edge features released in ASP.NET Core 6 and Angular 13Create a production-ready Single-Page Application (SPA) or Progressive Web Application (PWA)Adopt a full-stack approach to handle data management, API documentation, Web APIs, end-to-end testing, security, and deploymentBook Description Every full-stack ninja needs the tools to operate on front-end and back-end application development. This web app development book takes a hands-on, project-based approach to provide you with all the tools and techniques that web developers need to create, debug, and deploy efficient web applications using ASP.NET Core and Angular. The fifth edition has been updated to cover advanced topics such as Minimal APIs, Web APIs with GraphQL, real-time updates with SignalR, and new features in .NET 6 and Angular 13. You begin by building a data model with Entity Framework Core, alongside utilizing the Entity Core Fluent API and EntityTypeConfiguration class. You'll learn how to fetch and display data and handle user input with Angular reactive forms and front-end and back-end validators for maximum effect. Later, you will perform advanced debugging and explore the unit testing features provided by xUnit.net (.NET 6) and Jasmine, as well as Karma for Angular. After adding authentication and authorization to your apps, you will explore progressive web applications, learning about their technical requirements, testing processes, and how to convert a standard web application to a PWA. By the end of this web development book, you will understand how to tie together the front-end and back-end to build and deploy secure and robust web applications. What you will learnUse the new Visual Studio Standalone TypeScript Angular templateImplement and consume a Web API interface with ASP.NET CoreSet up an SQL database server using a local instance or a cloud datastorePerform C# and TypeScript debugging using Visual Studio 2022Create TDD and BDD unit tests using xUnit, Jasmine, and KarmaPerform DBMS structured logging using providers such as SeriLogDeploy web apps to Azure App Service using IIS, Kestrel, and NGINXLearn to develop fast and flexible Web APIs using GraphQLAdd real-time capabilities to Angular apps with ASP.NET Core SignalRWho this book is for This book is for experienced ASP.NET developers who already possess some familiarity with ASP.NET Core and Angular and are looking to learn how to use them effectively together. The fully documented code samples (also available on GitHub) and the step-by-step implementation tutorials make this book easy to follow.",
            "image": "http://books.google.com/books/content?id=9txmEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-04-06T00:00:00.000Z"
        },
        {
            "content_html": "Of late, TypeScript has risen in popularity owing to its ease of use and versatile compatibility. As such, more and more developers are looking to quickly and efficiently master TypeScript. If you’re looking for a detailed, yet easy to comprehend guide to TypeScript, your search ends here! The book is a detailed guide that will help learners get started with TypeScript programming in no time. It talks about the basics and then moves on to practical exercises to help readers quickly gain the required knowledge. The book is meant for both JavaScript developers and learners without a formal JS background. Furthermore, while a background in JavaScript programming might be of help, the book requires no prior coding background and can be easily mastered even by beginners. What Will You Learn: Detailed focus on TypeScript programming Introduction to TypeScript concepts and paradigm Introduction to TS architecture and components OOP programming with TS Web development in TypeScript Who Is This Book for: Web developers looking to learn TypeScript; web development beginners; JavaScript developers; and frontend developers. About the Author Sufyan bin Uzayr is a writer, coder, and entrepreneur with more than a decade of experience in the industry. He has authored several books in the past, pertaining to a diverse range of topics, ranging from History to Computers/IT. Sufyan is the Director of Parakozm, a multinational IT company specializing in EdTech solutions. He also runs Zeba Academy, an online learning and teaching vertical with a focus on STEM fields. Sufyan specializes in a wide variety of technologies, such as JavaScript, Dart, WordPress, Drupal, Linux, and Python. He holds multiple degrees, including ones in Management, IT, Literature, and Political Science. Sufyan is a digital nomad, dividing his time between four countries. He has lived and taught in universities and educational institutions around the globe. Sufyan takes a keen interest in technology, politics, literature, history, and sports, and in his spare time, he enjoys teaching coding and English to young students. Learn more at sufyanism.com<br><blockquote>What Will You Learn: Detailed focus on TypeScript programming Introduction to TypeScript concepts and paradigm Introduction to TS architecture and components OOP programming with TS Web development in TypeScript Who Is This Book for: Web ...</blockquote>",
            "url": "http://books.google.com/books?id=P-lZEAAAQBAJ&printsec=frontcover&dq=TypeScript&hl=&cd=9&source=gbs_api",
            "title": "TypeScript for Beginners",
            "summary": "Of late, TypeScript has risen in popularity owing to its ease of use and versatile compatibility. As such, more and more developers are looking to quickly and efficiently master TypeScript. If you’re looking for a detailed, yet easy to comprehend guide to TypeScript, your search ends here! The book is a detailed guide that will help learners get started with TypeScript programming in no time. It talks about the basics and then moves on to practical exercises to help readers quickly gain the required knowledge. The book is meant for both JavaScript developers and learners without a formal JS background. Furthermore, while a background in JavaScript programming might be of help, the book requires no prior coding background and can be easily mastered even by beginners. What Will You Learn: Detailed focus on TypeScript programming Introduction to TypeScript concepts and paradigm Introduction to TS architecture and components OOP programming with TS Web development in TypeScript Who Is This Book for: Web developers looking to learn TypeScript; web development beginners; JavaScript developers; and frontend developers. About the Author Sufyan bin Uzayr is a writer, coder, and entrepreneur with more than a decade of experience in the industry. He has authored several books in the past, pertaining to a diverse range of topics, ranging from History to Computers/IT. Sufyan is the Director of Parakozm, a multinational IT company specializing in EdTech solutions. He also runs Zeba Academy, an online learning and teaching vertical with a focus on STEM fields. Sufyan specializes in a wide variety of technologies, such as JavaScript, Dart, WordPress, Drupal, Linux, and Python. He holds multiple degrees, including ones in Management, IT, Literature, and Political Science. Sufyan is a digital nomad, dividing his time between four countries. He has lived and taught in universities and educational institutions around the globe. Sufyan takes a keen interest in technology, politics, literature, history, and sports, and in his spare time, he enjoys teaching coding and English to young students. Learn more at sufyanism.com",
            "image": "http://books.google.com/books/content?id=P-lZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "date_modified": "2022-03-23T00:00:00.000Z"
        },
        {
            "content_html": "Take your first step in building modern-day component-based web apps using the latest features and capabilities of React and TypeScript with this easy-to-follow guide Key Features: Learn to use different React hooks with TypeScript Explore different styling approaches while building React web apps Gain experience in using React Dev Tools to debug components Purchase of the print or Kindle book includes a free PDF eBook Book Description: Reading, navigating, and debugging a large frontend codebase is a major issue faced by frontend developers. This book is designed to help web developers like you learn about ReactJS and TypeScript, both of which power large-scale apps for many organizations. This second edition of Learn React with TypeScript is updated, enhanced, and improved to cover new features of React 18 including hooks, state management libraries, and features of TypeScript 4. The book will enable you to create well-structured and reusable React components that are easy to read and maintain, leveraging modern design patterns. You'll be able to ensure that all your components are type-safe, making the most of TypeScript features, including some advanced types. You'll also learn how to manage complex states using Redux and how to interact with a GraphQL web API. Finally, you'll discover how to write robust unit tests for React components using Jest. By the end of the book, you'll be well-equipped to use both React and TypeScript. What You Will Learn: Gain first-hand experience of TypeScript and its productivity features Understand how to transpile your TypeScript code into JavaScript for running in a browser Build a React frontend codebase with hooks Interact with REST and GraphQL web APIs Design and develop strongly typed reusable components Create automated component tests Who this book is for: This book is for experienced frontend developers looking to build large scale web applications using React and TypeScript. Intermediate knowledge of JavaScript, HTML and CSS is a prerequisite.<br><blockquote>This second edition of Learn React with TypeScript is updated, enhanced, and improved to cover new features of React 18 including hooks, state management libraries, and features of TypeScript 4.</blockquote>",
            "url": "http://books.google.com/books?id=blNazwEACAAJ&dq=TypeScript&hl=&cd=10&source=gbs_api",
            "title": "Learn React with TypeScript - Second Edition",
            "summary": "Take your first step in building modern-day component-based web apps using the latest features and capabilities of React and TypeScript with this easy-to-follow guide Key Features: Learn to use different React hooks with TypeScript Explore different styling approaches while building React web apps Gain experience in using React Dev Tools to debug components Purchase of the print or Kindle book includes a free PDF eBook Book Description: Reading, navigating, and debugging a large frontend codebase is a major issue faced by frontend developers. This book is designed to help web developers like you learn about ReactJS and TypeScript, both of which power large-scale apps for many organizations. This second edition of Learn React with TypeScript is updated, enhanced, and improved to cover new features of React 18 including hooks, state management libraries, and features of TypeScript 4. The book will enable you to create well-structured and reusable React components that are easy to read and maintain, leveraging modern design patterns. You'll be able to ensure that all your components are type-safe, making the most of TypeScript features, including some advanced types. You'll also learn how to manage complex states using Redux and how to interact with a GraphQL web API. Finally, you'll discover how to write robust unit tests for React components using Jest. By the end of the book, you'll be well-equipped to use both React and TypeScript. What You Will Learn: Gain first-hand experience of TypeScript and its productivity features Understand how to transpile your TypeScript code into JavaScript for running in a browser Build a React frontend codebase with hooks Interact with REST and GraphQL web APIs Design and develop strongly typed reusable components Create automated component tests Who this book is for: This book is for experienced frontend developers looking to build large scale web applications using React and TypeScript. Intermediate knowledge of JavaScript, HTML and CSS is a prerequisite.",
            "image": "http://books.google.com/books/content?id=blNazwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "date_modified": "2023-03-03T00:00:00.000Z"
        }
    ]
}